{
  "uuid": "136c7a84-3f71-41cf-94ce-ad25ee943d3e",
  "created_at": "2025-11-22 19:59:18",
  "raw_json": {
    "article_author": null,
    "article_headline": null,
    "article_modified": null,
    "article_published": null,
    "article_section": null,
    "article_tags": null,
    "canonical_url": "https://www.r-bloggers.com/2025/02/the-dynamic-relationship-of-forks-with-their-upstream-repository/",
    "crawled_at": "2025-11-22T10:54:27.297112",
    "external_links": [
      {
        "href": "https://ropensci.org/blog/2025/02/20/forks-upstream-relationship/",
        "text": "rOpenSci - open tools for open science"
      },
      {
        "href": "http://r-posts.com/",
        "text": "here"
      },
      {
        "href": "https://ropensci.org/coworking/",
        "text": "monthly co-working hours"
      },
      {
        "href": "https://www.openscapes.org/",
        "text": "Openscapes"
      },
      {
        "href": "https://docs.google.com/presentation/d/1aL0TVFM7xxzTCJoE3tEArDE32wh59wkmBCy6Vcmwvy4/",
        "text": "“Forking as a worldview”"
      },
      {
        "href": "https://williamgearty.com/",
        "text": "Will Gearty"
      },
      {
        "href": "https://hugogruson.fr/workbench-beyond-carpentries/",
        "text": "various organizations forking the Carpentries workbench to customize the look and feel of their internal Carpentries-style training materials"
      },
      {
        "href": "https://www.debian.org/doc/debian-policy/ch-source.html#changes-to-the-upstream-sources",
        "text": "Debian package maintainers often tweak some settings or make minor code modifications to improve integration with the rest of the system"
      },
      {
        "href": "https://github.com/epiverse-trace/varnish/pull/7",
        "text": "forked the workbench"
      },
      {
        "href": "https://epiverse-trace.github.io/tutorials",
        "text": "Epiverse-TRACE lessons with their own branding"
      },
      {
        "href": "https://en.wikipedia.org/wiki/Don%27t_repeat_yourself",
        "text": "DRY"
      },
      {
        "href": "https://github.com/carpentries/varnish/pull/151",
        "text": "Hugo submitted a pull request to implement a Sass variable for defining the font"
      },
      {
        "href": "https://github.com/epiverse-trace/varnish/pull/7/commits/b7633fa9107e11d0a5147488b9c9c1c4855f6ff0",
        "text": "make automated changes in a separate commit"
      },
      {
        "href": "https://github.com/ropensci/lightr/commit/4dcb21e72f6df71e2cc46d12244cde8dcc3e2635",
        "text": "in a separate commit"
      },
      {
        "href": "https://github.com/carpentries/sandpaper/pull/448",
        "text": "contributing it back to upstream"
      },
      {
        "href": "https://ropensci.org/blog/2025/02/20/forks-upstream-relationship/#simplifying-syncs",
        "text": "“Simplifying syncs and reducing git conflicts”"
      },
      {
        "href": "https://ropensci.org/blog/2025/02/20/forks-upstream-relationship/",
        "text": "rOpenSci - open tools for open science"
      },
      {
        "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
        "text": "daily e-mail updates"
      },
      {
        "href": "https://www.r-project.org/",
        "text": "R"
      },
      {
        "href": "https://www.r-users.com/",
        "text": "Click here if you're looking to post or find an R/data-science job"
      },
      {
        "href": "http://r-posts.com/",
        "text": "here"
      }
    ],
    "h1_title": "R-bloggers",
    "html_title": "The Dynamic Relationship of Forks with their Upstream Repository | R-bloggers",
    "images": [],
    "internal_links": [
      {
        "href": "https://www.r-bloggers.com/author/ropensci-open-tools-for-open-science/",
        "text": "rOpenSci - open tools for open science"
      },
      {
        "href": "https://www.r-bloggers.com/category/r-bloggers/",
        "text": "R bloggers"
      },
      {
        "href": "https://www.r-bloggers.com/",
        "text": "R-bloggers"
      },
      {
        "href": "https://www.r-bloggers.com/contact-us/",
        "text": "here"
      },
      {
        "href": "https://www.r-bloggers.com/add-your-blog/",
        "text": "click here"
      },
      {
        "href": "https://www.r-bloggers.com/",
        "text": "R-bloggers.com"
      },
      {
        "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
        "text": "learning R"
      },
      {
        "href": "https://www.r-bloggers.com/add-your-blog/",
        "text": "click here"
      }
    ],
    "lang": "en-US",
    "main_html": "<article class=\"post-390736 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">The Dynamic Relationship of Forks with their Upstream Repository</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">February 19, 2025</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/ropensci-open-tools-for-open-science/\">rOpenSci - open tools for open science</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \n<div style=\"min-height: 30px;\">\n[social4i size=\"small\" align=\"align-left\"]\n</div>\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\n[This article was first published on  <strong><a href=\"https://ropensci.org/blog/2025/02/20/forks-upstream-relationship/\"> rOpenSci - open tools for open science</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<h2>\nContext setting\n</h2><p>rOpenSci organizes <a href=\"https://ropensci.org/coworking/\" rel=\"nofollow\" target=\"_blank\">monthly co-working hours</a> on a variety of topics.\nBut the constant is the quality of the discussion that ensues and the renewed energy that comes from it.</p>\n<p>The November coworking session welcomed Stefanie Butland from <a href=\"https://www.openscapes.org/\" rel=\"nofollow\" target=\"_blank\">Openscapes</a> as a co-host.\nShe shared Openscapes’ approach of <a href=\"https://docs.google.com/presentation/d/1aL0TVFM7xxzTCJoE3tEArDE32wh59wkmBCy6Vcmwvy4/\" rel=\"nofollow\" target=\"_blank\">“Forking as a worldview”</a>.\nForks in the open-source software world refer to copies of an existing open-source project that add their own changes on top of the original codebase.\nOpenscapes is extending this classic software development interpretation to an even more open philosophy of encouraging people to take anything that works to new places.\nThings like the value of sharing, reusing, and remixing of <em>how we work</em>, in addition to the work itself.\nStefanie invited participants to share their experiences in forking to adapt or build on existing projects, and we came back to some practical challenges of forking.</p>\n<p>This blog post summarizes and develops some of the insights that emerged during the subsequent discussion,\nwhere we focused on the specific case of forks of open-source codebases,\nsuch as the ones you can find on GitHub.</p>\n<h2>\nThe different types of forks\n</h2><p>We identified two different types of forks, which take place in different contexts,\nand will have different relationships with their upstream repository in the long-run:</p>\n<ol>\n<li>\n<p>Forks can be used as a starting point for a new diverging project, rather than starting from scratch.\nIn this situation, the fork author does not intend to sync with the upstream repository after the initial fork.\nThis type of fork may therefore miss out on new features developed in upstream.\nThis type of fork will often happen when you copy a template for a personal website (an example shared by <a href=\"https://williamgearty.com/\" rel=\"nofollow\" target=\"_blank\">Will Gearty</a> in our discussions),\nor when you re-use an existing project of yours as a boilerplate to build your new project.</p>\n</li>\n<li>\n<p>Forks can also be used to customize or tweak the original project,\nin a way that upstream cannot or doesn’t have capacity to address.\nIn this type of forks, we usually try to not diverge too much from upstream to benefit from new features,\nand we regularly sync with them.\nA major downside is that syncing will often come with gnarly git conflicts.\nAn example of this is <a href=\"https://hugogruson.fr/workbench-beyond-carpentries/\" rel=\"nofollow\" target=\"_blank\">various organizations forking the Carpentries workbench to customize the look and feel of their internal Carpentries-style training materials</a>.\nPeople who work in Linux operating systems, such as Debian, may also recognize this is what happens when open-source projects are packaged by the operating system.\nThe <a href=\"https://www.debian.org/doc/debian-policy/ch-source.html#changes-to-the-upstream-sources\" rel=\"nofollow\" target=\"_blank\">Debian package maintainers often tweak some settings or make minor code modifications to improve integration with the rest of the system</a>.</p>\n</li>\n</ol>\n<h2>\nFacilitating cross-pollination between forks and upstream\n</h2><p>In this section, we focus on the second type of forks,\nwhere the fork author wants to stay in sync with the upstream repository.\nWe mentioned that conflicts were a major downside of this approach.</p>\n<p>What are the strategies to minimize the conflicts?\nAnd why is it in the interest of everyone (not only the fork owners, but also upstream maintainers) to minimize them?</p>\n<h3>\nSimplifying syncs and reducing git conflicts\n</h3><p>Going back to the example of organizations forking the Carpentries workbench,\nHugo has <a href=\"https://github.com/epiverse-trace/varnish/pull/7\" rel=\"nofollow\" target=\"_blank\">forked the workbench</a> to customize <a href=\"https://epiverse-trace.github.io/tutorials\" rel=\"nofollow\" target=\"_blank\">Epiverse-TRACE lessons with their own branding</a>.\nIndeed, the Carpentries workbench provides a fully free and open-source learning management system,\nwhich has accessibility features and pedagogical best practices built-in.\nIt makes sense for external organizations, beyond the Carpentries themselves, to use the workbench as the infrastructure to build and host their training materials.</p>\n<p>However, at the time of writing this post, the workbench doesn’t allow users to customize the theme and adopt a branding different than the official Carpentries one.\nThe recommended way to do this is to fork the workbench and adjust the HTML templates to your needs.</p>\n<p>However, the upstream repository regularly receives updates with bug fixes or new features that forks may want to benefit from.\nThis requires the fork to sync with upstream regularly.</p>\n<p>For the Epiverse Carpentries fork, the few first months were painful because of the conflicts that arose when syncing with upstream.\nBut a couple of recent changes in upstream have greatly reduced the probability of conflicts.</p>\n<p>In a nutshell, upstream can make it easier for forks to stay in sync by reducing the number of files that a fork needs to modify,\nand by isolating these changes in specific locations.</p>\n<p>In practice, this can for example be done by using configuration files and variables.\nThis serves the double purpose of being more <a href=\"https://en.wikipedia.org/wiki/Don%27t_repeat_yourself\" rel=\"nofollow\" target=\"_blank\">DRY</a>\nand of separating changes a fork may want to implement from the core codebase a fork is unlikely to modify.</p>\n<p>Although these changes need to take place in the upstream repository,\nit doesn’t necessarily mean that the upstream maintainers are responsible for making these changes.\nFork maintainers are both the beneficiaries and the best placed to identify required changes,\nand should be encouraged to submit pull requests to upstream to make these changes.</p>\n<p>In the example of the Carpentries workbench, <a href=\"https://github.com/carpentries/varnish/pull/151\" rel=\"nofollow\" target=\"_blank\">Hugo submitted a pull request to implement a Sass variable for defining the font</a>,\nremoving the need to change it in multiple locations.</p>\n<p>On the fork’s side, some other techniques can also make conflict resolution smoother.\nA major location of conflicts are auto-generated changes or files.\nIn the workbench example, this is the concatenated and minified CSS files.\nThey tend to concentrate conflicts because they regroup changes from multiple files,\nand they are minified on a single line, which means git cannot distinguish what was changed.</p>\n<p>But you can automate the conflict resolution for these cases.\nThe key is to <a href=\"https://github.com/epiverse-trace/varnish/pull/7/commits/b7633fa9107e11d0a5147488b9c9c1c4855f6ff0\" rel=\"nofollow\" target=\"_blank\">make automated changes in a separate commit</a>.\nWhen this commit conflicts, you can re-run the script that generates the file,\nand commit the result, without having to think about what should be kept or not.</p>\n<p>Alternatively, upstream can sometimes stop tracking auto-generated files from git,\nand instead render them on the fly at build time.</p>\n<p>In the context of R packages, common auto-generated files are <code>.Rd</code> documentation files,\nwhich are often auto-generated from roxygen2 comments in <code>.R</code> files.\nIsolating these changes <a href=\"https://github.com/ropensci/lightr/commit/4dcb21e72f6df71e2cc46d12244cde8dcc3e2635\" rel=\"nofollow\" target=\"_blank\">in a separate commit</a> can also facilitate conflict resolution.</p>\n<h3>\nIntegrating the fork changes back into upstream\n</h3><p>The previous section highlighted how much work goes into maintaining a fork.\nAnd while we shared techniques to alleviate some of this work, regular syncing is still required, and conflicts are still going to come up from time to time.\nSo, is it perhaps possible to integrate the features to upstream and avoid having to maintain a fork altogether?</p>\n<p>Forks are sometimes intended from the start as short-lived.\nThey only exist until the PR to upstream is merged when the user cannot wait for the PR to be merged, especially if upstream is slow to review PRs.</p>\n<p>But in other cases, forks start as a way to customize a project and accumulate new features, without necessarily the intention to contribute them back initially.\nBut it’s possible for the fork maintainer to change their mind at any time and decide to contribute back.\nIn fact, this can be a very successful contribution scenario.\nForks can indeed be a great way to pilot new features, and to show the value of these features to upstream to motivate their integration.\nIt can also build confidence to show that you’ve been using this feature for a while without issues.</p>\n<p>In the ecosystem of the Carpentries workbench forks, a good example is a contributor exploring python support in their own fork and <a href=\"https://github.com/carpentries/sandpaper/pull/448\" rel=\"nofollow\" target=\"_blank\">contributing it back to upstream</a>.</p>\n<p>Note that it is not always possible to integrate your changes as upstream may have a restricted scope, or limited resources for maintenance.</p>\n<p>When contributing back, each pull request should focus on a single feature or bug fix, rather than pushing all changes the fork has accumulated.</p>\n<h3>\nIt takes two to tango\n</h3><p>Getting forks to contribute back is only possible if they can stay in touch with upstream.\nIndeed, forks that have diverged too much from upstream will have a hard time contributing back, and making nice palatable pull requests.\nIn other words, communication, and where possible, following the steps outlined in the <a href=\"https://ropensci.org/blog/2025/02/20/forks-upstream-relationship/#simplifying-syncs\" rel=\"nofollow\" target=\"_blank\">“Simplifying syncs and reducing git conflicts”</a> section above are key to ensuring forks can more easily stay in sync.</p>\n<p>Conversely, forks benefit from contributing to upstream as it can reduce their maintenance burden.\nThey can either make it easier to sync by reducing the number of changes required to implement their customizations,\nor they can even make their custom features part of the upstream repository.</p>\n<p>This highlights the symbiotic relationship that can exist between forks and upstream repositories, when both parties are willing to make the effort.</p>\n<h2>\nConclusion\n</h2><p>While sometimes presented as a fracture, forks are an integral part of the open-source ecosystem.\nThey offer a way to build on existing projects, to add extra features without increasing the maintenance burden of the upstream repository, and to pilot new features.\nThey can be hard to maintain, but it is also possible for the fork and upstream maintainers to work together to make the process smoother.</p>\n<p>We would love to hear from you if you’ve forked or if you’re considering forking a project.\nWhat were your motivations?\nDo you plan trying to contribute back to upstream?\nWhat challenges have you faced?\nWhat techniques have you found useful to maintain your fork?</p>\n<p><strong>Thank you to Daniel Morillo, John Ellis, Mark Padgham, Pablo Serrati, Richard Litt, Sergio Cabrera, Will Gearty and Yanina Bellini Saibene for their insights during the coworking session and their comments during the production of this post.</strong></p>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://ropensci.org/blog/2025/02/20/forks-upstream-relationship/\"> rOpenSci - open tools for open science</a></strong>.</div>\n<hr/>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\n\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div> </div>\n</article>",
    "main_text": "The Dynamic Relationship of Forks with their Upstream Repository\nPosted on\nFebruary 19, 2025\nby\nrOpenSci - open tools for open science\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nrOpenSci - open tools for open science\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nContext setting\nrOpenSci organizes\nmonthly co-working hours\non a variety of topics.\nBut the constant is the quality of the discussion that ensues and the renewed energy that comes from it.\nThe November coworking session welcomed Stefanie Butland from\nOpenscapes\nas a co-host.\nShe shared Openscapes’ approach of\n“Forking as a worldview”\n.\nForks in the open-source software world refer to copies of an existing open-source project that add their own changes on top of the original codebase.\nOpenscapes is extending this classic software development interpretation to an even more open philosophy of encouraging people to take anything that works to new places.\nThings like the value of sharing, reusing, and remixing of\nhow we work\n, in addition to the work itself.\nStefanie invited participants to share their experiences in forking to adapt or build on existing projects, and we came back to some practical challenges of forking.\nThis blog post summarizes and develops some of the insights that emerged during the subsequent discussion,\nwhere we focused on the specific case of forks of open-source codebases,\nsuch as the ones you can find on GitHub.\nThe different types of forks\nWe identified two different types of forks, which take place in different contexts,\nand will have different relationships with their upstream repository in the long-run:\nForks can be used as a starting point for a new diverging project, rather than starting from scratch.\nIn this situation, the fork author does not intend to sync with the upstream repository after the initial fork.\nThis type of fork may therefore miss out on new features developed in upstream.\nThis type of fork will often happen when you copy a template for a personal website (an example shared by\nWill Gearty\nin our discussions),\nor when you re-use an existing project of yours as a boilerplate to build your new project.\nForks can also be used to customize or tweak the original project,\nin a way that upstream cannot or doesn’t have capacity to address.\nIn this type of forks, we usually try to not diverge too much from upstream to benefit from new features,\nand we regularly sync with them.\nA major downside is that syncing will often come with gnarly git conflicts.\nAn example of this is\nvarious organizations forking the Carpentries workbench to customize the look and feel of their internal Carpentries-style training materials\n.\nPeople who work in Linux operating systems, such as Debian, may also recognize this is what happens when open-source projects are packaged by the operating system.\nThe\nDebian package maintainers often tweak some settings or make minor code modifications to improve integration with the rest of the system\n.\nFacilitating cross-pollination between forks and upstream\nIn this section, we focus on the second type of forks,\nwhere the fork author wants to stay in sync with the upstream repository.\nWe mentioned that conflicts were a major downside of this approach.\nWhat are the strategies to minimize the conflicts?\nAnd why is it in the interest of everyone (not only the fork owners, but also upstream maintainers) to minimize them?\nSimplifying syncs and reducing git conflicts\nGoing back to the example of organizations forking the Carpentries workbench,\nHugo has\nforked the workbench\nto customize\nEpiverse-TRACE lessons with their own branding\n.\nIndeed, the Carpentries workbench provides a fully free and open-source learning management system,\nwhich has accessibility features and pedagogical best practices built-in.\nIt makes sense for external organizations, beyond the Carpentries themselves, to use the workbench as the infrastructure to build and host their training materials.\nHowever, at the time of writing this post, the workbench doesn’t allow users to customize the theme and adopt a branding different than the official Carpentries one.\nThe recommended way to do this is to fork the workbench and adjust the HTML templates to your needs.\nHowever, the upstream repository regularly receives updates with bug fixes or new features that forks may want to benefit from.\nThis requires the fork to sync with upstream regularly.\nFor the Epiverse Carpentries fork, the few first months were painful because of the conflicts that arose when syncing with upstream.\nBut a couple of recent changes in upstream have greatly reduced the probability of conflicts.\nIn a nutshell, upstream can make it easier for forks to stay in sync by reducing the number of files that a fork needs to modify,\nand by isolating these changes in specific locations.\nIn practice, this can for example be done by using configuration files and variables.\nThis serves the double purpose of being more\nDRY\nand of separating changes a fork may want to implement from the core codebase a fork is unlikely to modify.\nAlthough these changes need to take place in the upstream repository,\nit doesn’t necessarily mean that the upstream maintainers are responsible for making these changes.\nFork maintainers are both the beneficiaries and the best placed to identify required changes,\nand should be encouraged to submit pull requests to upstream to make these changes.\nIn the example of the Carpentries workbench,\nHugo submitted a pull request to implement a Sass variable for defining the font\n,\nremoving the need to change it in multiple locations.\nOn the fork’s side, some other techniques can also make conflict resolution smoother.\nA major location of conflicts are auto-generated changes or files.\nIn the workbench example, this is the concatenated and minified CSS files.\nThey tend to concentrate conflicts because they regroup changes from multiple files,\nand they are minified on a single line, which means git cannot distinguish what was changed.\nBut you can automate the conflict resolution for these cases.\nThe key is to\nmake automated changes in a separate commit\n.\nWhen this commit conflicts, you can re-run the script that generates the file,\nand commit the result, without having to think about what should be kept or not.\nAlternatively, upstream can sometimes stop tracking auto-generated files from git,\nand instead render them on the fly at build time.\nIn the context of R packages, common auto-generated files are\n.Rd\ndocumentation files,\nwhich are often auto-generated from roxygen2 comments in\n.R\nfiles.\nIsolating these changes\nin a separate commit\ncan also facilitate conflict resolution.\nIntegrating the fork changes back into upstream\nThe previous section highlighted how much work goes into maintaining a fork.\nAnd while we shared techniques to alleviate some of this work, regular syncing is still required, and conflicts are still going to come up from time to time.\nSo, is it perhaps possible to integrate the features to upstream and avoid having to maintain a fork altogether?\nForks are sometimes intended from the start as short-lived.\nThey only exist until the PR to upstream is merged when the user cannot wait for the PR to be merged, especially if upstream is slow to review PRs.\nBut in other cases, forks start as a way to customize a project and accumulate new features, without necessarily the intention to contribute them back initially.\nBut it’s possible for the fork maintainer to change their mind at any time and decide to contribute back.\nIn fact, this can be a very successful contribution scenario.\nForks can indeed be a great way to pilot new features, and to show the value of these features to upstream to motivate their integration.\nIt can also build confidence to show that you’ve been using this feature for a while without issues.\nIn the ecosystem of the Carpentries workbench forks, a good example is a contributor exploring python support in their own fork and\ncontributing it back to upstream\n.\nNote that it is not always possible to integrate your changes as upstream may have a restricted scope, or limited resources for maintenance.\nWhen contributing back, each pull request should focus on a single feature or bug fix, rather than pushing all changes the fork has accumulated.\nIt takes two to tango\nGetting forks to contribute back is only possible if they can stay in touch with upstream.\nIndeed, forks that have diverged too much from upstream will have a hard time contributing back, and making nice palatable pull requests.\nIn other words, communication, and where possible, following the steps outlined in the\n“Simplifying syncs and reducing git conflicts”\nsection above are key to ensuring forks can more easily stay in sync.\nConversely, forks benefit from contributing to upstream as it can reduce their maintenance burden.\nThey can either make it easier to sync by reducing the number of changes required to implement their customizations,\nor they can even make their custom features part of the upstream repository.\nThis highlights the symbiotic relationship that can exist between forks and upstream repositories, when both parties are willing to make the effort.\nConclusion\nWhile sometimes presented as a fracture, forks are an integral part of the open-source ecosystem.\nThey offer a way to build on existing projects, to add extra features without increasing the maintenance burden of the upstream repository, and to pilot new features.\nThey can be hard to maintain, but it is also possible for the fork and upstream maintainers to work together to make the process smoother.\nWe would love to hear from you if you’ve forked or if you’re considering forking a project.\nWhat were your motivations?\nDo you plan trying to contribute back to upstream?\nWhat challenges have you faced?\nWhat techniques have you found useful to maintain your fork?\nThank you to Daniel Morillo, John Ellis, Mark Padgham, Pablo Serrati, Richard Litt, Sergio Cabrera, Will Gearty and Yanina Bellini Saibene for their insights during the coworking session and their comments during the production of this post.\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nrOpenSci - open tools for open science\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
    "meta_description": "Context setting rOpenSci organizes monthly co-working hours on a variety of topics. But the constant is the quality of the discussion that ensues and the renewed energy that comes from it. The November coworking session welcomed Stefanie Butland from...",
    "meta_keywords": null,
    "og_description": "Context setting rOpenSci organizes monthly co-working hours on a variety of topics. But the constant is the quality of the discussion that ensues and the renewed energy that comes from it. The November coworking session welcomed Stefanie Butland from...",
    "og_image": "https://www.r-bloggers.com/wp-content/uploads/2016/04/R_02_2016-05-01.png",
    "og_title": "The Dynamic Relationship of Forks with their Upstream Repository | R-bloggers",
    "raw_jsonld_article": null,
    "reading_time_min": 8.9,
    "sitemap_lastmod": null,
    "twitter_description": "Context setting rOpenSci organizes monthly co-working hours on a variety of topics. But the constant is the quality of the discussion that ensues and the renewed energy that comes from it. The November coworking session welcomed Stefanie Butland from...",
    "twitter_title": "The Dynamic Relationship of Forks with their Upstream Repository | R-bloggers",
    "url": "https://www.r-bloggers.com/2025/02/the-dynamic-relationship-of-forks-with-their-upstream-repository/",
    "word_count": 1777
  }
}