{
  "id": "339970ea23627a61258cd6541807d4b480992309",
  "url": "https://www.r-bloggers.com/2009/07/influence-me-simple-analysis/",
  "created_at_utc": "2025-11-17T20:40:41Z",
  "data": null,
  "raw_original": {
    "uuid": "03939e7a-e803-41b7-aeaa-dbd152060e9b",
    "created_at": "2025-11-17 20:40:41",
    "raw_json": {
      "article_author": null,
      "article_headline": null,
      "article_modified": null,
      "article_published": null,
      "article_section": null,
      "article_tags": null,
      "canonical_url": "https://www.r-bloggers.com/2009/07/influence-me-simple-analysis/",
      "crawled_at": "2025-11-17T10:32:26.306117",
      "external_links": [
        {
          "href": "http://www.rensenieuwenhuis.nl/influence-me-simple-analysis/",
          "text": "Curving Normality » R-Project"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        },
        {
          "href": "http://www.rensenieuwenhuis.nl/r-project/influenceme/",
          "text": "influence.ME website"
        },
        {
          "href": "http://www.rensenieuwenhuis.nl/r-project/influenceme/",
          "text": "that website”"
        },
        {
          "href": "https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg",
          "text": null
        },
        {
          "href": "http://www.rensenieuwenhuis.nl/influence-me-simple-analysis/",
          "text": "Curving Normality » R-Project"
        },
        {
          "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
          "text": "daily e-mail updates"
        },
        {
          "href": "https://www.r-project.org/",
          "text": "R"
        },
        {
          "href": "https://www.r-users.com/",
          "text": "Click here if you're looking to post or find an R/data-science job"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        }
      ],
      "h1_title": "R-bloggers",
      "html_title": "Influence.ME: Simple Analysis | R-bloggers",
      "images": [
        {
          "alt": "Figure Cook's Distance",
          "base64": null,
          "src": "https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg?w=450"
        },
        {
          "alt": "Figure Cook's Distance",
          "base64": null,
          "src": "https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg?w=450"
        }
      ],
      "internal_links": [
        {
          "href": "https://www.r-bloggers.com/author/rense-nieuwenhuis/",
          "text": "Rense Nieuwenhuis"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/contact-us/",
          "text": "here"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers.com"
        },
        {
          "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
          "text": "learning R"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        }
      ],
      "lang": "en-US",
      "main_html": "<article class=\"post-17203 post type-post status-publish format-standard hentry\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">Influence.ME: Simple Analysis</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">July 16, 2009</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/rense-nieuwenhuis/\">Rense Nieuwenhuis</a></span>  in Uncategorized | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<p class=\"syndicated-attribution\"><!-- \r\n<div style=\"min-height: 30px;\">\r\n[social4i size=\"small\" align=\"align-left\"]\r\n</div>\r\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\r\n[This article was first published on  <strong><a href=\"http://www.rensenieuwenhuis.nl/influence-me-simple-analysis/\"> Curving Normality » R-Project</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\r\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\r\n</div></p>\n\n<!-- Share buttons by mashshare.net - Version: 3.8.0--><p>With the introduction of our new package for influential data influence.ME, I’m currently writing a manual for the package. This manual will address topics for both the experienced, and the inexperienced users. </p>\n<p>I will also present much of the content of this manual on my blog. Of course, feel free to comment on it, and readers are encouraged to discuss the content of the manual here. All information will be accessible from the <a href=\"http://www.rensenieuwenhuis.nl/r-project/influenceme/\" rel=\"nofollow\" target=\"_blank\">influence.ME website</a> as well. Note that updates to the manual will be made available on <a href=\"http://www.rensenieuwenhuis.nl/r-project/influenceme/\" rel=\"nofollow\" target=\"_blank\">that website”</a>, instead of updating this blog post. So, please refer to the influence.ME website for the most up-to-date information.</p>\n<p>This is the first section on influence.ME, which deals with a very simply analysis of students nested within 23 schools. Only the effect of a single variable measured at the school level is estimated.</p>\n<p><span id=\"more-1015\"></span></p>\n<h2>A basic example analysis</h2>\n<p>The school23 data contains information on a math test performance of 519 students, who are nested within 23 schools. For this example, we will be interested in the relationship between class structure (in this data measured at the school level) and students’ performance on a math test. The research question is: To what extend does the classroom structure determine the students’ math test outcomes? </p>\n<p>Initially, we will estimate the effect of class structure on the result of the math performance test, without any further covariates. We do take into account the nesting structure of the data, however, and allow the intercept to be random over schools. This model is estimated using the following syntax, and is assigned to an object we call ‘model’.</p>\n<pre>\nmodel &lt;- lmer(math ~  structure + (1 | school.ID), data=school23)\nsummary(model)\n</pre>\n<p>The call for a summary of the model results in the output shown below. In this summary, the original model formula is shown, as well as the data on which this model was estimated. Both random and fixed effects are summarized. The amount of intercept variance associated with the nesting structure of students within schools is considerably large (23.8 compared with 81.2 + 23.8 = 104 in total). The effect of interest is that of the structure variable, which is -2.343 and statistically insignificant by most reasonable standards (t=-1.609).</p>\n<pre>\nLinear mixed model fit by REML \nFormula: math ~ structure + (1 | school.ID) \n   Data: school23 \n  AIC  BIC logLik deviance REMLdev\n 3802 3819  -1897     3798    3794\nRandom effects:\n Groups    Name        Variance Std.Dev.\n school.ID (Intercept) 23.884   4.8871  \n Residual              81.270   9.0150  \nNumber of obs: 519, groups: school.ID, 23\nFixed effects:\n            Estimate Std. Error t value\n(Intercept)   60.002      5.853  10.252\nstructure     -2.343      1.456  -1.609\nCorrelation of Fixed Effects:\n          (Intr)\nstructure -0.982\n</pre>\n<h3>Iteratively re-estimate model</h3>\n<p>Building upon the example model estimated in section 2.1, the first step in the procedure of the influence.ME package is to iteratively exclude the influence of the observations nested within each school separately. This is done using the estex() function. The name estex refers to the ESTimates that are returned while EXcluding the influence of each of the grouping levels separately. Thus, in the case of the math test example, in which students are nested in 23 schools, the estex procedure re-estimates the original model 23 times, excluding the influence of a higher level unit (ie school). The function returns the relevant estimates of these 23 re-estimations, which in Figure [fig:Three-steps] is referred to with 'altered estimates'.</p>\n<p>The estex() function requires the specification of two parameters: a mixed effects model is to be specified, and the grouping factor of which the influence of the nested observations are to be evaluated. In the syntax example below, the original object 'model' is specified, and 'school.ID' is the relevant grouping factor. school.ID is the name of the variable used to indicate the grouping factor when the original model was specified. The estex() function works perfectly when more than a single grouping is present in the model, but only one grouping factor can be addressed at once. </p>\n<p>In the example below, the estimates excluding the influence of the respective grouping levels, as returned by the estex() function, are assigned to an object, which in this case is called este.model (the name of this object, however, is to be chosen arbitrarily by the user). </p>\n<pre>\nestex.model &lt;- estex(model, \"school.ID\")\n</pre>\n<p>Note that in the case of complex mixed models (i.e. models with large numbers of observations, complex nesting structures, and/or many nesting groups) the execution of estex() may consume considerable amounts of time. The examples offered by the school23 data, should offer no such problems, however.</p>\n<h3>Calculate measures of influence</h3>\n<p>The object estex.model containing the altered estimates can be used to calculate several measures of influential data. To determine the Cook's distance, the ME.cook() function is to be used. In its most basic specification, the ME.cook() function only requires an object to which the altered estimates as returned by the estex() function were assigned: </p>\n<pre>\nME.cook(estex.model) \n</pre>\n<p>This basic specification returns a matrix with the rows representing the groups in which the observations are nested, and the single column represents the associated value of Cook's distance. Clearly, these can also be assigned to an object for later modification. The output below shows the result of the syntax above, representing the Cook's distance associated with each school in the school23 data.</p>\n<pre>\n              [,1]\n6053  2.927552e-02\n6327  2.557810e-02\n6467  1.402948e-02\n7194  3.443392e-05\n7472  1.115626e+00\n7474  8.142758e-02\n7801  3.007558e-04\n7829  1.005329e-01\n7930  5.525680e-03\n24371 4.334659e-03\n24725 4.387907e-02\n25456 5.644399e-04\n25642 1.470130e-02\n26537 2.369898e-02\n46417 2.204840e-02\n47583 1.891108e-02\n54344 1.445087e-01\n62821 3.593314e-01\n68448 2.427028e-02\n68493 1.538479e-02\n72080 3.471805e-04\n72292 6.387956e-03\n72991 1.316049e-02\n</pre>\n<p>Based on the output shown above, the Cook's distance of school number 7472 is the largest. This corresponds very well to what was concluded based on Figure [fig:Bivariate-influence-plots]. For those who prefer to evaluate the Cook's distance based on a visual representation, the ME.cook() function can also plot its output. To do so, an additional parameter is required, stating plot=TRUE. Additional parameters are allowed as well, which are passed on to the internal dotplot() function (Deepayan Sarkar, 2008) and are used to format the resulting plot. In this case, the example syntax below also specifies the xlab= and ylab= parameters, labelling the two axes. The resulting plot is shown in the figure below. These kinds of plots can be used to more easily assert the influence a grouped set of observations exert on the outcomes of analyses, relative to the influence excerted by other groups of observations. </p>\n<p>In this case, it (again) is clear that the observation of the level of class structure of school number 7472 excerts the highest influence. This is based on the calculated value for Cook's distance, as well as that this influence clearly exceeds that of other schools. </p>\n<p>ME.cook(estex.model, plot=TRUE,<br/>\n    xlab=\"Cook's Distance, Class structure\",<br/>\n    ylab=\"School\")</p>\n<p><a href=\"https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure Cook's Distance\" class=\"aligncenter size-full wp-image-1042 jetpack-lazy-image\" data-lazy-src=\"https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg?w=450&amp;is-pending-load=1\" data-recalc-dims=\"1\" src=\"https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg?w=450\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" title=\"Figure Cook's Distance\"/><noscript><img alt=\"Figure Cook's Distance\" class=\"aligncenter size-full wp-image-1042\" data-recalc-dims=\"1\" src=\"https://i1.wp.com/www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg?w=450\" title=\"Figure Cook's Distance\"/></noscript></a></p>\n<h3>Exclude influence, and Repeat</h3>\n<p>Based on the analyses and graphs shown in the previous sections, there are strong indications that the observations in school number 7472 excert too much influence on the outcomes of the analysis, and thereby unjustifiably determine the outcomes of these analyses. To definitively decide whether or not the influence of these observations indeed is too large, the value of Cook’s distance of this school can be compared with a cut-off value given. Regarding Cook’s distance, it has been argued that observations exceeding a Cook’s distance of  are too influential Belsley et al. (1980), and need to be dealt with. In this formula, ‘p’ refers to the number of predictors on which Cook’s distance was calculated. In the case of mixed effects models, this refers to the number of groups in which the observations are nested. </p>\n<p>The Cook’s distance of school number 7472 was determined to be 1.31, which readily exceeds the cut-off value of  = .17. Thus, is can be concluded that the influence school number 7472 needs to be excluded form the analysis, before the results of that analyses are interpreted. This is done using the function exclude.influence(). This function basically has three parameters: first, the model from which the influence of some observations is to be excluded needs to be specified, together with the grouping factor and the specific level of that grouping factor in which the said observations are nested. The function modifies the original model and returns a new model, which can be checked again for possible influential data.</p>\n<p>In the example below, the influence of school number 7472 is excluded from the orginal regression model, which was assigned to object ‘model’ in section 2.1. </p>\n<p>The result of the exclude.influence() function again has the form of a mixed effects model and is here assigned to object model.2 (again, this name is to chosen by the user). </p>\n<p>model.2 &lt;- exclude.influence(model, \"school.ID\", \"7472\")<br/>\nsummary(model.2)</p>\n<p>Functions that work with 'normal' mixed effects models estimated with lme4, also work with models that were modified with the exclude.influence() function. So, also a summary of model.2 was requested, which is shown below. A few things are clear from this output. The estimate of the effect of class structure is now much stronger (-4.55) and statistically significant (t=2.95). This corresponds to what may have been expected based on the graphical representation of the data in Figure [fig:Bivariate-influence-plots]. Some other changes have been made to the model as well. The original intercept vector (which originally was indicated by (Intercept)) is now replaced by a variable called intercept.alt. This variable is basically an ordinary intercept vector (thus, with a value of 1 for each observation), except for the observations that are nested in the excluded nesting group. For these observations, the intercept.alt variable has score 0. Also, a new variable called estex.7472 is shown. This variable is a dummy variable, indicating the observations that are nested in school number 7472. One such dummy variable is added to the model for each nesting group the influence of which is excluded. Generally, these modifications of the model ensure that the observations nested within the excluded nesting group do not contribute to the estimation of both the level and the variance of the intercept, and do not alter the higher level estimates unjustifiably. </p>\n<pre>\nLinear mixed model fit by REML \nFormula: math ~ intercept.alt + estex.7472 + structure + \n(0 + intercept.alt | school.ID) - 1 \n   Data: ..2 \n  AIC  BIC logLik deviance REMLdev\n 3792 3814  -1891     3790    3782\nRandom effects:\n Groups    Name          Variance Std.Dev.\n school.ID intercept.alt 17.874   4.2277  \n Residual                81.301   9.0167  \nNumber of obs: 519, groups: school.ID, 23\n\nFixed effects:\n              Estimate Std. Error t value\nintercept.alt   69.346      6.314  10.983\nestex.7472      54.839      3.617  15.163\nstructure       -4.550      1.545  -2.945\n\nCorrelation of Fixed Effects:\n           intrc. e.7472\nestex.7472  0.843       \nstructure  -0.987 -0.854\n</pre>\n<p>As is shown in the procedural schematic in Figure [fig:Three-steps], it is advisable to repeat this procedure to the point that the user is satisfied with the stability of the model, for instance when no group of observations exceeds the cut-off value. To do this in this example, the model.2 object is again input to the estex() function, the results of which are stored in a second altered estimates object which we call estex.model.2:</p>\n<pre>\nestex.model.2 &lt;- estex(model.2, \"school.ID\")\nME.cook(estex.model.2, plot=TRUE, \n    xlab=\"Cook's Distance, Class structure\",\n    ylab=\"School\", \n    cutoff=.18)\n</pre>\n<p>Again, ME.cook() is used to calculate the values for Cook's distance, which returns the output shown below. School number 62821 is associated with the largest value for Cook's distance (.39). The cut-off value now differs (slightly) from the previous one, for the number of (effective) groups in which the observations are nested is decreased by 1, for the influence of school number 7472 was excluded. Thus, the cut-off value now is . Based on the output below, it can thus be concluded that school number 62821 is influential as well. </p>\n<p>Finally, the call for ME.cook() in the syntax example above shows one more distinguishing characteristic. Again plot=TRUE is specified, together with specifications for labels on both the x and y axes. A plot of the Cook's distances is thus created, shown in Figure [fig:Cook-2]. In addition to this, the cut-off value of .18 is now indicated as well using cutoff=.18. As a result of this, all Cook's distances with a value larger than .18 will be indicated differently in the plot, as is the case in Figure [fig:Cook-2] regarding the two schools numbered 62821 and 7474. Note that the Cook's distance for school number 7472 now equals 0, indeed, indicating that this school now no longer influences the parameter estimates. </p>\n<pre>\n              [,1]\n6053  2.186203e-03\n6327  2.645659e-02\n6467  1.326879e-02\n7194  1.319258e-02\n7472  0.000000e+00\n7474  2.273674e-01\n7801  1.378937e-03\n7829  7.780663e-02\n7930  4.728342e-03\n24371 8.621802e-03\n24725 7.072999e-02\n25456 1.985731e-03\n25642 2.487072e-02\n26537 1.900817e-03\n46417 2.409483e-02\n47583 7.919332e-02\n54344 1.248145e-01\n62821 3.706191e-01\n68448 1.752182e-01\n68493 2.607158e-02\n72080 2.669324e-05\n72292 1.193296e-02\n72991 1.311974e-02\n</pre>\n<p>Further analysis of this example would thus entail the exclusion of the influence of observations nested within school number 62821, and then to recheck the model by running through the three steps of the procedure again. This is not shown here, to not make this exercise overly lengthy. </p>\n\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 3.8.0-->\n<p class=\"syndicated-attribution\"><div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"http://www.rensenieuwenhuis.nl/influence-me-simple-analysis/\"> Curving Normality » R-Project</a></strong>.</div>\n<hr>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\r\n\r\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\r\n</hr></div></p> </div>\n</article>",
      "main_text": "Influence.ME: Simple Analysis\nPosted on\nJuly 16, 2009\nby\nRense Nieuwenhuis\nin Uncategorized | 0 Comments\n[This article was first published on\nCurving Normality » R-Project\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nWith the introduction of our new package for influential data influence.ME, I’m currently writing a manual for the package. This manual will address topics for both the experienced, and the inexperienced users.\nI will also present much of the content of this manual on my blog. Of course, feel free to comment on it, and readers are encouraged to discuss the content of the manual here. All information will be accessible from the\ninfluence.ME website\nas well. Note that updates to the manual will be made available on\nthat website”\n, instead of updating this blog post. So, please refer to the influence.ME website for the most up-to-date information.\nThis is the first section on influence.ME, which deals with a very simply analysis of students nested within 23 schools. Only the effect of a single variable measured at the school level is estimated.\nA basic example analysis\nThe school23 data contains information on a math test performance of 519 students, who are nested within 23 schools. For this example, we will be interested in the relationship between class structure (in this data measured at the school level) and students’ performance on a math test. The research question is: To what extend does the classroom structure determine the students’ math test outcomes?\nInitially, we will estimate the effect of class structure on the result of the math performance test, without any further covariates. We do take into account the nesting structure of the data, however, and allow the intercept to be random over schools. This model is estimated using the following syntax, and is assigned to an object we call ‘model’.\nmodel <- lmer(math ~  structure + (1 | school.ID), data=school23)\nsummary(model)\nThe call for a summary of the model results in the output shown below. In this summary, the original model formula is shown, as well as the data on which this model was estimated. Both random and fixed effects are summarized. The amount of intercept variance associated with the nesting structure of students within schools is considerably large (23.8 compared with 81.2 + 23.8 = 104 in total). The effect of interest is that of the structure variable, which is -2.343 and statistically insignificant by most reasonable standards (t=-1.609).\nLinear mixed model fit by REML \nFormula: math ~ structure + (1 | school.ID) \n   Data: school23 \n  AIC  BIC logLik deviance REMLdev\n 3802 3819  -1897     3798    3794\nRandom effects:\n Groups    Name        Variance Std.Dev.\n school.ID (Intercept) 23.884   4.8871  \n Residual              81.270   9.0150  \nNumber of obs: 519, groups: school.ID, 23\nFixed effects:\n            Estimate Std. Error t value\n(Intercept)   60.002      5.853  10.252\nstructure     -2.343      1.456  -1.609\nCorrelation of Fixed Effects:\n          (Intr)\nstructure -0.982\nIteratively re-estimate model\nBuilding upon the example model estimated in section 2.1, the first step in the procedure of the influence.ME package is to iteratively exclude the influence of the observations nested within each school separately. This is done using the estex() function. The name estex refers to the ESTimates that are returned while EXcluding the influence of each of the grouping levels separately. Thus, in the case of the math test example, in which students are nested in 23 schools, the estex procedure re-estimates the original model 23 times, excluding the influence of a higher level unit (ie school). The function returns the relevant estimates of these 23 re-estimations, which in Figure [fig:Three-steps] is referred to with 'altered estimates'.\nThe estex() function requires the specification of two parameters: a mixed effects model is to be specified, and the grouping factor of which the influence of the nested observations are to be evaluated. In the syntax example below, the original object 'model' is specified, and 'school.ID' is the relevant grouping factor. school.ID is the name of the variable used to indicate the grouping factor when the original model was specified. The estex() function works perfectly when more than a single grouping is present in the model, but only one grouping factor can be addressed at once.\nIn the example below, the estimates excluding the influence of the respective grouping levels, as returned by the estex() function, are assigned to an object, which in this case is called este.model (the name of this object, however, is to be chosen arbitrarily by the user).\nestex.model <- estex(model, \"school.ID\")\nNote that in the case of complex mixed models (i.e. models with large numbers of observations, complex nesting structures, and/or many nesting groups) the execution of estex() may consume considerable amounts of time. The examples offered by the school23 data, should offer no such problems, however.\nCalculate measures of influence\nThe object estex.model containing the altered estimates can be used to calculate several measures of influential data. To determine the Cook's distance, the ME.cook() function is to be used. In its most basic specification, the ME.cook() function only requires an object to which the altered estimates as returned by the estex() function were assigned:\nME.cook(estex.model)\nThis basic specification returns a matrix with the rows representing the groups in which the observations are nested, and the single column represents the associated value of Cook's distance. Clearly, these can also be assigned to an object for later modification. The output below shows the result of the syntax above, representing the Cook's distance associated with each school in the school23 data.\n[,1]\n6053  2.927552e-02\n6327  2.557810e-02\n6467  1.402948e-02\n7194  3.443392e-05\n7472  1.115626e+00\n7474  8.142758e-02\n7801  3.007558e-04\n7829  1.005329e-01\n7930  5.525680e-03\n24371 4.334659e-03\n24725 4.387907e-02\n25456 5.644399e-04\n25642 1.470130e-02\n26537 2.369898e-02\n46417 2.204840e-02\n47583 1.891108e-02\n54344 1.445087e-01\n62821 3.593314e-01\n68448 2.427028e-02\n68493 1.538479e-02\n72080 3.471805e-04\n72292 6.387956e-03\n72991 1.316049e-02\nBased on the output shown above, the Cook's distance of school number 7472 is the largest. This corresponds very well to what was concluded based on Figure [fig:Bivariate-influence-plots]. For those who prefer to evaluate the Cook's distance based on a visual representation, the ME.cook() function can also plot its output. To do so, an additional parameter is required, stating plot=TRUE. Additional parameters are allowed as well, which are passed on to the internal dotplot() function (Deepayan Sarkar, 2008) and are used to format the resulting plot. In this case, the example syntax below also specifies the xlab= and ylab= parameters, labelling the two axes. The resulting plot is shown in the figure below. These kinds of plots can be used to more easily assert the influence a grouped set of observations exert on the outcomes of analyses, relative to the influence excerted by other groups of observations.\nIn this case, it (again) is clear that the observation of the level of class structure of school number 7472 excerts the highest influence. This is based on the calculated value for Cook's distance, as well as that this influence clearly exceeds that of other schools.\nME.cook(estex.model, plot=TRUE,\nxlab=\"Cook's Distance, Class structure\",\nylab=\"School\")\nExclude influence, and Repeat\nBased on the analyses and graphs shown in the previous sections, there are strong indications that the observations in school number 7472 excert too much influence on the outcomes of the analysis, and thereby unjustifiably determine the outcomes of these analyses. To definitively decide whether or not the influence of these observations indeed is too large, the value of Cook’s distance of this school can be compared with a cut-off value given. Regarding Cook’s distance, it has been argued that observations exceeding a Cook’s distance of  are too influential Belsley et al. (1980), and need to be dealt with. In this formula, ‘p’ refers to the number of predictors on which Cook’s distance was calculated. In the case of mixed effects models, this refers to the number of groups in which the observations are nested.\nThe Cook’s distance of school number 7472 was determined to be 1.31, which readily exceeds the cut-off value of  = .17. Thus, is can be concluded that the influence school number 7472 needs to be excluded form the analysis, before the results of that analyses are interpreted. This is done using the function exclude.influence(). This function basically has three parameters: first, the model from which the influence of some observations is to be excluded needs to be specified, together with the grouping factor and the specific level of that grouping factor in which the said observations are nested. The function modifies the original model and returns a new model, which can be checked again for possible influential data.\nIn the example below, the influence of school number 7472 is excluded from the orginal regression model, which was assigned to object ‘model’ in section 2.1.\nThe result of the exclude.influence() function again has the form of a mixed effects model and is here assigned to object model.2 (again, this name is to chosen by the user).\nmodel.2 <- exclude.influence(model, \"school.ID\", \"7472\")\nsummary(model.2)\nFunctions that work with 'normal' mixed effects models estimated with lme4, also work with models that were modified with the exclude.influence() function. So, also a summary of model.2 was requested, which is shown below. A few things are clear from this output. The estimate of the effect of class structure is now much stronger (-4.55) and statistically significant (t=2.95). This corresponds to what may have been expected based on the graphical representation of the data in Figure [fig:Bivariate-influence-plots]. Some other changes have been made to the model as well. The original intercept vector (which originally was indicated by (Intercept)) is now replaced by a variable called intercept.alt. This variable is basically an ordinary intercept vector (thus, with a value of 1 for each observation), except for the observations that are nested in the excluded nesting group. For these observations, the intercept.alt variable has score 0. Also, a new variable called estex.7472 is shown. This variable is a dummy variable, indicating the observations that are nested in school number 7472. One such dummy variable is added to the model for each nesting group the influence of which is excluded. Generally, these modifications of the model ensure that the observations nested within the excluded nesting group do not contribute to the estimation of both the level and the variance of the intercept, and do not alter the higher level estimates unjustifiably.\nLinear mixed model fit by REML \nFormula: math ~ intercept.alt + estex.7472 + structure + \n(0 + intercept.alt | school.ID) - 1 \n   Data: ..2 \n  AIC  BIC logLik deviance REMLdev\n 3792 3814  -1891     3790    3782\nRandom effects:\n Groups    Name          Variance Std.Dev.\n school.ID intercept.alt 17.874   4.2277  \n Residual                81.301   9.0167  \nNumber of obs: 519, groups: school.ID, 23\n\nFixed effects:\n              Estimate Std. Error t value\nintercept.alt   69.346      6.314  10.983\nestex.7472      54.839      3.617  15.163\nstructure       -4.550      1.545  -2.945\n\nCorrelation of Fixed Effects:\n           intrc. e.7472\nestex.7472  0.843       \nstructure  -0.987 -0.854\nAs is shown in the procedural schematic in Figure [fig:Three-steps], it is advisable to repeat this procedure to the point that the user is satisfied with the stability of the model, for instance when no group of observations exceeds the cut-off value. To do this in this example, the model.2 object is again input to the estex() function, the results of which are stored in a second altered estimates object which we call estex.model.2:\nestex.model.2 <- estex(model.2, \"school.ID\")\nME.cook(estex.model.2, plot=TRUE, \n    xlab=\"Cook's Distance, Class structure\",\n    ylab=\"School\", \n    cutoff=.18)\nAgain, ME.cook() is used to calculate the values for Cook's distance, which returns the output shown below. School number 62821 is associated with the largest value for Cook's distance (.39). The cut-off value now differs (slightly) from the previous one, for the number of (effective) groups in which the observations are nested is decreased by 1, for the influence of school number 7472 was excluded. Thus, the cut-off value now is . Based on the output below, it can thus be concluded that school number 62821 is influential as well.\nFinally, the call for ME.cook() in the syntax example above shows one more distinguishing characteristic. Again plot=TRUE is specified, together with specifications for labels on both the x and y axes. A plot of the Cook's distances is thus created, shown in Figure [fig:Cook-2]. In addition to this, the cut-off value of .18 is now indicated as well using cutoff=.18. As a result of this, all Cook's distances with a value larger than .18 will be indicated differently in the plot, as is the case in Figure [fig:Cook-2] regarding the two schools numbered 62821 and 7474. Note that the Cook's distance for school number 7472 now equals 0, indeed, indicating that this school now no longer influences the parameter estimates.\n[,1]\n6053  2.186203e-03\n6327  2.645659e-02\n6467  1.326879e-02\n7194  1.319258e-02\n7472  0.000000e+00\n7474  2.273674e-01\n7801  1.378937e-03\n7829  7.780663e-02\n7930  4.728342e-03\n24371 8.621802e-03\n24725 7.072999e-02\n25456 1.985731e-03\n25642 2.487072e-02\n26537 1.900817e-03\n46417 2.409483e-02\n47583 7.919332e-02\n54344 1.248145e-01\n62821 3.706191e-01\n68448 1.752182e-01\n68493 2.607158e-02\n72080 2.669324e-05\n72292 1.193296e-02\n72991 1.311974e-02\nFurther analysis of this example would thus entail the exclusion of the influence of observations nested within school number 62821, and then to recheck the model by running through the three steps of the procedure again. This is not shown here, to not make this exercise overly lengthy.\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nCurving Normality » R-Project\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
      "meta_description": "With the introduction of our new package for influential data influence.ME, I’m currently writing a manual for the package. This manual will address topics for both the experienced, and the inexperienced users. I will also present much of the content ...",
      "meta_keywords": null,
      "og_description": "With the introduction of our new package for influential data influence.ME, I’m currently writing a manual for the package. This manual will address topics for both the experienced, and the inexperienced users. I will also present much of the content ...",
      "og_image": "https://www.rensenieuwenhuis.nl/wp-content/uploads/2009/07/Cook1.jpg",
      "og_title": "Influence.ME: Simple Analysis | R-bloggers",
      "raw_jsonld_article": null,
      "reading_time_min": 12.6,
      "sitemap_lastmod": "2009-07-16T11:00:19+00:00",
      "twitter_description": "With the introduction of our new package for influential data influence.ME, I’m currently writing a manual for the package. This manual will address topics for both the experienced, and the inexperienced users. I will also present much of the content ...",
      "twitter_title": "Influence.ME: Simple Analysis | R-bloggers",
      "url": "https://www.r-bloggers.com/2009/07/influence-me-simple-analysis/",
      "word_count": 2518
    }
  }
}