{
  "uuid": "75e27cd1-c7ec-4d93-ad10-fb0b3b5580df",
  "created_at": "2025-11-17 20:39:29",
  "raw_json": {
    "article_author": null,
    "article_headline": null,
    "article_modified": null,
    "article_published": null,
    "article_section": null,
    "article_tags": null,
    "canonical_url": "https://www.r-bloggers.com/2023/10/taking-dependencies-is-actually-good/",
    "crawled_at": "2025-11-17T10:02:32.256037",
    "external_links": [
      {
        "href": "https://eliocamp.github.io/en/2023/10/dependencies-in-r/",
        "text": "Code R"
      },
      {
        "href": "http://r-posts.com/",
        "text": "here"
      },
      {
        "href": "https://fosstodon.org/@milesmcbain/110732808942232428",
        "text": "As Miles McBain said on mastodon"
      },
      {
        "href": "https://posit.co/resources/videos/make-a-package-make-some-friends/",
        "text": "in her 2021 talk"
      },
      {
        "href": "https://cran.r-project.org/doc/manuals/r-devel/R-ints.html#index-_005fR_005fCHECK_005fEXCESSIVE_005fIMPORTS_005f",
        "text": "issue a “Note”"
      },
      {
        "href": "https://en.wikipedia.org/wiki/Goodhart%27s_law",
        "text": "when a proxy measure becomes a target, it ceases to be a good proxy measure"
      },
      {
        "href": "https://eliocamp.github.io/codigo-r/en/2021/08/docker-renv/",
        "text": "use renv"
      },
      {
        "href": "http://reproducibility.rocks/",
        "text": "Reproducibility with R"
      },
      {
        "href": "https://eliocamp.github.io/en/2023/10/dependencies-in-r/",
        "text": "Code R"
      },
      {
        "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
        "text": "daily e-mail updates"
      },
      {
        "href": "https://www.r-project.org/",
        "text": "R"
      },
      {
        "href": "https://www.r-users.com/",
        "text": "Click here if you're looking to post or find an R/data-science job"
      },
      {
        "href": "http://r-posts.com/",
        "text": "here"
      }
    ],
    "h1_title": "R-bloggers",
    "html_title": "Taking dependencies is actually good | R-bloggers",
    "images": [],
    "internal_links": [
      {
        "href": "https://www.r-bloggers.com/author/code-r/",
        "text": "Code R"
      },
      {
        "href": "https://www.r-bloggers.com/category/r-bloggers/",
        "text": "R bloggers"
      },
      {
        "href": "https://www.r-bloggers.com/",
        "text": "R-bloggers"
      },
      {
        "href": "https://www.r-bloggers.com/contact-us/",
        "text": "here"
      },
      {
        "href": "https://www.r-bloggers.com/add-your-blog/",
        "text": "click here"
      },
      {
        "href": "https://www.r-bloggers.com/",
        "text": "R-bloggers.com"
      },
      {
        "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
        "text": "learning R"
      },
      {
        "href": "https://www.r-bloggers.com/add-your-blog/",
        "text": "click here"
      }
    ],
    "lang": "en-US",
    "main_html": "<article class=\"post-379498 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">Taking dependencies is actually good</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">October 27, 2023</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/code-r/\">Code R</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \r\n<div style=\"min-height: 30px;\">\r\n[social4i size=\"small\" align=\"align-left\"]\r\n</div>\r\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\r\n[This article was first published on  <strong><a href=\"https://eliocamp.github.io/en/2023/10/dependencies-in-r/\"> Code R</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\r\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\r\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 3.8.9-->\n<p>One of the recurring debates in some spaces of the R community is about dependencies.\nAfter a few posts on Mastodon I wanted to capture my opinions on the subject to help me understand them better, and because long-form articles are much better to talk about contentious topics than short-burst posts.</p>\n<div class=\"section level3\" id=\"dependencies-are-invitations-for-other-people-to-collaborate-with-you\">\n<h3>Dependencies are invitations for other people to collaborate with you</h3>\n<p>Many thinkers have marvelled at the magic inside books.\nCarl Sagan put it in his style:</p>\n<blockquote>\n<p>What an astonishing thing a book is.\nIt’s a flat object made from a tree with flexible parts on which are imprinted lots of funny dark squiggles.\nBut one glance at it and you’re inside the mind of another person, maybe somebody dead for thousands of years.\nAcross the millennia, an author is speaking clearly and silently inside your head, directly to you.\nWriting is perhaps the greatest of human inventions, binding together people who never knew each other, citizens of distant epochs.\nBooks break the shackles of time.\nA book is proof that humans are capable of working magic.</p>\n</blockquote>\n<p>And its true.\nWriting is a fantastic technology that allows strangers to learn from each other, to collaborate, to build upon each other’s work.</p>\n<p>Software packages are kind of like books.\nBy typing <code>library(ggplot2)</code> I get to effortlessly use and build upon the thousands of people-hours devoted to developing and polishing a great, solid package.\nWhen I write code that uses ggplot2, in some sense all its developers –awesome people who write great quality code– are now collaborators on my project without them even knowing me.</p>\n<p>And that’s simply awesome.</p>\n<p>Yes, sometimes collaboration is hard, especially when it’s not intended.\nThe next version of ggplot2 might break my code and I will need to update it to fix it.\nBut like a romcom protagonist who needs to learn that opening themselves to being loved is worth the risk of heartbreak, I think the occasional breaking change is a small price to pay for getting to collaborate with the community.</p>\n</div>\n<div class=\"section level3\" id=\"dependencies-make-better-programmers\">\n<h3>Dependencies make better programmers</h3>\n<p><a href=\"https://fosstodon.org/@milesmcbain/110732808942232428\" rel=\"nofollow\" target=\"_blank\">As Miles McBain said on mastodon</a>, taking dependencies exposes you to other people’s code, different ideas and different design patterns.</p>\n<p>Just <em>using</em> other people’s code will introduce to the various naming conventions, argument types and return classes.\nIf you take a step further and read the internals, you get to know a lot of writing styles, levels of function abstraction, etc.</p>\n<p>This also works from the package maintainer’s perspective.\nAthanasia Mowinckel describes <a href=\"https://posit.co/resources/videos/make-a-package-make-some-friends/\" rel=\"nofollow\" target=\"_blank\">in her 2021 talk</a> how developing and publishing a package made her aware of many programming good practices thanks to people that opened issues and Pull Requests.\nAnd it’s true; how can a developer improve their package is nobody uses and depends on it?</p>\n</div>\n<div class=\"section level3\" id=\"a-dependency-rich-project-is-better-than-no-project\">\n<h3>A dependency-rich project is better than no project</h3>\n<p>Even if I were to grant that a project with many dependencies is bad, still a brittle project is better than no project.\nAll kinds of people do amazing things and not every project needs (or can) be a “10X project” that follows all the best practices.</p>\n<p>R users come from very different backgrounds and have vastly different levels of expertise in software development.\nA lot of us are scientists who want to do their research and collaborate with the community.\nWe probably wouldn’t be able to do our work or publish our first packages without depending on code written by others.</p>\n<p>And I’d rather see a thousand imperfect and dependency-heavy projects bloom than to have just a few monolithic packages.</p>\n<p>Good enough is infinitely better than nothing.</p>\n</div>\n<div class=\"section level3\" id=\"dependency-counts-are-barely-a-proxy-for-whats-important\">\n<h3>Dependency counts are barely a proxy for what’s important</h3>\n<p>The tidyverse package has dozens of dependencies, but each package is relatively focused on a small set of functionalities.\nBut the tidyverse team could easily decide to merge all the code in all the different packages into one single monolithic package.\nThen the whole tidyverse could theoretically claim to be “dependency free” but it would consist on (roughly) the same code, written by the same developers, and with the same probability of breakage.</p>\n<p>Conversely, the data.table package has no dependencies, but its codebase is massive.\nIt’s got functions for data manipulation (~dplyr), data reshaping (~tidyr), reading and writing to files (~readr), some date manipulation (~lubridate), rolling functions and even functions to format columns (~pillar).\nAll that functionality could conceivably be broken up into several other packages and then the data.table package might have half a dozen or so dependencies but, again, would consist on (roughly) the same code, written by the same developers, and with the same probability of breakage.</p>\n<p>Moreover, code depending on a single package that is experimental or in active development might break a lot, whereas code depending on multiple stable and slowly-updating packages might work for ages.</p>\n<p>So counting dependencies doesn’t really give you a good sense of dependency complexity or the probability of breakage.\nAt best it’s a rough and indirect proxy that, in my opinion, doesn’t warrant being obsessed with.</p>\n</div>\n<div class=\"section level3\" id=\"dependency-counts-fall-victim-of-goodharts-law\">\n<h3>Dependency counts fall victim of Goodhart’s Law</h3>\n<p>At some point CRAN put a soft limit on the number of packages a package could list in “Imports”.\nThose are packages that are needed to be installed for the package to function; what we would colloquially call dependencies.\nUse more than 20 packages and CRAN will shout at you (<a href=\"https://cran.r-project.org/doc/manuals/r-devel/R-ints.html#index-_005fR_005fCHECK_005fEXCESSIVE_005fIMPORTS_005f\" rel=\"nofollow\" target=\"_blank\">issue a “Note”</a>) and make your life a bit harder.</p>\n<p>So let me tell you about the SCpubr package.\nThis is an R package that “aims to provide a streamlined way of generating publication ready plots for known Single-Cell visualizations”.\nBy the looks of it, it’s a rather complex package that wraps a lot of functionality from other packages.\nHowever, it hasn’t got a single dependency listed under Imports.\nIndeed, all its 61 dependencies are listed under “Suggest”, the field reserved for packages that “are not necessarily needed” and are instead “used only in examples, tests or vignettes”.\nHowever, almost every single function in the SCpubr package uses some of those suggested packages.</p>\n<p>There might be perfectly reasonable reasons for this package to list all its many dependencies as Suggests, but this example shows you how a package can have a massive amount of dependencies and still come clear at the dependency counting.</p>\n<p>There are other options.\nBecause CRAN counts the number of direct dependencies, one could easily create two dummy packages that depend on 15 other packages, and then have the main package depend on those.\nNow the package appears to have only 2 dependencies but in reality it depends on more than 30 packages.</p>\n<p>So imposing a limit on the number of dependencies can change how developers list their dependencies in order to avoid that limit and thus the number of dependencies turns into an even worse indicator of dependency complexity.\nThis is a clear example of how <a href=\"https://en.wikipedia.org/wiki/Goodhart%27s_law\" rel=\"nofollow\" target=\"_blank\">when a proxy measure becomes a target, it ceases to be a good proxy measure</a>.</p>\n</div>\n<div class=\"section level2\" id=\"conclusions\">\n<h2>Conclusions</h2>\n<p>So, taking dependencies is a great way of averaging the power of the community and getting to collaborate with great developers.\nIt makes you and the maintainer of those packages into better developers.\nIt empowers people to create tools and write code they couldn’t otherwise create.\nAnd even if you want to increase the stability and reproducibility of code, just counting the number of dependencies is not a very meaningful exercise.</p>\n<p>When writing a package, do be mindful of the dependencies you take.\nI do agree that it’s not good practice to depend on a gigantic package just to use a single function that can be easily replicated using base R.</p>\n<p>Remember that when taking a dependency you are essentially forcing all your users to install another package, so I think it’s polite to do so only if necessary, particularly for packages with compiled code and/or system dependencies which can fail to install.\nThis is less important for very popular packages that most R users probably already have or for packages that are dependencies of your dependencies (i.e. if your package imports ggplot2, then there’s no point in avoiding taking a dependency on tibble, which is imported by ggplot2 itself).</p>\n<p>Much more important than the number of dependencies, consider who are developing the packages you depend on.\nAre they trusted developers that write good software or someone who might write even worse code than you?\nCan they be trusted to continue development and not orphan the package?</p>\n<p>When writing code for you, go nuts, do whatever you want.\nIt’s your project and your machine, so install whatever package you want and be happy.\nYou still have to be mindful of installing external code, especially from random GitHub repositories.\nAnd if you want your code to be reproducible on the long term, <a href=\"https://eliocamp.github.io/codigo-r/en/2021/08/docker-renv/\" rel=\"nofollow\" target=\"_blank\">use renv</a> to pin the package versions for each project (you can check other strategies on our online course <a href=\"http://reproducibility.rocks/\" rel=\"nofollow\" target=\"_blank\">Reproducibility with R</a>).</p>\n<p>At the end of the day, take the dependencies you need to get the job done and create useful and fun projects with clean code that <strong>you</strong> can understand, extend, debug and maintain easily.\nDon’t obsess over the number of dependencies in your or anyone else’s package.</p>\n</div>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 3.8.9-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://eliocamp.github.io/en/2023/10/dependencies-in-r/\"> Code R</a></strong>.</div>\n<hr>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\r\n\r\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\r\n</hr></div> </div>\n</article>",
    "main_text": "Taking dependencies is actually good\nPosted on\nOctober 27, 2023\nby\nCode R\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nCode R\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nOne of the recurring debates in some spaces of the R community is about dependencies.\nAfter a few posts on Mastodon I wanted to capture my opinions on the subject to help me understand them better, and because long-form articles are much better to talk about contentious topics than short-burst posts.\nDependencies are invitations for other people to collaborate with you\nMany thinkers have marvelled at the magic inside books.\nCarl Sagan put it in his style:\nWhat an astonishing thing a book is.\nIt’s a flat object made from a tree with flexible parts on which are imprinted lots of funny dark squiggles.\nBut one glance at it and you’re inside the mind of another person, maybe somebody dead for thousands of years.\nAcross the millennia, an author is speaking clearly and silently inside your head, directly to you.\nWriting is perhaps the greatest of human inventions, binding together people who never knew each other, citizens of distant epochs.\nBooks break the shackles of time.\nA book is proof that humans are capable of working magic.\nAnd its true.\nWriting is a fantastic technology that allows strangers to learn from each other, to collaborate, to build upon each other’s work.\nSoftware packages are kind of like books.\nBy typing\nlibrary(ggplot2)\nI get to effortlessly use and build upon the thousands of people-hours devoted to developing and polishing a great, solid package.\nWhen I write code that uses ggplot2, in some sense all its developers –awesome people who write great quality code– are now collaborators on my project without them even knowing me.\nAnd that’s simply awesome.\nYes, sometimes collaboration is hard, especially when it’s not intended.\nThe next version of ggplot2 might break my code and I will need to update it to fix it.\nBut like a romcom protagonist who needs to learn that opening themselves to being loved is worth the risk of heartbreak, I think the occasional breaking change is a small price to pay for getting to collaborate with the community.\nDependencies make better programmers\nAs Miles McBain said on mastodon\n, taking dependencies exposes you to other people’s code, different ideas and different design patterns.\nJust\nusing\nother people’s code will introduce to the various naming conventions, argument types and return classes.\nIf you take a step further and read the internals, you get to know a lot of writing styles, levels of function abstraction, etc.\nThis also works from the package maintainer’s perspective.\nAthanasia Mowinckel describes\nin her 2021 talk\nhow developing and publishing a package made her aware of many programming good practices thanks to people that opened issues and Pull Requests.\nAnd it’s true; how can a developer improve their package is nobody uses and depends on it?\nA dependency-rich project is better than no project\nEven if I were to grant that a project with many dependencies is bad, still a brittle project is better than no project.\nAll kinds of people do amazing things and not every project needs (or can) be a “10X project” that follows all the best practices.\nR users come from very different backgrounds and have vastly different levels of expertise in software development.\nA lot of us are scientists who want to do their research and collaborate with the community.\nWe probably wouldn’t be able to do our work or publish our first packages without depending on code written by others.\nAnd I’d rather see a thousand imperfect and dependency-heavy projects bloom than to have just a few monolithic packages.\nGood enough is infinitely better than nothing.\nDependency counts are barely a proxy for what’s important\nThe tidyverse package has dozens of dependencies, but each package is relatively focused on a small set of functionalities.\nBut the tidyverse team could easily decide to merge all the code in all the different packages into one single monolithic package.\nThen the whole tidyverse could theoretically claim to be “dependency free” but it would consist on (roughly) the same code, written by the same developers, and with the same probability of breakage.\nConversely, the data.table package has no dependencies, but its codebase is massive.\nIt’s got functions for data manipulation (~dplyr), data reshaping (~tidyr), reading and writing to files (~readr), some date manipulation (~lubridate), rolling functions and even functions to format columns (~pillar).\nAll that functionality could conceivably be broken up into several other packages and then the data.table package might have half a dozen or so dependencies but, again, would consist on (roughly) the same code, written by the same developers, and with the same probability of breakage.\nMoreover, code depending on a single package that is experimental or in active development might break a lot, whereas code depending on multiple stable and slowly-updating packages might work for ages.\nSo counting dependencies doesn’t really give you a good sense of dependency complexity or the probability of breakage.\nAt best it’s a rough and indirect proxy that, in my opinion, doesn’t warrant being obsessed with.\nDependency counts fall victim of Goodhart’s Law\nAt some point CRAN put a soft limit on the number of packages a package could list in “Imports”.\nThose are packages that are needed to be installed for the package to function; what we would colloquially call dependencies.\nUse more than 20 packages and CRAN will shout at you (\nissue a “Note”\n) and make your life a bit harder.\nSo let me tell you about the SCpubr package.\nThis is an R package that “aims to provide a streamlined way of generating publication ready plots for known Single-Cell visualizations”.\nBy the looks of it, it’s a rather complex package that wraps a lot of functionality from other packages.\nHowever, it hasn’t got a single dependency listed under Imports.\nIndeed, all its 61 dependencies are listed under “Suggest”, the field reserved for packages that “are not necessarily needed” and are instead “used only in examples, tests or vignettes”.\nHowever, almost every single function in the SCpubr package uses some of those suggested packages.\nThere might be perfectly reasonable reasons for this package to list all its many dependencies as Suggests, but this example shows you how a package can have a massive amount of dependencies and still come clear at the dependency counting.\nThere are other options.\nBecause CRAN counts the number of direct dependencies, one could easily create two dummy packages that depend on 15 other packages, and then have the main package depend on those.\nNow the package appears to have only 2 dependencies but in reality it depends on more than 30 packages.\nSo imposing a limit on the number of dependencies can change how developers list their dependencies in order to avoid that limit and thus the number of dependencies turns into an even worse indicator of dependency complexity.\nThis is a clear example of how\nwhen a proxy measure becomes a target, it ceases to be a good proxy measure\n.\nConclusions\nSo, taking dependencies is a great way of averaging the power of the community and getting to collaborate with great developers.\nIt makes you and the maintainer of those packages into better developers.\nIt empowers people to create tools and write code they couldn’t otherwise create.\nAnd even if you want to increase the stability and reproducibility of code, just counting the number of dependencies is not a very meaningful exercise.\nWhen writing a package, do be mindful of the dependencies you take.\nI do agree that it’s not good practice to depend on a gigantic package just to use a single function that can be easily replicated using base R.\nRemember that when taking a dependency you are essentially forcing all your users to install another package, so I think it’s polite to do so only if necessary, particularly for packages with compiled code and/or system dependencies which can fail to install.\nThis is less important for very popular packages that most R users probably already have or for packages that are dependencies of your dependencies (i.e. if your package imports ggplot2, then there’s no point in avoiding taking a dependency on tibble, which is imported by ggplot2 itself).\nMuch more important than the number of dependencies, consider who are developing the packages you depend on.\nAre they trusted developers that write good software or someone who might write even worse code than you?\nCan they be trusted to continue development and not orphan the package?\nWhen writing code for you, go nuts, do whatever you want.\nIt’s your project and your machine, so install whatever package you want and be happy.\nYou still have to be mindful of installing external code, especially from random GitHub repositories.\nAnd if you want your code to be reproducible on the long term,\nuse renv\nto pin the package versions for each project (you can check other strategies on our online course\nReproducibility with R\n).\nAt the end of the day, take the dependencies you need to get the job done and create useful and fun projects with clean code that\nyou\ncan understand, extend, debug and maintain easily.\nDon’t obsess over the number of dependencies in your or anyone else’s package.\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nCode R\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
    "meta_description": "One of the recurring debates in some spaces of the R community is about dependencies. After a few posts on Mastodon I wanted to capture my opinions on the subject to help me understand them better, and because long-form articles are much better to t...",
    "meta_keywords": null,
    "og_description": "One of the recurring debates in some spaces of the R community is about dependencies. After a few posts on Mastodon I wanted to capture my opinions on the subject to help me understand them better, and because long-form articles are much better to t...",
    "og_image": "https://www.r-bloggers.com/wp-content/uploads/2016/04/R_02_2016-05-01.png",
    "og_title": "Taking dependencies is actually good | R-bloggers",
    "raw_jsonld_article": null,
    "reading_time_min": 8.5,
    "sitemap_lastmod": "2023-10-28T00:00:00+00:00",
    "twitter_description": "One of the recurring debates in some spaces of the R community is about dependencies. After a few posts on Mastodon I wanted to capture my opinions on the subject to help me understand them better, and because long-form articles are much better to t...",
    "twitter_title": "Taking dependencies is actually good | R-bloggers",
    "url": "https://www.r-bloggers.com/2023/10/taking-dependencies-is-actually-good/",
    "word_count": 1697
  }
}