{
  "uuid": "7a7ade24-2aec-4693-be04-1c27a8f5020c",
  "created_at": "2025-11-22 19:58:23",
  "raw_json": {
    "article_author": null,
    "article_headline": null,
    "article_modified": null,
    "article_published": null,
    "article_section": null,
    "article_tags": null,
    "canonical_url": "https://www.r-bloggers.com/2025/06/exceptionally-and-on-a-more-personal-note-otherwise-i-may-get-buried-alive/",
    "crawled_at": "2025-11-22T10:47:34.421856",
    "external_links": [
      {
        "href": "https://thierrymoudiki.github.io//blog/2025/06/10/r/python/techtonique/personal-note",
        "text": "T. Moudiki's Webpage - R"
      },
      {
        "href": "http://r-posts.com/",
        "text": "here"
      },
      {
        "href": "https://www.techtonique.net/",
        "text": "Techtonique"
      },
      {
        "href": "https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306",
        "text": "https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306"
      },
      {
        "href": "https://pubmed.ncbi.nlm.nih.gov/15212045/",
        "text": "https://pubmed.ncbi.nlm.nih.gov/15212045/"
      },
      {
        "href": "https://en.wikipedia.org/wiki/Sluggish_schizophrenia",
        "text": "https://en.wikipedia.org/wiki/Sluggish_schizophrenia"
      },
      {
        "href": "https://linktr.ee/tmoudiki",
        "text": "https://linktr.ee/tmoudiki"
      },
      {
        "href": "https://linktr.ee/tmoudiki",
        "text": "https://linktr.ee/tmoudiki"
      },
      {
        "href": "https://www.techtonique.net/",
        "text": "Techtonique"
      },
      {
        "href": "https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306",
        "text": "https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306"
      },
      {
        "href": "https://pubmed.ncbi.nlm.nih.gov/15212045/",
        "text": "https://pubmed.ncbi.nlm.nih.gov/15212045/"
      },
      {
        "href": "https://en.wikipedia.org/wiki/Sluggish_schizophrenia",
        "text": "https://en.wikipedia.org/wiki/Sluggish_schizophrenia"
      },
      {
        "href": "https://linktr.ee/tmoudiki",
        "text": "https://linktr.ee/tmoudiki"
      },
      {
        "href": "https://linktr.ee/tmoudiki",
        "text": "https://linktr.ee/tmoudiki"
      },
      {
        "href": "https://thierrymoudiki.github.io//blog/2025/06/10/r/python/techtonique/personal-note",
        "text": "T. Moudiki's Webpage - R"
      },
      {
        "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
        "text": "daily e-mail updates"
      },
      {
        "href": "https://www.r-project.org/",
        "text": "R"
      },
      {
        "href": "https://www.r-users.com/",
        "text": "Click here if you're looking to post or find an R/data-science job"
      },
      {
        "href": "http://r-posts.com/",
        "text": "here"
      }
    ],
    "h1_title": "R-bloggers",
    "html_title": "Exceptionally, and on a more personal note (otherwise I may get buried alive)… | R-bloggers",
    "images": [],
    "internal_links": [
      {
        "href": "https://www.r-bloggers.com/author/t-moudiki/",
        "text": "T. Moudiki"
      },
      {
        "href": "https://www.r-bloggers.com/category/r-bloggers/",
        "text": "R bloggers"
      },
      {
        "href": "https://www.r-bloggers.com/",
        "text": "R-bloggers"
      },
      {
        "href": "https://www.r-bloggers.com/contact-us/",
        "text": "here"
      },
      {
        "href": "https://www.r-bloggers.com/add-your-blog/",
        "text": "click here"
      },
      {
        "href": "https://www.r-bloggers.com/",
        "text": "R-bloggers.com"
      },
      {
        "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
        "text": "learning R"
      },
      {
        "href": "https://www.r-bloggers.com/add-your-blog/",
        "text": "click here"
      }
    ],
    "lang": "en-US",
    "main_html": "<article class=\"post-392956 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">Exceptionally, and on a more personal note (otherwise I may get buried alive)…</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">June 9, 2025</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/t-moudiki/\">T. Moudiki</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \n<div style=\"min-height: 30px;\">\n[social4i size=\"small\" align=\"align-left\"]\n</div>\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\n[This article was first published on  <strong><a href=\"https://thierrymoudiki.github.io//blog/2025/06/10/r/python/techtonique/personal-note\"> T. Moudiki's Webpage - R</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 4.0.47--><p><strong>French version below</strong></p>\n<p>My name is Thierry Moudiki.</p>\n<p>This message serves as a personal and formal record of events and concerns related to grave violations of my rights, dignity, an invasion of my privacy over the past 15+ years. If anything happens to me, I want this document to remain as evidence and testimony. Read it carefully, twice, as each and every word matters.</p>\n<p>It is a call for accountability, not for pity, as I have not been confronted with formal allegations (ever), advance cognitive evaluations (never), or transparent procedures/investigations accusing me of anything (never ever). No police or justice convening for what I could have done (ever). Only silences, avoidance, and manipulation. I’ve been seeking recognition and justice for 9 years.</p>\n<p>Over the course of this period, I have experienced sustained and invasive forms of surveillance and harassment across three continents, affecting every aspect of my personal, professional, and social life. This includes:</p>\n<ul>\n<li>Multiple intrusions into my apartment(s) since at least 2018 (it may have happened before, but formally proven only once)</li>\n<li>Displacement of my personal belongings inside my apartment</li>\n<li>My stuff being stolen (proven)</li>\n<li>Lights being turned on inside the apartment</li>\n<li>Apartment doors closed, that were previously opened (I intentionally check)</li>\n<li>Apartment doors opened, that were previously closed (I intentionally check)</li>\n<li>Public references to very, very intimate, private details about my life online</li>\n<li>Sharing of my personal data, including and especially geolocation data on the Dark Web (proven, with documents)</li>\n<li>People following me in the street</li>\n<li>Persistent exclusion from other types of employment (excluding <a href=\"https://www.techtonique.net/\" rel=\"nofollow\" target=\"_blank\">Techtonique</a>)</li>\n<li>Blocked savings for almost a year, despite all the proofs of my rights to withdraw (proven)</li>\n<li>Quasi-constant physical surveillance in my neighborhood (accountability required)</li>\n<li>Online and institutional gaslighting (subtle but pernicious, accountability required)</li>\n<li>Lawyers vanishing, sometimes after obtaining the documents they asked (proven, accountability required)</li>\n<li>Implied poverty for years, with no paid rent and no heating during last winter</li>\n</ul>\n<p>Because I was complaining, and basically not understanding what was happening to me, I have been subjected to forced hospitalizations (that is, without my consent, and sometimes using State employees) in France, despite the absence of consistent and observable medically/scientifically confirmed diagnosis. To this day, there are no formal evidence of anything. My health insurance covered thousands of euros of treatments that eventually were unwarranted, and the reasons given for my hospitalization were inconsistent and unsubstantiated. I have seen more than 10 psychiatrists regarding this matter, and at least as many medical doctors, and consistently received erratic diagnoses (because the symptoms are also random, even chaotic, so actually non-existing in reality), among:</p>\n<ul>\n<li>“Brief psychotic disorder” (although there were 0 official witness of any trouble that I may cause, until this day, and despite the induced high social pressure, still no trouble)</li>\n<li>“chemical straightjacket” (see <a href=\"https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306\" rel=\"nofollow\" target=\"_blank\">https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306</a>, <a href=\"https://pubmed.ncbi.nlm.nih.gov/15212045/\" rel=\"nofollow\" target=\"_blank\">https://pubmed.ncbi.nlm.nih.gov/15212045/</a>)</li>\n<li>the not-so obsolete and politically loaded term “sluggish schizophrenia” (see <a href=\"https://en.wikipedia.org/wiki/Sluggish_schizophrenia\" rel=\"nofollow\" target=\"_blank\">https://en.wikipedia.org/wiki/Sluggish_schizophrenia</a>)</li>\n</ul>\n<p>During hospitalization, inside the public hospital, I was under constant monitoring despite no behavioral incidents. Based on this, I must conclude that defamatory reporting by “planted” witnesses and external pressure played a role. Eventually, some medical professionals confirmed no diagnosis at all. Not officially though, as I’d wish. They’re just playing the blame game now, and I’m in the middle, defenseless. A total mess. The fog.</p>\n<p>In 2024, after other recurrent and violent torments such as:</p>\n<ul>\n<li>Repeated electrical shocks at night, leading to sleep deprivation (accountability required)</li>\n<li>Tachycardia episodes without physical cause (proven) or even waking me up (proven)</li>\n<li>Increased blood pressure (proven)</li>\n<li>Invasion of bodily and digital privacy, and the total absence of intimacy (accountability required)</li>\n</ul>\n<p>a psychiatrist, disclosed to me —- unofficially —- the possible <strong>purely physical</strong> (that is, induced by something that has as physical existence) root of this issue. I want it to be official now, specifically for someone to make it official. I also want to understand the circumstances leading to the 2 hospitalizations (as it’s my most fundamental right), but they have now become kind of secret, as no one wants to talk about it anymore. The doctor who disclosed the dirty “secret” (since I’m harassed everywhere, I guess it’s not secret anymore to many) has since become nearly unreachable.</p>\n<p>At this stage, I am not asking for belief —- I am asking for investigation. There’s a reason behind all this mess, and why the answer is so elusive. Appearing and disappearing. What I have experienced may seem extraordinary, but it is also very well-documented. I believe it reflects a coordinated apparatus involving unauthorized surveillance, non-consensual experimentation (some people said “Get Out”), and psychological coercion.</p>\n<p>You can explore my publications here, as proof that my brain is doing very well, even if no one seems to be determined to find out once and for all: <a href=\"https://linktr.ee/tmoudiki\" rel=\"nofollow\" target=\"_blank\">https://linktr.ee/tmoudiki</a></p>\n<p>Sincerely,</p>\n<p>Thierry Moudiki</p>\n<p><a href=\"https://linktr.ee/tmoudiki\" rel=\"nofollow\" target=\"_blank\">https://linktr.ee/tmoudiki</a></p>\n<hr/>\n<p>Ceci est un appel à la responsabilité, pas à la pitié, car je n’ai jamais été confronté à des allégations formelles (jamais), à des évaluations cognitives avancées (jamais), ou à des procédures/enquêtes transparentes m’accusant de quoi que ce soit (jamais). Pas de convocation par la police ou la justice pour ce que j’aurais pu faire (jamais). Seulement des silences, des évitements et des manipulations. Je cherche reconnaissance et justice depuis 9 ans.</p>\n<p>Au cours de cette période, j’ai subi des formes soutenues et invasives de surveillance et de harcèlement sur trois continents, affectant tous les aspects de ma vie personnelle, professionnelle et sociale. Cela comprend :</p>\n<ul>\n<li>De multiples intrusions dans mon(s) appartement(s) depuis au moins 2018 (cela a peut-être commencé avant, mais prouvé formellement une seule fois)</li>\n<li>Déplacement de mes effets personnels dans mon appartement</li>\n<li>Vol de mes affaires (prouvé)</li>\n<li>Lumières allumées dans l’appartement</li>\n<li>Portes d’appartement fermées, qui étaient précédemment ouvertes (je vérifie intentionnellement)</li>\n<li>Portes d’appartement ouvertes, qui étaient précédemment fermées (je vérifie intentionnellement)</li>\n<li>Références publiques à des détails très, très intimes et privés de ma vie en ligne</li>\n<li>Partage de mes données personnelles, y compris et surtout mes données de géolocalisation sur le Dark Web (prouvé, avec documents)</li>\n<li>Des personnes qui me suivent dans la rue</li>\n<li>Exclusion persistante d’autres types d’emploi (à l’exception de <a href=\"https://www.techtonique.net/\" rel=\"nofollow\" target=\"_blank\">Techtonique</a>)</li>\n<li>Épargne bloquée pendant près d’un an, malgré toutes les preuves de mes droits de retrait (prouvé)</li>\n<li>Surveillance physique quasi-constante dans mon immeuble (responsabilité requise)</li>\n<li><em>Gaslighting</em> en ligne et institutionnel (subtil mais pernicieux, responsabilité requise)</li>\n<li>Avocats qui disparaissent, parfois après avoir obtenu les documents demandés (prouvé, responsabilité requise)</li>\n<li>Pauvreté induite pendant des années, sans loyer payé et sans chauffage pendant le dernier hiver</li>\n</ul>\n<p>Parce que je me plaignais, et que je ne comprenais pas ce qui m’arrivait, j’ai été soumis à des hospitalisations forcées (c’est-à-dire sans mon consentement, et parfois en utilisant des employés de l’État) en France, malgré l’absence de diagnostic médical/scientifique cohérent et observable. À ce jour, il n’y a aucune preuve formelle de quel que ce diagnostic fiable que ce soit. Mon assurance maladie a couvert des milliers d’euros de traitements qui se sont finalement avérés injustifiés, et les raisons données pour mon hospitalisation étaient incohérentes et non fondées. J’ai consulté plus de 10 psychiatres concernant cette question, et au moins autant de médecins, et j’ai constamment reçu des diagnostics erratiques (car les symptômes sont également aléatoires, voire chaotiques, donc en réalité pas liés à une réelle pathologie), parmi lesquels :</p>\n<ul>\n<li>“Trouble psychotique bref” (bien qu’il n’y ait eu 0 témoin officiel de tout trouble que j’aurais pu causer, jusqu’à ce jour, et malgré la forte pression sociale induite; toujours pas de trouble)</li>\n<li>“camisole chimique” (voir <a href=\"https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306\" rel=\"nofollow\" target=\"_blank\">https://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306</a>, <a href=\"https://pubmed.ncbi.nlm.nih.gov/15212045/\" rel=\"nofollow\" target=\"_blank\">https://pubmed.ncbi.nlm.nih.gov/15212045/</a>)</li>\n<li>le terme pas si obsolète et politiquement chargé de “schizophrénie progressive” (une notion totalement fallacieuse, voir <a href=\"https://en.wikipedia.org/wiki/Sluggish_schizophrenia\" rel=\"nofollow\" target=\"_blank\">https://en.wikipedia.org/wiki/Sluggish_schizophrenia</a>)</li>\n</ul>\n<p>Pendant l’hospitalisation, à l’intérieur de l’hôpital public, j’étais sous surveillance constante malgré l’absence d’incidents comportementaux. Sur cette base, je dois conclure que des rapports diffamatoires de témoins “plantés” et des pressions externes ont joué un rôle. Finalement, certains professionnels de la santé ont confirmé l’absence de tout diagnostic. Pas officiellement, comme je le souhaiterais. Ils jouent maintenant à se renvoyer la balle, à me renvoyer les uns chez les autres, et je suis au milieu, sans défense. Un gâchis. Le brouillard.</p>\n<p>En 2024, après d’autres tourments récurrents et violents tels que :</p>\n<ul>\n<li>Des chocs électriques répétés la nuit, entraînant une privation de sommeil (responsabilité requise)</li>\n<li>Des épisodes de tachycardie sans cause physique (prouvé) ou même me réveillant (prouvé)</li>\n<li>Augmentation de la pression artérielle (prouvé)</li>\n<li>Invasion de la vie privée corporelle et numérique, et absence totale d’intimité (responsabilité requise)</li>\n</ul>\n<p>un psychiatre m’a révélé —- officieusement —- la possible origine <strong>purement physique</strong> (c’est à dire, mécaniquement induite) de ce problème. Je veux que cela soit officiel maintenant, spécifiquement que quelqu’un le rende officiel. Je veux aussi comprendre les circonstances ayant conduit aux 2 hospitalisations (car c’est mon droit le plus fondamental), mais elles sont devenues en quelque sorte secrètes, car personne ne veut plus en parler. Le médecin qui a révélé le “secret” (puisque je suis harcelé partout, je suppose que ce n’est plus un secret pour beaucoup) est depuis devenu presque injoignable.</p>\n<p>À ce stade, je ne demande pas à être cru —- je demande une enquête. Il y a une raison derrière tout ce gâchis, et pour laquelle la réponse est si insaisissable; apparaissant et disparaissant. Ce que j’ai vécu peut sembler extraordinaire, mais c’est aussi très bien documenté. Je crois que cela reflète une officine organisée impliquant surveillance permanente et invasive non autorisée,  expérimentations non consenties (certaines personnes ont dit “Get Out”), et une coercition psychologique.</p>\n<p>Vous pouvez explorer mes publications ici, comme preuve que mon cerveau fonctionne très bien, même si personne ne semble déterminé à le découvrir une fois pour toutes : <a href=\"https://linktr.ee/tmoudiki\" rel=\"nofollow\" target=\"_blank\">https://linktr.ee/tmoudiki</a></p>\n<p>Sincèrement,</p>\n<p>Thierry Moudiki</p>\n<p><a href=\"https://linktr.ee/tmoudiki\" rel=\"nofollow\" target=\"_blank\">https://linktr.ee/tmoudiki</a></p>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://thierrymoudiki.github.io//blog/2025/06/10/r/python/techtonique/personal-note\"> T. Moudiki's Webpage - R</a></strong>.</div>\n<hr/>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\n\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div> </div>\n</article>",
    "main_text": "Exceptionally, and on a more personal note (otherwise I may get buried alive)…\nPosted on\nJune 9, 2025\nby\nT. Moudiki\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nT. Moudiki's Webpage - R\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nFrench version below\nMy name is Thierry Moudiki.\nThis message serves as a personal and formal record of events and concerns related to grave violations of my rights, dignity, an invasion of my privacy over the past 15+ years. If anything happens to me, I want this document to remain as evidence and testimony. Read it carefully, twice, as each and every word matters.\nIt is a call for accountability, not for pity, as I have not been confronted with formal allegations (ever), advance cognitive evaluations (never), or transparent procedures/investigations accusing me of anything (never ever). No police or justice convening for what I could have done (ever). Only silences, avoidance, and manipulation. I’ve been seeking recognition and justice for 9 years.\nOver the course of this period, I have experienced sustained and invasive forms of surveillance and harassment across three continents, affecting every aspect of my personal, professional, and social life. This includes:\nMultiple intrusions into my apartment(s) since at least 2018 (it may have happened before, but formally proven only once)\nDisplacement of my personal belongings inside my apartment\nMy stuff being stolen (proven)\nLights being turned on inside the apartment\nApartment doors closed, that were previously opened (I intentionally check)\nApartment doors opened, that were previously closed (I intentionally check)\nPublic references to very, very intimate, private details about my life online\nSharing of my personal data, including and especially geolocation data on the Dark Web (proven, with documents)\nPeople following me in the street\nPersistent exclusion from other types of employment (excluding\nTechtonique\n)\nBlocked savings for almost a year, despite all the proofs of my rights to withdraw (proven)\nQuasi-constant physical surveillance in my neighborhood (accountability required)\nOnline and institutional gaslighting (subtle but pernicious, accountability required)\nLawyers vanishing, sometimes after obtaining the documents they asked (proven, accountability required)\nImplied poverty for years, with no paid rent and no heating during last winter\nBecause I was complaining, and basically not understanding what was happening to me, I have been subjected to forced hospitalizations (that is, without my consent, and sometimes using State employees) in France, despite the absence of consistent and observable medically/scientifically confirmed diagnosis. To this day, there are no formal evidence of anything. My health insurance covered thousands of euros of treatments that eventually were unwarranted, and the reasons given for my hospitalization were inconsistent and unsubstantiated. I have seen more than 10 psychiatrists regarding this matter, and at least as many medical doctors, and consistently received erratic diagnoses (because the symptoms are also random, even chaotic, so actually non-existing in reality), among:\n“Brief psychotic disorder” (although there were 0 official witness of any trouble that I may cause, until this day, and despite the induced high social pressure, still no trouble)\n“chemical straightjacket” (see\nhttps://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306\n,\nhttps://pubmed.ncbi.nlm.nih.gov/15212045/\n)\nthe not-so obsolete and politically loaded term “sluggish schizophrenia” (see\nhttps://en.wikipedia.org/wiki/Sluggish_schizophrenia\n)\nDuring hospitalization, inside the public hospital, I was under constant monitoring despite no behavioral incidents. Based on this, I must conclude that defamatory reporting by “planted” witnesses and external pressure played a role. Eventually, some medical professionals confirmed no diagnosis at all. Not officially though, as I’d wish. They’re just playing the blame game now, and I’m in the middle, defenseless. A total mess. The fog.\nIn 2024, after other recurrent and violent torments such as:\nRepeated electrical shocks at night, leading to sleep deprivation (accountability required)\nTachycardia episodes without physical cause (proven) or even waking me up (proven)\nIncreased blood pressure (proven)\nInvasion of bodily and digital privacy, and the total absence of intimacy (accountability required)\na psychiatrist, disclosed to me —- unofficially —- the possible\npurely physical\n(that is, induced by something that has as physical existence) root of this issue. I want it to be official now, specifically for someone to make it official. I also want to understand the circumstances leading to the 2 hospitalizations (as it’s my most fundamental right), but they have now become kind of secret, as no one wants to talk about it anymore. The doctor who disclosed the dirty “secret” (since I’m harassed everywhere, I guess it’s not secret anymore to many) has since become nearly unreachable.\nAt this stage, I am not asking for belief —- I am asking for investigation. There’s a reason behind all this mess, and why the answer is so elusive. Appearing and disappearing. What I have experienced may seem extraordinary, but it is also very well-documented. I believe it reflects a coordinated apparatus involving unauthorized surveillance, non-consensual experimentation (some people said “Get Out”), and psychological coercion.\nYou can explore my publications here, as proof that my brain is doing very well, even if no one seems to be determined to find out once and for all:\nhttps://linktr.ee/tmoudiki\nSincerely,\nThierry Moudiki\nhttps://linktr.ee/tmoudiki\nCeci est un appel à la responsabilité, pas à la pitié, car je n’ai jamais été confronté à des allégations formelles (jamais), à des évaluations cognitives avancées (jamais), ou à des procédures/enquêtes transparentes m’accusant de quoi que ce soit (jamais). Pas de convocation par la police ou la justice pour ce que j’aurais pu faire (jamais). Seulement des silences, des évitements et des manipulations. Je cherche reconnaissance et justice depuis 9 ans.\nAu cours de cette période, j’ai subi des formes soutenues et invasives de surveillance et de harcèlement sur trois continents, affectant tous les aspects de ma vie personnelle, professionnelle et sociale. Cela comprend :\nDe multiples intrusions dans mon(s) appartement(s) depuis au moins 2018 (cela a peut-être commencé avant, mais prouvé formellement une seule fois)\nDéplacement de mes effets personnels dans mon appartement\nVol de mes affaires (prouvé)\nLumières allumées dans l’appartement\nPortes d’appartement fermées, qui étaient précédemment ouvertes (je vérifie intentionnellement)\nPortes d’appartement ouvertes, qui étaient précédemment fermées (je vérifie intentionnellement)\nRéférences publiques à des détails très, très intimes et privés de ma vie en ligne\nPartage de mes données personnelles, y compris et surtout mes données de géolocalisation sur le Dark Web (prouvé, avec documents)\nDes personnes qui me suivent dans la rue\nExclusion persistante d’autres types d’emploi (à l’exception de\nTechtonique\n)\nÉpargne bloquée pendant près d’un an, malgré toutes les preuves de mes droits de retrait (prouvé)\nSurveillance physique quasi-constante dans mon immeuble (responsabilité requise)\nGaslighting\nen ligne et institutionnel (subtil mais pernicieux, responsabilité requise)\nAvocats qui disparaissent, parfois après avoir obtenu les documents demandés (prouvé, responsabilité requise)\nPauvreté induite pendant des années, sans loyer payé et sans chauffage pendant le dernier hiver\nParce que je me plaignais, et que je ne comprenais pas ce qui m’arrivait, j’ai été soumis à des hospitalisations forcées (c’est-à-dire sans mon consentement, et parfois en utilisant des employés de l’État) en France, malgré l’absence de diagnostic médical/scientifique cohérent et observable. À ce jour, il n’y a aucune preuve formelle de quel que ce diagnostic fiable que ce soit. Mon assurance maladie a couvert des milliers d’euros de traitements qui se sont finalement avérés injustifiés, et les raisons données pour mon hospitalisation étaient incohérentes et non fondées. J’ai consulté plus de 10 psychiatres concernant cette question, et au moins autant de médecins, et j’ai constamment reçu des diagnostics erratiques (car les symptômes sont également aléatoires, voire chaotiques, donc en réalité pas liés à une réelle pathologie), parmi lesquels :\n“Trouble psychotique bref” (bien qu’il n’y ait eu 0 témoin officiel de tout trouble que j’aurais pu causer, jusqu’à ce jour, et malgré la forte pression sociale induite; toujours pas de trouble)\n“camisole chimique” (voir\nhttps://theconversation.com/story-of-antipsychotics-is-one-of-myth-and-misrepresentation-18306\n,\nhttps://pubmed.ncbi.nlm.nih.gov/15212045/\n)\nle terme pas si obsolète et politiquement chargé de “schizophrénie progressive” (une notion totalement fallacieuse, voir\nhttps://en.wikipedia.org/wiki/Sluggish_schizophrenia\n)\nPendant l’hospitalisation, à l’intérieur de l’hôpital public, j’étais sous surveillance constante malgré l’absence d’incidents comportementaux. Sur cette base, je dois conclure que des rapports diffamatoires de témoins “plantés” et des pressions externes ont joué un rôle. Finalement, certains professionnels de la santé ont confirmé l’absence de tout diagnostic. Pas officiellement, comme je le souhaiterais. Ils jouent maintenant à se renvoyer la balle, à me renvoyer les uns chez les autres, et je suis au milieu, sans défense. Un gâchis. Le brouillard.\nEn 2024, après d’autres tourments récurrents et violents tels que :\nDes chocs électriques répétés la nuit, entraînant une privation de sommeil (responsabilité requise)\nDes épisodes de tachycardie sans cause physique (prouvé) ou même me réveillant (prouvé)\nAugmentation de la pression artérielle (prouvé)\nInvasion de la vie privée corporelle et numérique, et absence totale d’intimité (responsabilité requise)\nun psychiatre m’a révélé —- officieusement —- la possible origine\npurement physique\n(c’est à dire, mécaniquement induite) de ce problème. Je veux que cela soit officiel maintenant, spécifiquement que quelqu’un le rende officiel. Je veux aussi comprendre les circonstances ayant conduit aux 2 hospitalisations (car c’est mon droit le plus fondamental), mais elles sont devenues en quelque sorte secrètes, car personne ne veut plus en parler. Le médecin qui a révélé le “secret” (puisque je suis harcelé partout, je suppose que ce n’est plus un secret pour beaucoup) est depuis devenu presque injoignable.\nÀ ce stade, je ne demande pas à être cru —- je demande une enquête. Il y a une raison derrière tout ce gâchis, et pour laquelle la réponse est si insaisissable; apparaissant et disparaissant. Ce que j’ai vécu peut sembler extraordinaire, mais c’est aussi très bien documenté. Je crois que cela reflète une officine organisée impliquant surveillance permanente et invasive non autorisée,  expérimentations non consenties (certaines personnes ont dit “Get Out”), et une coercition psychologique.\nVous pouvez explorer mes publications ici, comme preuve que mon cerveau fonctionne très bien, même si personne ne semble déterminé à le découvrir une fois pour toutes :\nhttps://linktr.ee/tmoudiki\nSincèrement,\nThierry Moudiki\nhttps://linktr.ee/tmoudiki\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nT. Moudiki's Webpage - R\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
    "meta_description": "Exceptionally, and on a more personal note (otherwise I may get buried alive)...",
    "meta_keywords": null,
    "og_description": "Exceptionally, and on a more personal note (otherwise I may get buried alive)...",
    "og_image": "https://www.r-bloggers.com/wp-content/uploads/2016/04/R_02_2016-05-01.png",
    "og_title": "Exceptionally, and on a more personal note (otherwise I may get buried alive)… | R-bloggers",
    "raw_jsonld_article": null,
    "reading_time_min": 9.3,
    "sitemap_lastmod": null,
    "twitter_description": "Exceptionally, and on a more personal note (otherwise I may get buried alive)...",
    "twitter_title": "Exceptionally, and on a more personal note (otherwise I may get buried alive)… | R-bloggers",
    "url": "https://www.r-bloggers.com/2025/06/exceptionally-and-on-a-more-personal-note-otherwise-i-may-get-buried-alive/",
    "word_count": 1857
  }
}