{
  "id": "cbb39a661d410ae4047172366c8be2283ac68520",
  "url": "https://www.r-bloggers.com/2024/12/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
  "created_at_utc": "2025-11-22T19:59:37Z",
  "data": null,
  "raw_original": {
    "uuid": "b1685a04-de75-4fa0-9209-51163d3ba47c",
    "created_at": "2025-11-22 19:59:37",
    "raw_json": {
      "article_author": null,
      "article_headline": null,
      "article_modified": null,
      "article_published": null,
      "article_section": null,
      "article_tags": null,
      "canonical_url": "https://www.r-bloggers.com/2024/12/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
      "crawled_at": "2025-11-22T10:56:49.454016",
      "external_links": [
        {
          "href": "https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
          "text": "Rtask"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        },
        {
          "href": "https://rtask.thinkr.fr/",
          "text": "Rtask"
        },
        {
          "href": "https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
          "text": "Introducing Rlinguo, a native mobile app that runs R"
        },
        {
          "href": "https://apps.apple.com/fr/app/rlinguo/id6738416608",
          "text": "iOs on the AppStore"
        },
        {
          "href": "https://play.google.com/store/apps/details?id=com.thinkr.rlinguo",
          "text": "Android on the Google Play Store"
        },
        {
          "href": "https://docs.r-wasm.org/webr/latest/",
          "text": "webR"
        },
        {
          "href": "https://github.com/ColinFay/webrcli",
          "text": "webrcli"
        },
        {
          "href": "https://github.com/ColinFay/spidyr",
          "text": "spidyr"
        },
        {
          "href": "https://rtask.thinkr.fr/consultants-r-experts/margot-brard/",
          "text": "Margot"
        },
        {
          "href": "https://rtask.thinkr.fr/consultants-r-experts/arthur-breant/",
          "text": "Arthur"
        },
        {
          "href": "https://rtask.thinkr.fr/consultants-r-experts/colin-fay/",
          "text": "Colin"
        },
        {
          "href": "https://rtask.thinkr.fr/contact/",
          "text": "Perfect, let’s chat!"
        },
        {
          "href": "https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
          "text": "Introducing Rlinguo, a native mobile app that runs R"
        },
        {
          "href": "https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
          "text": "Rtask"
        },
        {
          "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
          "text": "daily e-mail updates"
        },
        {
          "href": "https://www.r-project.org/",
          "text": "R"
        },
        {
          "href": "https://www.r-users.com/",
          "text": "Click here if you're looking to post or find an R/data-science job"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        }
      ],
      "h1_title": "R-bloggers",
      "html_title": "Introducing Rlinguo, a native mobile app that runs R | R-bloggers",
      "images": [],
      "internal_links": [
        {
          "href": "https://www.r-bloggers.com/author/colin-fay/",
          "text": "Colin Fay"
        },
        {
          "href": "https://www.r-bloggers.com/category/r-bloggers/",
          "text": "R bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/contact-us/",
          "text": "here"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers.com"
        },
        {
          "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
          "text": "learning R"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        }
      ],
      "lang": "en-US",
      "main_html": "<article class=\"post-389353 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">Introducing Rlinguo, a native mobile app that runs R</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">December 18, 2024</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/colin-fay/\">Colin Fay</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \n<div style=\"min-height: 30px;\">\n[social4i size=\"small\" align=\"align-left\"]\n</div>\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\n[This article was first published on  <strong><a href=\"https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/\"> Rtask</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 4.0.47--><p>You can read the original post in its original format on <a href=\"https://rtask.thinkr.fr/\" rel=\"nofollow\" target=\"_blank\">Rtask</a> website by ThinkR here: <a href=\"https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/\" rel=\"nofollow\" target=\"_blank\">Introducing Rlinguo, a native mobile app that runs R</a></p>\n<div><span style=\"font-size: 1.4em; font-weight: bold;\">TL;DR</span></div>\n<div class=\"markdown-here-wrapper\" data-md-url=\"https://rtask.thinkr.fr/wp-admin/post-new.php\">\n<p style=\"margin: 0px 0px 1.2em !important;\"><code>Rlinguo</code> is a groundbreaking mobile application <strong>that uses R in the backend to handle its business logic</strong>.</p>\n<p>Available for download now:</p>\n<ul style=\"margin: 1.2em 0px; padding-left: 2em;\">\n<li style=\"margin: 0.5em 0px;\">\n<p style=\"margin: 0.5em 0px !important;\"><a href=\"https://apps.apple.com/fr/app/rlinguo/id6738416608?\" rel=\"nofollow\" target=\"_blank\">iOs on the AppStore</a></p>\n</li>\n<li style=\"margin: 0.5em 0px;\">\n<p style=\"margin: 0.5em 0px !important;\"><a href=\"https://play.google.com/store/apps/details?id=com.thinkr.rlinguo\" rel=\"nofollow\" target=\"_blank\">Android on the Google Play Store</a></p>\n</li>\n</ul>\n<p>Yes, you read that right: <strong>the future is now, and we can run R on your mobile phone</strong>.</p>\n<h2 id=\"once-upon-a-time-\" style=\"margin: 1.3em 0px 1em; padding: 0px; font-weight: bold; font-size: 1.4em; border-bottom: 1px solid #eeeeee;\">Once upon a time…</h2>\n<p><strong>I’ve been building web apps with R for quite some time now</strong>—probably longer than I’d like to admit. At ThinkR, we’ve been developing <code>{shiny}</code> apps for a while, ranging from small widgets for researchers to large-scale dashboards used by thousands of bankers.</p>\n<p>But web development hasn’t been limited to <code>{shiny}</code> for us. We’ve also created REST APIs, flex/quarto dashboards, and dynamic documents generated with R. Over the past few years, we’ve explored various ways to deliver data products to our clients, primarily using <code>{shiny}</code> apps but also through other formats.</p>\n<p>Amid this diversity of formats, one platform has consistently evaded us: mobile. Yes, <strong><code>{shiny}</code> apps can be optimized for mobile use, and JavaScript dashboards can display nicely on a phone. However, they’re not native mobile apps</strong>. They can’t be installed from an app store, don’t have access to your phone’s APIs, and making them work offline is a significant challenge.</p>\n<h2 id=\"-shiny-on-my-mobile\" style=\"margin: 1.3em 0px 1em; padding: 0px; font-weight: bold; font-size: 1.4em; border-bottom: 1px solid #eeeeee;\"><code>{shiny}</code> on my mobile</h2>\n<p>“<code>{shiny}</code> on my mobile” has been a recurring request from our clients for some time now. And it’s easy to see why: y<strong>ou might have a fantastic model or efficient data wrangling process, and you need people to access it on their smartphones</strong>—even in the middle of the forest with no cell connection (yes, that was an actual request from one of our clients). Yet, our response has always been the same: “Sorry, that’s not possible.” <code>{shiny}</code> relies on a server, and since R can’t run directly on a phone, a remote server is required. That means an internet connection is necessary. And no, you can’t publish it to an app store.</p>\n<p>In recent months, however, something new has emerged—a development that R enthusiasts have been dreaming of for years: R, compiled for WebAssembly. If you’re unfamiliar with WebAssembly, think of it as a way to run R inside JavaScript. If you’re already acquainted with it, you’ll know it’s a bit more nuanced than that, but I’ll spare the technical details for now.</p>\n<p>This new tool is called <a href=\"https://docs.r-wasm.org/webr/latest/\" rel=\"nofollow\" target=\"_blank\"><code>webR</code></a>.</p>\n<h2 id=\"the-what-if-moment\" style=\"margin: 1.3em 0px 1em; padding: 0px; font-weight: bold; font-size: 1.4em; border-bottom: 1px solid #eeeeee;\">The “What If” Moment</h2>\n<p>I’ve been experimenting with <code>webR</code> for several months now, primarily from a Node.js perspective. During this time, I developed two tools, <a href=\"https://github.com/ColinFay/webrcli\" rel=\"nofollow\" target=\"_blank\"><code>webrcli</code></a> and <a href=\"https://github.com/ColinFay/spidyr\" rel=\"nofollow\" target=\"_blank\"><code>spidyr</code></a>, specifically designed for projects that integrate R and Node.js. While these tools have the potential to revolutionize app development, they are still tied to a remote web-based approach: R runs on a server elsewhere, inside a Node.js process. This means there’s still no offline functionality, no app store deployment, and no native mobile features.</p>\n<p>This summer, we received yet another request for “<code>{shiny}</code> as a native mobile app.” As we were about to deliver our usual response, I had a “What if?” moment. <strong><em>What if we could use <code>webR</code> in a JavaScript framework that creates mobile apps?</em></strong> With this idea, we developed a proof of concept (PoC): a mobile app capable of running one line of R code. A fully functional app of this nature had never been done before, but we believed it was achievable.</p>\n<p>Unfortunately, the client chose not to pursue the project. Building a mobile app requires skills beyond those typical of <code>{shiny}</code> developers, and they needed software they could maintain independently. Nevertheless, <strong>having created a PoC, we decided to go all in and develop a complete application</strong>—something user-friendly, slightly playful, and distributable via app stores, to prove that this could indeed be done.</p>\n<p>Over the next few weeks, the team at ThinkR brought this vision to life. <a href=\"https://rtask.thinkr.fr/consultants-r-experts/margot-brard/\" rel=\"nofollow\" target=\"_blank\">Margot</a> shaped the project and wrote the concept paper (more on that in a future blog post), <a href=\"https://rtask.thinkr.fr/consultants-r-experts/arthur-breant/\" rel=\"nofollow\" target=\"_blank\">Arthur</a> crafted the app mock-up using Excalidraw and Figma, showcasing his exceptional UI skills, and I (<a href=\"https://rtask.thinkr.fr/consultants-r-experts/colin-fay/\" rel=\"nofollow\" target=\"_blank\">Colin</a>) focused on backend development (largely because my design skills are… lacking, and frontend work is not my forte).</p>\n<p>The result of this exciting journey is <strong>Rlinguo</strong>, a native mobile app that runs R. <strong>Yes, you read that correctly—R can now run on your phone, and this app is a proof of concept turned reality</strong>.</p>\n<h2 id=\"the-shape-of-r-to-come\" style=\"margin: 1.3em 0px 1em; padding: 0px; font-weight: bold; font-size: 1.4em; border-bottom: 1px solid #eeeeee;\">The Shape of R to Come</h2>\n<p>Rlinguo is a playful and quirky game that challenges users to identify which package a given R function belongs to. Admittedly, this may not be the most practical skill—knowing that <code>mean()</code> is in <code>{base}</code> while <code>median()</code> resides in <code>{stats}</code> won’t necessarily make you a better developer (although, I must admit, it still irks me that they’re in separate packages).</p>\n<p>The primary goal of this app was to serve as proof that native mobile apps leveraging the power of R are not only possible but can also pave the way for broader applications.</p>\n<p>The app demonstrates several groundbreaking capabilities:</p>\n<ul>\n<li><strong>R at your fingertips, straight from your pocket:</strong><br/>\nThe app showcases R’s functionality in multiple ways, such as performing a <code>sample()</code> from a list of installed packages and another from exported functions. On the About page, users can even execute a <code>runif()</code> to confirm that Rlinguo truly runs R behind the scenes.</li>\n<li><strong>Offline Functionality:</strong><br/>\nDesigned to work without an internet connection, Rlinguo makes it possible to deploy R models on smartphones—even for users in remote, disconnected locations, such as deep in the woods</li>\n<li><strong>Enabling a Real Data-Science Workflow:</strong><br/>\nRlinguo mirrors a typical data-science pipeline. Data is stored locally in an SQL database, queried, processed in R (via counting and pivoting), and then returned to JavaScript for visualization. The result? A user-friendly display of your game performance.</li>\n<li><strong>Integrating R Packages:</strong><br/>\nThe app uses R packages creatively. When you guess a function correctly, you’re rewarded with a <code>praise::praise()</code> message; if you’re wrong, a custom function provides feedback (though I’ve yet to find a package dedicated to offering words of encouragement).</li>\n<li><strong>Delivering a Great User Experience:</strong><br/>\nRlinguo prioritizes usability, addressing a common shortfall in tools incorporating R. The goal was to craft an app that feels polished and enjoyable to use.</li>\n<li><strong>Deploying R-Based Apps to Stores:</strong><br/>\nRlinguo demonstrates that it’s entirely feasible to create a mobile app powered by R and make it available for download on major app stores..</li>\n</ul>\n<p>Rlinguo is available now on the Apple Store and Google Play. We see this as the first step in a new wave of innovation, and to borrow a phrase, “baby, you never felt this good.”</p>\n</div>\n<h2 id=\"the-shape-of-r-to-come\" style=\"margin: 1.3em 0px 1em; padding: 0px; font-weight: bold; font-size: 1.4em; border-bottom: 1px solid #eeeeee;\">You’ve got a use case?</h2>\n<p>The idea of running R on a phone has been a popular request from our clients — there are countless possibilities.</p>\n<p>Is this something you need? Do you have a fantastic use case for R on your phone? <a href=\"https://rtask.thinkr.fr/contact/\" rel=\"nofollow\" target=\"_blank\">Perfect, let’s chat!</a></p>\n<div class=\"markdown-here-wrapper\" data-md-url=\"https://rtask.thinkr.fr/wp-admin/post-new.php\">\n<hr/>\n<p style=\"margin: 0px 0px 1.2em !important;\">Notes:</p>\n<p style=\"margin: 0px 0px 1.2em !important;\">(*) We identified two applications on the App Store that incorporate <code>webR</code>. However, these appear to function primarily as wrappers around JavaScript integrated development environments (IDEs) and do not address our specific objective: creating a “real-life” mobile application that utilizes R for its core business logic.</p>\n<div class=\"absolute h-[60px]\">\n<div class=\"flex items-center gap-0.5 text-sm font-medium\"></div>\n</div>\n<div style=\"height: 0; width: 0; max-height: 0; max-width: 0; overflow: hidden; font-size: 0em; padding: 0; margin: 0;\" title=\"MDH:PGRpdj4jIyBUTDtEUjwvZGl2Pjxicj48ZGl2PmBSbGluZ3VvYCBpcyB0aGUgZmlyc3QgbmF0aXZl IG1vYmlsZSBhcHAgdGhhdCBydW5zIFIgaW4gdGhlIGJhY2tlbmQgZm9yIGl0cyBidXNpbmVzcyBs b2dpYy48L2Rpdj48YnI+PGRpdj5Zb3UgY2FuIGRvd25sb2FkIGl0IGZvcjo8L2Rpdj48YnI+PGRp dj4tIFtpT3Mgb24gdGhlIEFwcFN0b3JlXSgpPC9kaXY+PGJyPjxkaXY+LSBbQW5kcm9pZCBvbiB0 aGUgR29vZ2xlIFBsYXkgU3RvcmVdKCk8L2Rpdj48YnI+PGJyPjxkaXY+IyMgT25jZSB1cG9uIGEg dGltZS4uLjwvZGl2Pjxicj48ZGl2PkkndmUgYmVlbiBidWlsZGluZyB3ZWIgYXBwcyB3aXRoIFIg Zm9yIHF1aXRlIGEgd2hpbGUgbm934oCUcHJvYmFibHkgZm9yIGxvbmdlciB0aGFuIEkgZGFyZSB0 byBhZG1pdC4gQXQgVGhpbmtSLCB3ZeKAmXZlIGJlZW4gZGV2ZWxvcGluZyBge3NoaW55fWAgYXBw cyBmb3Igc29tZSB0aW1lIG5vdywgcmFuZ2luZyBmcm9tIHNtYWxsIHdpZGdldHMgZm9yIHJlc2Vh cmNoZXJzIHRvIGxhcmdlIGRhc2hib2FyZHMgZm9yIHRob3VzYW5kcyBvZiBiYW5rZXJzLjwvZGl2 Pjxicj48ZGl2PkJ1dCB0aGF0J3Mgbm90IHRoZSBvbmx5IHdlYi1yZWxhdGVkIHdvcmsgd2UndmUg ZG9uZTogd2XigJl2ZSBhbHNvIGJ1aWx0IFJFU1QgQVBJcywgZmxleC9xdWFydG8gZGFzaGJvYXJk cywgYW5kIGR5bmFtaWMgZG9jdW1lbnRzIGdlbmVyYXRlZCB3aXRoIFIuIEluIHRoZSBwYXN0IGZl dyB5ZWFycywgd2XigJl2ZSBiZWVuIGV4cGVyaW1lbnRpbmcgZXh0ZW5zaXZlbHkgd2l0aCBzZXJ2 aW5nIGRhdGEgcHJvZHVjdHMgdG8gb3VyIGNsaWVudHMsIG1vc3RseSB0aHJvdWdoIGB7c2hpbnl9 YCBhcHBzIGJ1dCBhbHNvIHdpdGggb3RoZXIgZm9ybWF0cy48L2Rpdj48YnI+PGRpdj5BbW9uZyB0 aGlzIHBsZXRob3JhIG9mIGZvcm1hdHMsIHRoZXJl4oCZcyBvbmUgcGxhdGZvcm0gdGhhdCBoYXMg YWx3YXlzIGVsdWRlZCB1czogbW9iaWxlLiBZZXMsIG9mIGNvdXJzZSwgYHtzaGlueX1gIGFwcHMg Y2FuIGJlIG1vYmlsZS1mcmllbmRseS4gWWVzLCBKYXZhU2NyaXB0IGRhc2hib2FyZHMgY2FuIHJl bmRlciB3ZWxsIG9uIHlvdXIgcGhvbmUuIFN0aWxsLCB0aGV5IGFyZSBub3QgbmF0aXZlIG1vYmls ZSBhcHBzLiBUaGV5IGNhbuKAmXQgYmUgaW5zdGFsbGVkIGZyb20gYSBzdG9yZSwgY2Fu4oCZdCBh Y2Nlc3MgeW91ciBwaG9uZeKAmXMgQVBJcywgYW5kIGl04oCZcyBjaGFsbGVuZ2luZyB0byBtYWtl IHRoZW0gd29yayBvZmZsaW5lLjwvZGl2Pjxicj48ZGl2PiMjIGB7c2hpbnl9YCBvbiBteSBtb2Jp bGU8L2Rpdj48YnI+PGRpdj4iYHtzaGlueX1gIG9uIG15IG1vYmlsZSIgaGFzIGJlZW4gYSByZXF1 ZXN0IGZyb20gb3VyIGNsaWVudHMgZm9yIGEgd2hpbGUgbm93LiBJdCBtYWtlcyBzZW5zZTogeW91 IG1heSBoYXZlIGEgZ3JlYXQgbW9kZWwgb3Igc29tZSBkYXRhIHdyYW5nbGluZyB0aGF0IHdvcmtz IHdlbGwsIGFuZCB5b3UgbmVlZCBwZW9wbGUgdG8gdXNlIGl0IG9uIHRoZWlyIHNtYXJ0cGhvbmVz IHdoaWxlIGluIHRoZSBtaWRkbGUgb2YgdGhlIGZvcmVzdCB3aXRoIG5vIGNlbGwgY29ubmVjdGlv biAoYmVsaWV2ZSBpdCBvciBub3QsIHRoaXMgd2FzIHRoZSBuZWVkIGZvciBvbmUgb2Ygb3VyIGNs aWVudHMpLiBFdmVyeSB0aW1lLCB0aG91Z2gsIHdlIHByb3ZpZGVkIHRoZSBzYW1lIGFuc3dlcjog IlNvcnJ5LCBub3RoaW5nIHdvcmtzIGZvciB0aGF0LiIgYHtzaGlueX1gIHJlcXVpcmVzIGEgc2Vy dmVyLCBhbmQgc2luY2UgeW91IGNhbuKAmXQgcnVuIFIgb24geW91ciBwaG9uZSwgeW91IG5lZWQg YSByZW1vdGUgc2VydmVyLiBZZXMsIHRoYXQgbWVhbnMgYW4gaW50ZXJuZXQgY29ubmVjdGlvbi4g QW5kIG5vLCBzb3JyeSwgYnV0IHlvdSBjYW7igJl0IHB1Ymxpc2ggaXQgdG8gdGhlIHN0b3JlLjwv ZGl2Pjxicj48ZGl2PkluIHRoZSBwYXN0IGNvdXBsZSBvZiBtb250aHMsIHNvbWV0aGluZyBuZXcg ZW1lcmdlZC4gSXTigJlzIGEgbGl0dGxlIHNvbWV0aGluZyB0aGF0IFIgZW50aHVzaWFzdHMgaGF2 ZSBiZWVuIGRyZWFtaW5nIGFib3V0IGZvciBhIGNvdXBsZSBvZiB5ZWFycyBub3c6IFIsIGNvbXBp bGVkIGZvciBXZWJBc3NlbWJseS4gSWYgeW91IGhhdmUgbm8gaWRlYSB3aGF0IHRoaXMgaXMsIGp1 c3QgaW1hZ2luZSBpdCBhcyBhIHdheSB0byBydW4gUiBpbnNpZGUgSmF2YVNjcmlwdC4gSWYgeW91 IGtub3cgd2hhdCB0aGlzIGlzLCB5b3UgdW5kZXJzdGFuZCBpdOKAmXMgYSBiaXQgbW9yZSBjb21w bGljYXRlZCwgYnV0IEkgZG9u4oCZdCB3YW50IHRvIGdldCBpbnRvIHRoZSB3ZWVkcyByaWdodCBu b3cuPC9kaXY+PGJyPjxkaXY+VGhpcyBuZXcgdG9vbCBpcyBjYWxsZWQgW2B3ZWJSYF0oaHR0cHM6 Ly9kb2NzLnItd2FzbS5vcmcvd2Vici9sYXRlc3QvKS48L2Rpdj48YnI+PGRpdj4jIyBUaGUgIldo YXQgSWYiIE1vbWVudDwvZGl2Pjxicj48ZGl2PknigJl2ZSBiZWVuIHBsYXlpbmcgYXJvdW5kIHdp dGggYHdlYlJgIGZvciBhIGZldyBtb250aHMgbm93LCBtb3N0bHkgZnJvbSB0aGUgTm9kZS5qcyBw ZXJzcGVjdGl2ZeKAlGJ1aWxkaW5nIHR3byB0b29scyBjYWxsZWQgW2B3ZWJyY2xpYF0oaHR0cHM6 Ly9naXRodWIuY29tL0NvbGluRmF5L3dlYnJjbGkpIGFuZCBbYHNwaWR5cmBdKGh0dHBzOi8vZ2l0 aHViLmNvbS9Db2xpbkZheS9zcGlkeXIpIHRoYXQgYXJlIHNwZWNpZmljYWxseSBkZXNpZ25lZCBm b3IgYnVpbGRpbmcgcHJvamVjdHMgdGhhdCBtaXggUiBhbmQgTm9kZS5qcy4gRXZlbiB0aG91Z2gg dGhpcyBoYXMgdGhlIHBvdGVudGlhbCB0byByZXRoaW5rIHRoZSB3YXkgd2UgYnVpbGQgYXBwcywg aXTigJlzIHN0aWxsIGEgcmVtb3RlIHdlYi1iYXNlZCBzb2x1dGlvbjogUiBydW5zIG9uIGEgc2Vy dmVyIHNvbWV3aGVyZSBlbHNlIGluc2lkZSBhIE5vZGUuanMgcHJvY2Vzcy4gVGhlcmXigJlzIHN0 aWxsIG5vIHJlYWwgb2ZmbGluZSBtb2RlLCBubyBzdG9yZSwgYW5kIG5vIG5hdGl2ZSBtb2JpbGUg ZmVhdHVyZXMuPC9kaXY+PGJyPjxkaXY+VGhpcyBzdW1tZXIsIHdlIHdlcmUgY29udGFjdGVkIGFi b3V0IGFub3RoZXIgImB7c2hpbnl9YCBhcyBhIG5hdGl2ZSBtb2JpbGUgYXBwLiIgSnVzdCBhcyB3 ZSB3ZXJlIGFib3V0IHRvIHByb3ZpZGUgdGhlIHNhbWUgYW5zd2VyIGFzIGJlZm9yZSwgSSB3YXMg c3RydWNrIGJ5IGEgIldoYXQgaWY/IiBtb21lbnQuICJXaGF0IGlmIHdlIGNvdWxkIHVzZSBgd2Vi UmAgaW4gYSBKYXZhU2NyaXB0IGZyYW1ld29yayB0aGF0IGNhbiBidWlsZCBtb2JpbGUgYXBwcz8i IFNvIHdlIHByZXNlbnRlZCBhIGZpcnN0IHByb29mIG9mIGNvbmNlcHQgKFBvQykgb2YgYSBtb2Jp bGUgYXBwIHRoYXQgcnVucyBhIGxpbmUgb2YgUiBjb2RlLiBBIGZ1bGwgcmVhbCBhcHAoKikgaGFz IG5ldmVyIGJlZW4gZG9uZSBiZWZvcmUgYnV0IHRoYXQgd2Ugd2VyZSBwcmV0dHkgc3VyZSB0aGF0 IHRoaXMgd2FzIGRvYWJsZS48L2Rpdj48YnI+PGRpdj5VbmZvcnR1bmF0ZWx5LCBvdXIgY2xpZW50 IGRpZG7igJl0IGZvbGxvdyB1cCBvbiB0aGlzIHByb2plY3TigJRidWlsZGluZyBhIG1vYmlsZSBh cHAgcmVxdWlyZXMgc2tpbGxzIG91dHNpZGUgdGhlIGV4cGVydGlzZSBvZiBge3NoaW55fWAgZGV2 ZWxvcGVycywgYW5kIHRoZXkgd2FudGVkIGEgc29mdHdhcmUgdGhleSBjb3VsZCBtYWludGFpbi4g SG93ZXZlciwgc2luY2UgSSBoYWQgYnVpbHQgYSBQb0MsIHdlIGRlY2lkZWQgdG8gZ28gYWxsIHRo ZSB3YXkgYW5kIGZ1bGx5IGRldmVsb3AgYW4gYXBw4oCUc29tZXRoaW5nIHVzZXItZnJpZW5kbHks IGEgYml0IGZ1biwgYW5kIGRpc3RyaWJ1dGFibGUgdG8gdGhlIHN0b3JlIHRvIHByb3ZlIHRoYXQg dGhpcyBpcyBzb21ldGhpbmcgdGhhdCBjYW4gYmUgZG9uZS48L2Rpdj48YnI+PGRpdj5XZSBzcGVu dCBhIGNvdXBsZSBvZiB3ZWVrcyBhdCBUaGlua1IgYnVpbGRpbmcgdGhlIHByb2plY3Q6IFtNYXJn b3RdKGh0dHBzOi8vcnRhc2sudGhpbmtyLmZyL2NvbnN1bHRhbnRzLXItZXhwZXJ0cy9tYXJnb3Qt YnJhcmQvKSBoZWxwZWQgdXMgc2hhcGUgdGhlIHByb2plY3QgYW5kIHdyaXRlIHRoZSBjb25jZXB0 IHBhcGVyIChtb3JlIG9uIHRoYXQgaW4gYSBmdXR1cmUgYmxvZyBwb3N0KSwgW0FydGh1cl0oaHR0 cHM6Ly9ydGFzay50aGlua3IuZnIvY29uc3VsdGFudHMtci1leHBlcnRzL2FydGh1ci1icmVhbnQv KSB3b3JrZWQgb24gdGhlIGFwcCBtb2NrLXVwIGluIEV4Y2FsaWRyYXcgYW5kIEZpZ21hIChtb3Jl IG9uIHRoYXQgaW4gdGhlIGZ1dHVyZSB0b28pIGFuZCBwdXQgaGlzIGNyYXp5IFVJIHNraWxscyB0 byB3b3JrLCBhbmQgSSAoW0NvbGluXShodHRwczovL3J0YXNrLnRoaW5rci5mci9jb25zdWx0YW50 cy1yLWV4cGVydHMvY29saW4tZmF5LykpIGZvY3VzZWQgb24gZXZlcnl0aGluZyBiYWNrZW5kLXJl bGF0ZWQgKG1vc3RseSBiZWNhdXNlIEkgaGF2ZSBwb29yIGRlc2lnbiB0YXN0ZXMgYW5kIEknbSBu b3QgdmVyeSBnb29kIHdpdGggYW55dGhpbmcgZnJvbnRlbmQpLjwvZGl2Pjxicj48ZGl2Pk91dCBv ZiB0aGlzIGluY3JlZGlibGUgam91cm5leSBjYW1lIGBSbGluZ3VvYCwgYSBuYXRpdmUgbW9iaWxl IGFwcCB0aGF0IHJ1bnMgUi4gWWVzLCB5b3UgcmVhZCB0aGF0IGNvcnJlY3RseeKAlFIgY2FuIHJ1 biBvbiB5b3VyIHBob25lLCBhbmQgdGhpcyBhcHAgaXMgbGl2aW5nIHByb29mIG9mIHRoYXQuPC9k aXY+PGJyPjxkaXY+IyMgVGhlIFNoYXBlIG9mIFIgdG8gQ29tZTwvZGl2Pjxicj48ZGl2PmBSbGlu Z3VvYCBpcyBhIGZ1biBhbmQgc2lsbHkgZ2FtZSB0aGF0IGNoYWxsZW5nZXMgeW91IHRvIGd1ZXNz IHdoaWNoIHBhY2thZ2UgYSBmdW5jdGlvbiBjb21lcyBmcm9tLiBPZiBjb3Vyc2UsIHRoaXMgaXMg YSBiaXQgb2YgYSB1c2VsZXNzIHNraWxsOiBrbm93aW5nIHRoYXQgYG1lYW4oKWAgaXMgaW4gYHti YXNlfWAgYW5kIGBtZWRpYW4oKWAgaXMgaW4gYHtzdGF0c31gIHdvbuKAmXQgbWFrZSB5b3UgYSBi ZXR0ZXIgZGV2ZWxvcGVyIChidXQgeWVzLCBpdCBzdGlsbCBib3RoZXJzIG1lIHRoYXQgYm90aCBh cmUgbm90IGluIHRoZSBzYW1lIHBhY2thZ2UpLjwvZGl2Pjxicj48ZGl2PldlIG1haW5seSB3YW50 ZWQgdG8gYnVpbGQgdGhpcyBhcHAgYXMgcHJvb2YgdGhhdCBpdCBpcyBwb3NzaWJsZSBhbmQgdG8g cGF2ZSB0aGUgd2F5IGZvciBtb3JlIG5hdGl2ZSBtb2JpbGUgYXBwcyB0aGF0IGNhbiBiZW5lZml0 IGZyb20gdGhlIHBvd2VyIG9mIFIuPC9kaXY+PGJyPjxkaXY+VGhpcyBhcHAgYWltcyB0byBwcm92 ZSB0aGF0OjwvZGl2Pjxicj48ZGl2Pi0gWW91IGNhbiBydW4gUiBvbiB5b3VyIG1vYmlsZSBkZXZp Y2XigJRpdCdzIGRlbW9uc3RyYXRlZCBzZXZlcmFsIHRpbWVzIGluIHRoZSBhcHAsIGFzIGl0IHBl cmZvcm1zIGEgYHNhbXBsZSgpYCBmcm9tIHRoZSBsaXN0IG9mIGluc3RhbGxlZCBwYWNrYWdlcywg dGhlbiBhbm90aGVyIGBzYW1wbGUoKWAgZnJvbSBhIGxpc3Qgb2YgZXhwb3J0ZWQgZnVuY3Rpb25z LiBZb3UgY2FuIGFsc28gcnVuIGEgYHJ1bmlmKClgIGluIHRoZSBBYm91dCBwYWdlLCBqdXN0IHRv IGVuc3VyZSB0aGF0IFJsaW5ndW8gYWN0dWFsbHkgcnVucyBSIGJlaGluZCB0aGUgc2NlbmVzLjwv ZGl2Pjxicj48ZGl2Pi0gWW91IGNhbiBhY2hpZXZlIGEgZ2VudWluZSBkYXRhLXNjaWVuY2UgZXhw ZXJpZW5jZSB3aXRoIGEgbW9iaWxlIGFwcOKAlHRoZSBhcHAgbWltaWNzIHdoYXQgeW91IHdvdWxk IGZpbmQgaW4gYSBkYXRhIHNjaWVuY2UgcHJvamVjdDogZGF0YSBpcyBzdG9yZWQgaW4gYW4gU1FM IGRhdGFiYXNlIG9uIHlvdXIgcGhvbmUsIHRoZSBhcHAgcGVyZm9ybXMgYSBxdWVyeSwgdGhlbiBz ZW5kcyBpdCB0byBSLCB3aGljaCBkb2VzIHRoZSBkYXRhIHdyYW5nbGluZyAoY291bnRpbmcgYW5k IHBpdm90aW5nKSBhbmQgc2VuZHMgaXQgYmFjayB0byBKYXZhU2NyaXB0LCB3aGljaCBkaXNwbGF5 cyBhIGZyaWVuZGx5IGRhdGEgdmlzdWFsaXphdGlvbiBvZiB5b3VyIHBlcmZvcm1hbmNlIGluIHRo ZSBnYW1lLjwvZGl2Pjxicj48ZGl2Pi0gWW91IGNhbiB1c2UgcGFja2FnZXMgd2l0aGluIHlvdXIg bW9iaWxlIGFwcOKAlHdoZW5ldmVyIHlvdSBndWVzcyB0aGUgZnVuY3Rpb24gY29ycmVjdGx5LCB5 b3XigJlsbCByZWNlaXZlIGEgYHByYWlzZTo6cHJhaXNlKClgIGlmIHlvdeKAmXJlIHJpZ2h0LCBv ciBhIGN1c3RvbSBmdW5jdGlvbiBpZiB5b3XigJlyZSB3cm9uZyAoSSB3YXMgdW5hYmxlIHRvIGZp bmQgYSBwYWNrYWdlIHRoYXQgcHJvdmlkZXMgZW5jb3VyYWdlbWVudCkuPC9kaXY+PGJyPjxkaXY+ LSBZb3UgY2FuIGhhdmUgYSBnb29kIHVzZXIgZXhwZXJpZW5jZSBpbiBhIG1vYmlsZSBhcHAgd2l0 aCBSIGluc2lkZS4gV2l0aCB0aGlzIGFwcCwgd2UgYWltZWQgdG8gY3JlYXRlIHNvbWV0aGluZyBw bGVhc2FudCB0byB1c2XigJRzb21ldGhpbmcgdGhhdCBvZnRlbiBsYWNrcyB3aGVuIGJ1aWxkaW5n IHRvb2xzIHRoYXQgaW5jb3Jwb3JhdGUgUi48L2Rpdj48YnI+PGRpdj4tIFlvdSBjYW4gaGF2ZSBh biBhcHAsIHdpdGggUiwgdGhhdCBjYW4gYmUgZGVwbG95ZWQgb24gdGhlIHN0b3JlLjwvZGl2Pjxi cj48ZGl2Pi0gWW91IGNhbiB1c2UgaXQgb2ZmbGluZeKAlHNvIGlmIHlvdXIgZ29hbCBpcyB0byBk ZXBsb3kgeW91ciBSIG1vZGVscyBvbiBzbWFydHBob25lcyBmb3IgcGVvcGxlIHdpdGhvdXQgY2Vs bCBjb3ZlcmFnZSBiZWNhdXNlIHRoZXkgYXJlIGluIHRoZSBtaWRkbGUgb2YgdGhlIHdvb2RzLCB0 aGF04oCZcyBwb3NzaWJsZS48L2Rpdj48YnI+PGRpdj5Bbnl3YXksIGBSbGluZ3VvYCBpcyBhdmFp bGFibGUgb24gdGhlIEFwcGxlIFN0b3JlIGFuZCBHb29nbGUgUGxheS4gSSBiZWxpZXZlIHRoaXMg aXMgdGhlIGZpcnN0IHN0ZXAgdG93YXJkcyBhIG5ldyByZXZvbHV0aW9uLCBhbmQgImJhYnksIHlv dSBuZXZlciBmZWx0IHRoaXMgZ29vZC4iPC9kaXY+PGJyPjxkaXY+LS0tPC9kaXY+PGRpdj5Ob3Rl czo8L2Rpdj48YnI+PGRpdj4oKikgV2UgZGlzY292ZXJlZCB0d28gYXBwcyBvbiB0aGUgQXBwIHN0 b3JlIHRoYXQgYnVuZGxlZCBgd2ViUmAgYnV0IGFzIGZhciBhcyB3ZSBrbm93LCB0aGVzZSB0d28g YXJlIG9ubHkgYSB3cmFwcGVyIGFyb3VuZCB0d28gSmF2YVNjcmlwdCBJREUgYW5kIGRvIG5vdCBy ZWFsbHkgYW5zd2VyIHRoZSBxdWVzdGlvbiB3ZSBhcmUgdHJ5aW5nIHRvIGFuc3dlcjogY2FuIHdl IGJ1aWxkIGEgInJlYWwgbGlmZSBsb29raW5nIiBtb2JpbGUgYXBwIHRoYXQgdXNlcyBSIGZvciBp dHMgYnVzaW5lc3MgbG9naWMuPC9kaXY+\">​</div>\n</div>\n<div></div>\n<p>This post is better presented on its original ThinkR website here: <a href=\"https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/\" rel=\"nofollow\" target=\"_blank\">Introducing Rlinguo, a native mobile app that runs R</a></p>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://rtask.thinkr.fr/introducing-rlinguo-a-native-mobile-app-that-runs-r/\"> Rtask</a></strong>.</div>\n<hr/>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\n\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div> </div>\n</article>",
      "main_text": "Introducing Rlinguo, a native mobile app that runs R\nPosted on\nDecember 18, 2024\nby\nColin Fay\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nRtask\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nYou can read the original post in its original format on\nRtask\nwebsite by ThinkR here:\nIntroducing Rlinguo, a native mobile app that runs R\nTL;DR\nRlinguo\nis a groundbreaking mobile application\nthat uses R in the backend to handle its business logic\n.\nAvailable for download now:\niOs on the AppStore\nAndroid on the Google Play Store\nYes, you read that right:\nthe future is now, and we can run R on your mobile phone\n.\nOnce upon a time…\nI’ve been building web apps with R for quite some time now\n—probably longer than I’d like to admit. At ThinkR, we’ve been developing\n{shiny}\napps for a while, ranging from small widgets for researchers to large-scale dashboards used by thousands of bankers.\nBut web development hasn’t been limited to\n{shiny}\nfor us. We’ve also created REST APIs, flex/quarto dashboards, and dynamic documents generated with R. Over the past few years, we’ve explored various ways to deliver data products to our clients, primarily using\n{shiny}\napps but also through other formats.\nAmid this diversity of formats, one platform has consistently evaded us: mobile. Yes,\n{shiny}\napps can be optimized for mobile use, and JavaScript dashboards can display nicely on a phone. However, they’re not native mobile apps\n. They can’t be installed from an app store, don’t have access to your phone’s APIs, and making them work offline is a significant challenge.\n{shiny}\non my mobile\n“\n{shiny}\non my mobile” has been a recurring request from our clients for some time now. And it’s easy to see why: y\nou might have a fantastic model or efficient data wrangling process, and you need people to access it on their smartphones\n—even in the middle of the forest with no cell connection (yes, that was an actual request from one of our clients). Yet, our response has always been the same: “Sorry, that’s not possible.”\n{shiny}\nrelies on a server, and since R can’t run directly on a phone, a remote server is required. That means an internet connection is necessary. And no, you can’t publish it to an app store.\nIn recent months, however, something new has emerged—a development that R enthusiasts have been dreaming of for years: R, compiled for WebAssembly. If you’re unfamiliar with WebAssembly, think of it as a way to run R inside JavaScript. If you’re already acquainted with it, you’ll know it’s a bit more nuanced than that, but I’ll spare the technical details for now.\nThis new tool is called\nwebR\n.\nThe “What If” Moment\nI’ve been experimenting with\nwebR\nfor several months now, primarily from a Node.js perspective. During this time, I developed two tools,\nwebrcli\nand\nspidyr\n, specifically designed for projects that integrate R and Node.js. While these tools have the potential to revolutionize app development, they are still tied to a remote web-based approach: R runs on a server elsewhere, inside a Node.js process. This means there’s still no offline functionality, no app store deployment, and no native mobile features.\nThis summer, we received yet another request for “\n{shiny}\nas a native mobile app.” As we were about to deliver our usual response, I had a “What if?” moment.\nWhat if we could use\nwebR\nin a JavaScript framework that creates mobile apps?\nWith this idea, we developed a proof of concept (PoC): a mobile app capable of running one line of R code. A fully functional app of this nature had never been done before, but we believed it was achievable.\nUnfortunately, the client chose not to pursue the project. Building a mobile app requires skills beyond those typical of\n{shiny}\ndevelopers, and they needed software they could maintain independently. Nevertheless,\nhaving created a PoC, we decided to go all in and develop a complete application\n—something user-friendly, slightly playful, and distributable via app stores, to prove that this could indeed be done.\nOver the next few weeks, the team at ThinkR brought this vision to life.\nMargot\nshaped the project and wrote the concept paper (more on that in a future blog post),\nArthur\ncrafted the app mock-up using Excalidraw and Figma, showcasing his exceptional UI skills, and I (\nColin\n) focused on backend development (largely because my design skills are… lacking, and frontend work is not my forte).\nThe result of this exciting journey is\nRlinguo\n, a native mobile app that runs R.\nYes, you read that correctly—R can now run on your phone, and this app is a proof of concept turned reality\n.\nThe Shape of R to Come\nRlinguo is a playful and quirky game that challenges users to identify which package a given R function belongs to. Admittedly, this may not be the most practical skill—knowing that\nmean()\nis in\n{base}\nwhile\nmedian()\nresides in\n{stats}\nwon’t necessarily make you a better developer (although, I must admit, it still irks me that they’re in separate packages).\nThe primary goal of this app was to serve as proof that native mobile apps leveraging the power of R are not only possible but can also pave the way for broader applications.\nThe app demonstrates several groundbreaking capabilities:\nR at your fingertips, straight from your pocket:\nThe app showcases R’s functionality in multiple ways, such as performing a\nsample()\nfrom a list of installed packages and another from exported functions. On the About page, users can even execute a\nrunif()\nto confirm that Rlinguo truly runs R behind the scenes.\nOffline Functionality:\nDesigned to work without an internet connection, Rlinguo makes it possible to deploy R models on smartphones—even for users in remote, disconnected locations, such as deep in the woods\nEnabling a Real Data-Science Workflow:\nRlinguo mirrors a typical data-science pipeline. Data is stored locally in an SQL database, queried, processed in R (via counting and pivoting), and then returned to JavaScript for visualization. The result? A user-friendly display of your game performance.\nIntegrating R Packages:\nThe app uses R packages creatively. When you guess a function correctly, you’re rewarded with a\npraise::praise()\nmessage; if you’re wrong, a custom function provides feedback (though I’ve yet to find a package dedicated to offering words of encouragement).\nDelivering a Great User Experience:\nRlinguo prioritizes usability, addressing a common shortfall in tools incorporating R. The goal was to craft an app that feels polished and enjoyable to use.\nDeploying R-Based Apps to Stores:\nRlinguo demonstrates that it’s entirely feasible to create a mobile app powered by R and make it available for download on major app stores..\nRlinguo is available now on the Apple Store and Google Play. We see this as the first step in a new wave of innovation, and to borrow a phrase, “baby, you never felt this good.”\nYou’ve got a use case?\nThe idea of running R on a phone has been a popular request from our clients — there are countless possibilities.\nIs this something you need? Do you have a fantastic use case for R on your phone?\nPerfect, let’s chat!\nNotes:\n(*) We identified two applications on the App Store that incorporate\nwebR\n. However, these appear to function primarily as wrappers around JavaScript integrated development environments (IDEs) and do not address our specific objective: creating a “real-life” mobile application that utilizes R for its core business logic.\n​\nThis post is better presented on its original ThinkR website here:\nIntroducing Rlinguo, a native mobile app that runs R\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nRtask\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
      "meta_description": "You can read the original post in its original format on Rtask website by ThinkR here: Introducing Rlinguo, a native mobile app that runs R TL;DR Rlinguo is a groundbreaking mobile application that uses R in the backend to handle its business logic. Available for download now: iOs on the AppStore Android on the Google Play Store Yes, you read that right: the future is now, and we can run R on your mobile phone. Once upon a time… I’ve been building web apps with This post is better presented on its original ThinkR website here: Introducing Rlinguo, a native mobile app that runs R",
      "meta_keywords": null,
      "og_description": "You can read the original post in its original format on Rtask website by ThinkR here: Introducing Rlinguo, a native mobile app that runs R TL;DR Rlinguo is a groundbreaking mobile application that uses R in the backend to handle its business logic. Available for download now: iOs on the AppStore Android on the Google Play Store Yes, you read that right: the future is now, and we can run R on your mobile phone. Once upon a time… I’ve been building web apps with This post is better presented on its original ThinkR website here: Introducing Rlinguo, a native mobile app that runs R",
      "og_image": "https://www.r-bloggers.com/wp-content/uploads/2016/04/R_02_2016-05-01.png",
      "og_title": "Introducing Rlinguo, a native mobile app that runs R | R-bloggers",
      "raw_jsonld_article": null,
      "reading_time_min": 7,
      "sitemap_lastmod": null,
      "twitter_description": "You can read the original post in its original format on Rtask website by ThinkR here: Introducing Rlinguo, a native mobile app that runs R TL;DR Rlinguo is a groundbreaking mobile application that uses R in the backend to handle its business logic. Available for download now: iOs on the AppStore Android on the Google Play Store Yes, you read that right: the future is now, and we can run R on your mobile phone. Once upon a time… I’ve been building web apps with This post is better presented on its original ThinkR website here: Introducing Rlinguo, a native mobile app that runs R",
      "twitter_title": "Introducing Rlinguo, a native mobile app that runs R | R-bloggers",
      "url": "https://www.r-bloggers.com/2024/12/introducing-rlinguo-a-native-mobile-app-that-runs-r/",
      "word_count": 1410
    }
  }
}