{
  "id": "cc20c17f6ad499067ccf7c6e69a29db58864809f",
  "url": "https://www.r-bloggers.com/2023/11/fair-standards-for-the-creation-of-research-materials-with-examples/",
  "created_at_utc": "2025-11-17T20:39:25Z",
  "data": null,
  "raw_original": {
    "uuid": "8e477fbc-5592-4423-ab6a-7a74f7a0d39a",
    "created_at": "2025-11-17 20:39:25",
    "raw_json": {
      "article_author": null,
      "article_headline": null,
      "article_modified": null,
      "article_published": null,
      "article_section": null,
      "article_tags": null,
      "canonical_url": "https://www.r-bloggers.com/2023/11/fair-standards-for-the-creation-of-research-materials-with-examples/",
      "crawled_at": "2025-11-17T10:01:22.880366",
      "external_links": [
        {
          "href": "https://pablobernabeu.github.io/2023/fair-standards-for-the-creation-of-research-materials-with-examples/",
          "text": "R on Pablo Bernabeu"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        },
        {
          "href": "https://www.go-fair.org/fair-principles",
          "text": "FAIR Guiding Principles for scientific data management and stewardship"
        },
        {
          "href": "https://community.rstudio.com/",
          "text": "Posit Community"
        },
        {
          "href": "https://osdoc.cogsci.nl/",
          "text": "OpenSesame"
        },
        {
          "href": "https://www.psychopy.org/",
          "text": "psychoPy"
        },
        {
          "href": "https://osf.io/gt5uf/wiki",
          "text": "https://osf.io/gt5uf/wiki"
        },
        {
          "href": "https://pablobernabeu.github.io/2023/fair-standards-for-the-creation-of-research-materials-with-examples/",
          "text": "R on Pablo Bernabeu"
        },
        {
          "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
          "text": "daily e-mail updates"
        },
        {
          "href": "https://www.r-project.org/",
          "text": "R"
        },
        {
          "href": "https://www.r-users.com/",
          "text": "Click here if you're looking to post or find an R/data-science job"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        }
      ],
      "h1_title": "R-bloggers",
      "html_title": "FAIR standards for the creation of research materials, with examples | R-bloggers",
      "images": [],
      "internal_links": [
        {
          "href": "https://www.r-bloggers.com/author/r-on-pablo-bernabeu/",
          "text": "R on Pablo Bernabeu"
        },
        {
          "href": "https://www.r-bloggers.com/category/r-bloggers/",
          "text": "R bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/contact-us/",
          "text": "here"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers.com"
        },
        {
          "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
          "text": "learning R"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        }
      ],
      "lang": "en-US",
      "main_html": "<article class=\"post-379702 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">FAIR standards for the creation of research materials, with examples</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">November 1, 2023</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/r-on-pablo-bernabeu/\">R on Pablo Bernabeu</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \r\n<div style=\"min-height: 30px;\">\r\n[social4i size=\"small\" align=\"align-left\"]\r\n</div>\r\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\r\n[This article was first published on  <strong><a href=\"https://pablobernabeu.github.io/2023/fair-standards-for-the-creation-of-research-materials-with-examples/\"> R on Pablo Bernabeu</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\r\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\r\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 3.8.9-->\n<p>Notwithstanding the need for speed in most scientific projects, what should be the <strong>minimum acceptable standards</strong> in the <strong>creation of research materials</strong> such as stimuli, custom software for data collection (e.g., experiment in jsPsych, OpenSesame or psychoPy), or scripts for statistical analysis?</p>\n<p>The answer to this question is contingent upon the field of research, the purpose and the duration of the project, and many other contextual factors. So, to narrow down the scope and come at a general answer, let’s suppose we asked a researcher in the cognitive sciences (e.g., a linguist, a psychologist or a neuroscientist) who values open science. Perhaps, such a researchers would be satisfied with a method for the creation of materials that <strong>allows the creators of the materials, as well as their collaborators and any other stakeholders (e.g., any fellow scientists working in the same field), to explore, understand, reproduce, modify, and reuse the materials following their completion and thereafter</strong>. Let’s review some of the implements that can help fulfil these standards.</p>\n<div class=\"section level1\" id=\"fairness\">\n<h1>FAIRness</h1>\n<p>The <a href=\"https://www.go-fair.org/fair-principles\" rel=\"nofollow\" target=\"_blank\">FAIR Guiding Principles for scientific data management and stewardship</a> exhaustively describe a protocol for making materials <strong>F</strong>indable, <strong>A</strong>ccessible, <strong>I</strong>nteroperable and <strong>R</strong>eusable. These terms cover the five allowances listed above, along with other important aspects.</p>\n<p>Let’s look at some instantiations of the FAIR principles.</p>\n<div class=\"section level2\" id=\"sharing-the-materials\">\n<h2>Sharing the materials</h2>\n<p>A condition sine qua non is to share the materials publicly online, as far as possible. Repositories on servers such as OSF or GitHub are often sufficient to this end. Unfortunately, most studies in the cognitive sciences still do not share the complete materials.</p>\n<p>One of the reasons why sharing is so important is to prevent wrong assumptions by the audience that will consider the research. That is, when the materials of a study are not publicly shared online, the readers of the papers are left with two options: to assume that there were no errors or to assume that were some errors of an uncertain degree. The method followed in the creation of the materials should free the readers of this tribulation, by allowing them to consult the materials and their preparation in full, or as completely as possible.</p>\n</div>\n<div class=\"section level2\" id=\"reproducibility\">\n<h2>Reproducibility</h2>\n<p>It is convenient to allow others, and our future selves, to reproduce the materials throughout their preparation and at any time thereafter. For this purpose, <strong>R</strong> can be used to register in scripts as many as possible of the steps followed throughout the preparation of the materials. Far from being only a software for data analysis, R allows the preparation of texts, images, audios, etc. Humans err, by definition. That can be counted on. Conveniently, registering the steps followed during weeks or months of preparation allows us to offload part of the documentation efforts. It’s a way of video-recording, as it were, all the additions, subtractions, replacements, transformations and calculations performed with the raw materials.</p>\n</div>\n<div class=\"section level2\" id=\"generous-documentation\">\n<h2>Generous documentation</h2>\n<p>Under the curse of knowledge, the creators of research materials may believe that their materials are self-explanatory. Often they are more obscure than they think. To allow any other stakeholders, including their future selves, to exercise the five allowances listed above—i.e., explore, understand, reproduce, modify, and reuse the materials—, the preparation process and the end materials should be documented with enough detail. This can be done using README.txt files throughout the project. Using the <code>.txt</code> format/extension is recommended because other formats, such as Microsoft Word, may not be (fully) available in some computers. To exemplify the format and the content of readme files, below is an excerpt from a longitudinal study on which I’ve been working.</p>\n<textarea readonly=\"\" style=\"border: none; overflow: auto; outline: none; color: darkblue; font-size: 90%; min-width: 125%; height: 4600px; white-space: pre; overflow-wrap: normal; overflow-x: scroll;\">\n— Post-training test —\n\nIn Sessions 2, 3, 4 and 6, if the test is failed in the first attempt, the training and the test are \nrepeated (following González Alonso et al., 2020). In such cases, the result is shown at the end \nof the second attempt. The session advances if the accuracy achieved in the second attempt exceeds \n80%, whereas the session stops if the accuracy is lower. In the latter situation, an ‘End of session’ \nmessage is presented, flanked by two orange circles, and followed by an acknowledgement for the \nparticipant. Once the participant has read this screen, the experimenter quits the session by \npressing ‘ESC’ and then ‘Q’.\n\n\n== Stimuli ==\n\nThe stimulus lists are described in the R functions that were used to create the stimuli, as well as\nin the ‘list’ column in the stimulus files.\n\n\n== Participant-specific parameters for lab-based sessions ==\n\nEach participant was assigned certain parameters in advance, including the mini-language, the order \nof the resting-state parts, and the stimulus lists. The code that was used to create this assignment \nis available in the ‘stimulus_preparation’ folder. \n\nDue to the pre-assignment of the parameters, there is a fixed set of participant IDs that can be \nused in OpenSesame. These identification numbers range between 1 and 144. If an ID outside of this \nrange is used, the OpenSesame session does not run.\n\n\n== General procedure for lab-based sessions ==\n\nAt the beginning of Sessions 2, 3, 4 and 6, the experimenter starts OpenSesame by opening the \nprogram directly (not by opening the session-specific file), and then opens the appropriate session \nwithin OpenSesame. This procedure helps prevent the opening of a standalone Python window, the \nclosing of which would result in the closing of OpenSesame. Next, the experimenter opens BrainVision \nRecorder.\n\nNext, the experimenter fits the participant with the EEG cap, which they will wear throughout the \nsession. To prevent them from being pulled down, please attach the splitter box neatly to the \ntowel on the participant’s back. \n\nNext, the experimenter returns to OpenSesame and runs the session in full screen by clicking on \nthe full green triangle at the top left. Next, the experimenter selects a folder to store the \nlogfile. It is important to select the folder corresponding to each session to avoid overwriting \nexisting logfiles. Any prompts to overwrite a logfile must always be refused.\n\nIn the first screen, the experimenter can disable some of the tasks. This option can be used if a \nsession has ended abruptly, in which case the session can be resumed from a near checkpoint. In \nsuch a case, the experimenter must first note this incident in their logbook, and rename the log \nfile that was produced on the first run, by appending ‘_first_run’ to the name. This prevents \noverwriting the file on the second run. Next, they must open a new session, enter the same \nparticipant ID, and select the appropriate part from which to begin. This part must be the part \nimmediately following the last part that was completed in full. For instance, if a session ended\nabruptly during the experiment, the beginning selected on the second run would be the experiment. \nOnce the session has finished completely, the first log file and the second log file must be \nsafely merged into a single file, keeping only the fully completed tasks.\n\nIn the first instructional screen, participants are asked to refrain from asking any questions \nunless it is necessary, so that all participants can receive the same instructions.\n\nAt the beginning of the Resting-state part (present in Sessions 2 and 4) and at the beginning of \nthe Experiment part, instructions are presented on the screen that ask participants to stay as \nstill as possible during the following task. The screen contains an orange-coloured square with \nthe letters ‘i.s.r’, that remind the experimenter to check the impedance and the signal, and \nfinally to begin recording the EEG signal. If the impedance of any electrodes is poor, the \nexperimenter may enter the booth to lower the impedance of the electrodes affected. Otherwise, \nafter validating the signal and the impedance, the experimenter can begin the recording in \nBrainVision, and press the letter ‘C’ twice in the stimulus computer. At that point, a green \ncircle will appear, along with instructions for the participant. \n\nSimilarly, at the end of the Resting-state part and at the end of the Experiment part, a screen\nwith a crossed-out R appears to remind the experimenter to stop recording the EEG. \n\nNotice that, at some important stages during the sessions, the letter ‘C’ must be pressed twice \nby the experimenter to let the session continue. This protocol provides the experimenter with \ncontrol when necessary. These moments are signalled by a ‘wait a moment’ notice for the \nparticipant, and by two orange-coloured stripes on the screen. The experimenter should be aware \nof the use of the letter ‘C’ at these points, as the requirement is not signalled on the screen \nto prevent participants from pressing the letter themselves. \n\nDuring the experiment, it is important to monitor the EEG signal. If it ever becomes very noisy, \nthe experiment must be paused by pressing the ESC key, and the problem must be resolved. If the \nnoise is due to movement by the participant, they should be asked again to please stay as still \npossible. If the noise is due to an increase in the impedance of some electrodes, the impedance \nof those electrodes should be revised.\n\nThe Experiment part in each session contains a break every 40 trials. During these breaks, the \nnumber of the current trial appears in grey on the bottom right corner of the screen.\n\n\n== Definition of items in OpenSesame (only for programming purposes, not for in-session use) ==\n\n  — Each major part of the session is contained in a sequence item that is named in capital \n     letters (e.g., ‘PRETRAINING’, ‘TRAINING’, ‘TEST’, ‘EXPERIMENT’).\n\n  — ‘continue_space’: allows proceeding to the following screen after pressing the space bar, \n     which should be done by the participant. In most cases, two presses are required, as \n     detailed on the screen.\n\n  — ‘continue_c’: allows proceeding to the following screen after pressing the letter ‘C’, \n     which should be done by the experimenter. In most cases, two presses are required, as \n     detailed on the screen.\n\n\n== Variables in the OpenSesame log files ==\n\nIn the log files produced by OpenSesame, each part of the session (e.g., Test, Experiment) is \nidentified in the variable ‘session_part’. The names of the response variables are ‘response’,\n‘response_time’ and ‘correct’. Item-specific response variables follow the formats of \n‘response_[item_name]’, ‘response_time_[item_name]’ and ‘correct_[item_name]’ \n(see https://osdoc.cogsci.nl/3.3/manual/variables/#response-variables).\n\nThe output is verbose and requires preprocessing of the data. For instance, the last response \nin each loop may appear twice in the output, due to the processing of the response. These \nduplicates can–and must–be cleaned up by discarding the rows that have the same trial number\nas the preceding row.\n\n\n== EEG triggers ==\n\nTriggers are sent to the EEG recorder throughout the experiment. The system for sending \ntriggers is set up in OpenSesame script within the inline script ‘EEG_trigger_setup’.\n\nThe key to the triggers is provided below.\n\n  0: reset trigger port in BrainVision Recorder. This trigger is integrated in the \n     trigger-sending function.\n\n  — Resting-state EEG part —\n\n    10: beginning of eyes-open resting-state EEG\n\n    11: end of eyes-open resting-state EEG\n\n    12: beginning of eyes-closed resting-state EEG\n\n    13: end of eyes-closed resting-state EEG\n\n  — Experiment part —\n\n    5: fixation mark\n\n    — ID of each target sentence (only applicable to target trials) —\n\n        110–253: triggers ranging between 110 and 253, time-locked to the onset of the \n          word of interest in each trial.\n</textarea>\n<div class=\"section level3\" id=\"comments-in-code-scripts\">\n<h3>Comments in code scripts</h3>\n<p>It is helpful for our future selves, for our collaborators, and for any other stakeholders associated with a project—which includes any fellow researchers worldwide—to include comments in code scripts. These comments should introduce the purpose of the script at the top, and the purpose of various components of the code. Some excerpts are shown below as examples.</p>\n\n</div>\n</div>\n<div class=\"section level2\" id=\"open-source-software\">\n<h2>Open-source software</h2>\n<p>Where possible, open-source software should be used. Open-source software is free, and hence more accessible. Open-source software can be classified in various dimensions, such as the size of the user base. The more users, the greater the support, because the core developers have more resources, and the users will often help each other in public forums such as Stack Exchange. For instance, a programming language such as R boasts millions of users worldwide who count on support in public forums and in R-specific forums such as the <a href=\"https://community.rstudio.com/\" rel=\"nofollow\" target=\"_blank\">Posit Community</a>.</p>\n<p>Other software are not as large. For instance, open-source software for psychological research (e.g., <a href=\"https://osdoc.cogsci.nl/\" rel=\"nofollow\" target=\"_blank\">OpenSesame</a>, <a href=\"https://www.psychopy.org/\" rel=\"nofollow\" target=\"_blank\">psychoPy</a>) are far smaller than R in terms of community. Yet, these software too can count on substantial support. For the more basic uses, most of the way has already been paved, and the existing documentation suffices. For more advanced uses, the smaller size of the community can become more obvious, as one needs to spend more time researching on solutions for their needs.</p>\n<p>Regardless of the size of the community, all else being equal, open-source software is the right choice to ensure access to one’s work for all (potential) stakeholders in the future. The other option, proprietory software, entails dependence on the services of a private company.</p>\n</div>\n<div class=\"section level2\" id=\"tidiness-and-parsimony-in-computer-code\">\n<h2>Tidiness and parsimony in computer code</h2>\n<p>Code scripts should be as tidy and parsimonious as possible. For instance, to prevent overly long scripts that would impair the comprehension of the materials, it is useful to break down large projects into nested scripts, and <code>source</code> (i.e., run) the smaller scripts in the larger scripts.</p>\n<pre># Compose all stimuli for Sessions 2, 3, 4 and 6\n\n# Create participant-specific parameters\nsource('stimulus_preparation/participant_parameters.R')\n\n# Frame base images\nsource('stimulus_preparation/base_images.R')\n\n# Session 2\nsource('stimulus_preparation/Session 2/Session2_compile_all_stimuli.R')\n\n# Session 3\nsource('stimulus_preparation/Session 3/Session3_compile_all_stimuli.R')\n\n# Session 4\nsource('stimulus_preparation/Session 4/Session4_compile_all_stimuli.R')\n\n# Session 6\nsource('stimulus_preparation/Session 6/Session6_compile_all_stimuli.R')</pre>\n</div>\n<div class=\"section level2\" id=\"tidiness-and-parsimony-in-project-directories\">\n<h2>Tidiness and parsimony in project directories</h2>\n<p>A directory tree is useful to display all the folders in a project. The tree can be produced in the RStudio ‘Terminal’ console using the following one-line command.</p>\n<pre>find . -type d | sed -e \"s/[^-][^\\/]*\\//  |/g\" -e \"s/|\\([^ ]\\)/| - \\1/\"</pre>\n<p>The output will look like the following (excerpt from <a class=\"uri\" href=\"https://osf.io/gt5uf/wiki\" rel=\"nofollow\" target=\"_blank\">https://osf.io/gt5uf/wiki</a>).</p>\n<pre>.\n  | - bayesian_priors\n  |  | - plots\n  | - semanticpriming\n  |  | - analysis_with_visualsimilarity\n  |  |  | - model_diagnostics\n  |  |  |  | - results\n  |  |  |  | - plots\n  |  |  | - results\n  |  |  | - plots\n  |  |  | - correlations\n  |  |  |  | - plots\n  |  | - frequentist_bayesian_plots\n  |  |  | - plots\n  |  | - frequentist_analysis\n  |  |  | - model_diagnostics\n  |  |  |  | - results\n  |  |  |  | - plots\n  |  |  | - lexical_covariates_selection\n  |  |  |  | - results\n  |  |  |  | - plots\n  |  |  | - results\n  |  |  | - plots</pre>\n</div>\n</div>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 3.8.9-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://pablobernabeu.github.io/2023/fair-standards-for-the-creation-of-research-materials-with-examples/\"> R on Pablo Bernabeu</a></strong>.</div>\n<hr>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\r\n\r\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\r\n</hr></div> </div>\n</article>",
      "main_text": "FAIR standards for the creation of research materials, with examples\nPosted on\nNovember 1, 2023\nby\nR on Pablo Bernabeu\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nR on Pablo Bernabeu\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nNotwithstanding the need for speed in most scientific projects, what should be the\nminimum acceptable standards\nin the\ncreation of research materials\nsuch as stimuli, custom software for data collection (e.g., experiment in jsPsych, OpenSesame or psychoPy), or scripts for statistical analysis?\nThe answer to this question is contingent upon the field of research, the purpose and the duration of the project, and many other contextual factors. So, to narrow down the scope and come at a general answer, let’s suppose we asked a researcher in the cognitive sciences (e.g., a linguist, a psychologist or a neuroscientist) who values open science. Perhaps, such a researchers would be satisfied with a method for the creation of materials that\nallows the creators of the materials, as well as their collaborators and any other stakeholders (e.g., any fellow scientists working in the same field), to explore, understand, reproduce, modify, and reuse the materials following their completion and thereafter\n. Let’s review some of the implements that can help fulfil these standards.\nFAIRness\nThe\nFAIR Guiding Principles for scientific data management and stewardship\nexhaustively describe a protocol for making materials\nF\nindable,\nA\nccessible,\nI\nnteroperable and\nR\neusable. These terms cover the five allowances listed above, along with other important aspects.\nLet’s look at some instantiations of the FAIR principles.\nSharing the materials\nA condition sine qua non is to share the materials publicly online, as far as possible. Repositories on servers such as OSF or GitHub are often sufficient to this end. Unfortunately, most studies in the cognitive sciences still do not share the complete materials.\nOne of the reasons why sharing is so important is to prevent wrong assumptions by the audience that will consider the research. That is, when the materials of a study are not publicly shared online, the readers of the papers are left with two options: to assume that there were no errors or to assume that were some errors of an uncertain degree. The method followed in the creation of the materials should free the readers of this tribulation, by allowing them to consult the materials and their preparation in full, or as completely as possible.\nReproducibility\nIt is convenient to allow others, and our future selves, to reproduce the materials throughout their preparation and at any time thereafter. For this purpose,\nR\ncan be used to register in scripts as many as possible of the steps followed throughout the preparation of the materials. Far from being only a software for data analysis, R allows the preparation of texts, images, audios, etc. Humans err, by definition. That can be counted on. Conveniently, registering the steps followed during weeks or months of preparation allows us to offload part of the documentation efforts. It’s a way of video-recording, as it were, all the additions, subtractions, replacements, transformations and calculations performed with the raw materials.\nGenerous documentation\nUnder the curse of knowledge, the creators of research materials may believe that their materials are self-explanatory. Often they are more obscure than they think. To allow any other stakeholders, including their future selves, to exercise the five allowances listed above—i.e., explore, understand, reproduce, modify, and reuse the materials—, the preparation process and the end materials should be documented with enough detail. This can be done using README.txt files throughout the project. Using the\n.txt\nformat/extension is recommended because other formats, such as Microsoft Word, may not be (fully) available in some computers. To exemplify the format and the content of readme files, below is an excerpt from a longitudinal study on which I’ve been working.\n— Post-training test —\n\nIn Sessions 2, 3, 4 and 6, if the test is failed in the first attempt, the training and the test are \nrepeated (following González Alonso et al., 2020). In such cases, the result is shown at the end \nof the second attempt. The session advances if the accuracy achieved in the second attempt exceeds \n80%, whereas the session stops if the accuracy is lower. In the latter situation, an ‘End of session’ \nmessage is presented, flanked by two orange circles, and followed by an acknowledgement for the \nparticipant. Once the participant has read this screen, the experimenter quits the session by \npressing ‘ESC’ and then ‘Q’.\n\n== Stimuli ==\n\nThe stimulus lists are described in the R functions that were used to create the stimuli, as well as\nin the ‘list’ column in the stimulus files.\n\n== Participant-specific parameters for lab-based sessions ==\n\nEach participant was assigned certain parameters in advance, including the mini-language, the order \nof the resting-state parts, and the stimulus lists. The code that was used to create this assignment \nis available in the ‘stimulus_preparation’ folder. \n\nDue to the pre-assignment of the parameters, there is a fixed set of participant IDs that can be \nused in OpenSesame. These identification numbers range between 1 and 144. If an ID outside of this \nrange is used, the OpenSesame session does not run.\n\n== General procedure for lab-based sessions ==\n\nAt the beginning of Sessions 2, 3, 4 and 6, the experimenter starts OpenSesame by opening the \nprogram directly (not by opening the session-specific file), and then opens the appropriate session \nwithin OpenSesame. This procedure helps prevent the opening of a standalone Python window, the \nclosing of which would result in the closing of OpenSesame. Next, the experimenter opens BrainVision \nRecorder.\n\nNext, the experimenter fits the participant with the EEG cap, which they will wear throughout the \nsession. To prevent them from being pulled down, please attach the splitter box neatly to the \ntowel on the participant’s back. \n\nNext, the experimenter returns to OpenSesame and runs the session in full screen by clicking on \nthe full green triangle at the top left. Next, the experimenter selects a folder to store the \nlogfile. It is important to select the folder corresponding to each session to avoid overwriting \nexisting logfiles. Any prompts to overwrite a logfile must always be refused.\n\nIn the first screen, the experimenter can disable some of the tasks. This option can be used if a \nsession has ended abruptly, in which case the session can be resumed from a near checkpoint. In \nsuch a case, the experimenter must first note this incident in their logbook, and rename the log \nfile that was produced on the first run, by appending ‘_first_run’ to the name. This prevents \noverwriting the file on the second run. Next, they must open a new session, enter the same \nparticipant ID, and select the appropriate part from which to begin. This part must be the part \nimmediately following the last part that was completed in full. For instance, if a session ended\nabruptly during the experiment, the beginning selected on the second run would be the experiment. \nOnce the session has finished completely, the first log file and the second log file must be \nsafely merged into a single file, keeping only the fully completed tasks.\n\nIn the first instructional screen, participants are asked to refrain from asking any questions \nunless it is necessary, so that all participants can receive the same instructions.\n\nAt the beginning of the Resting-state part (present in Sessions 2 and 4) and at the beginning of \nthe Experiment part, instructions are presented on the screen that ask participants to stay as \nstill as possible during the following task. The screen contains an orange-coloured square with \nthe letters ‘i.s.r’, that remind the experimenter to check the impedance and the signal, and \nfinally to begin recording the EEG signal. If the impedance of any electrodes is poor, the \nexperimenter may enter the booth to lower the impedance of the electrodes affected. Otherwise, \nafter validating the signal and the impedance, the experimenter can begin the recording in \nBrainVision, and press the letter ‘C’ twice in the stimulus computer. At that point, a green \ncircle will appear, along with instructions for the participant. \n\nSimilarly, at the end of the Resting-state part and at the end of the Experiment part, a screen\nwith a crossed-out R appears to remind the experimenter to stop recording the EEG. \n\nNotice that, at some important stages during the sessions, the letter ‘C’ must be pressed twice \nby the experimenter to let the session continue. This protocol provides the experimenter with \ncontrol when necessary. These moments are signalled by a ‘wait a moment’ notice for the \nparticipant, and by two orange-coloured stripes on the screen. The experimenter should be aware \nof the use of the letter ‘C’ at these points, as the requirement is not signalled on the screen \nto prevent participants from pressing the letter themselves. \n\nDuring the experiment, it is important to monitor the EEG signal. If it ever becomes very noisy, \nthe experiment must be paused by pressing the ESC key, and the problem must be resolved. If the \nnoise is due to movement by the participant, they should be asked again to please stay as still \npossible. If the noise is due to an increase in the impedance of some electrodes, the impedance \nof those electrodes should be revised.\n\nThe Experiment part in each session contains a break every 40 trials. During these breaks, the \nnumber of the current trial appears in grey on the bottom right corner of the screen.\n\n== Definition of items in OpenSesame (only for programming purposes, not for in-session use) ==\n\n  — Each major part of the session is contained in a sequence item that is named in capital \n     letters (e.g., ‘PRETRAINING’, ‘TRAINING’, ‘TEST’, ‘EXPERIMENT’).\n\n  — ‘continue_space’: allows proceeding to the following screen after pressing the space bar, \n     which should be done by the participant. In most cases, two presses are required, as \n     detailed on the screen.\n\n  — ‘continue_c’: allows proceeding to the following screen after pressing the letter ‘C’, \n     which should be done by the experimenter. In most cases, two presses are required, as \n     detailed on the screen.\n\n== Variables in the OpenSesame log files ==\n\nIn the log files produced by OpenSesame, each part of the session (e.g., Test, Experiment) is \nidentified in the variable ‘session_part’. The names of the response variables are ‘response’,\n‘response_time’ and ‘correct’. Item-specific response variables follow the formats of \n‘response_[item_name]’, ‘response_time_[item_name]’ and ‘correct_[item_name]’ \n(see https://osdoc.cogsci.nl/3.3/manual/variables/#response-variables).\n\nThe output is verbose and requires preprocessing of the data. For instance, the last response \nin each loop may appear twice in the output, due to the processing of the response. These \nduplicates can–and must–be cleaned up by discarding the rows that have the same trial number\nas the preceding row.\n\n== EEG triggers ==\n\nTriggers are sent to the EEG recorder throughout the experiment. The system for sending \ntriggers is set up in OpenSesame script within the inline script ‘EEG_trigger_setup’.\n\nThe key to the triggers is provided below.\n\n  0: reset trigger port in BrainVision Recorder. This trigger is integrated in the \n     trigger-sending function.\n\n  — Resting-state EEG part —\n\n    10: beginning of eyes-open resting-state EEG\n\n    11: end of eyes-open resting-state EEG\n\n    12: beginning of eyes-closed resting-state EEG\n\n    13: end of eyes-closed resting-state EEG\n\n  — Experiment part —\n\n    5: fixation mark\n\n    — ID of each target sentence (only applicable to target trials) —\n\n        110–253: triggers ranging between 110 and 253, time-locked to the onset of the \n          word of interest in each trial.\nComments in code scripts\nIt is helpful for our future selves, for our collaborators, and for any other stakeholders associated with a project—which includes any fellow researchers worldwide—to include comments in code scripts. These comments should introduce the purpose of the script at the top, and the purpose of various components of the code. Some excerpts are shown below as examples.\nOpen-source software\nWhere possible, open-source software should be used. Open-source software is free, and hence more accessible. Open-source software can be classified in various dimensions, such as the size of the user base. The more users, the greater the support, because the core developers have more resources, and the users will often help each other in public forums such as Stack Exchange. For instance, a programming language such as R boasts millions of users worldwide who count on support in public forums and in R-specific forums such as the\nPosit Community\n.\nOther software are not as large. For instance, open-source software for psychological research (e.g.,\nOpenSesame\n,\npsychoPy\n) are far smaller than R in terms of community. Yet, these software too can count on substantial support. For the more basic uses, most of the way has already been paved, and the existing documentation suffices. For more advanced uses, the smaller size of the community can become more obvious, as one needs to spend more time researching on solutions for their needs.\nRegardless of the size of the community, all else being equal, open-source software is the right choice to ensure access to one’s work for all (potential) stakeholders in the future. The other option, proprietory software, entails dependence on the services of a private company.\nTidiness and parsimony in computer code\nCode scripts should be as tidy and parsimonious as possible. For instance, to prevent overly long scripts that would impair the comprehension of the materials, it is useful to break down large projects into nested scripts, and\nsource\n(i.e., run) the smaller scripts in the larger scripts.\n# Compose all stimuli for Sessions 2, 3, 4 and 6\n\n# Create participant-specific parameters\nsource('stimulus_preparation/participant_parameters.R')\n\n# Frame base images\nsource('stimulus_preparation/base_images.R')\n\n# Session 2\nsource('stimulus_preparation/Session 2/Session2_compile_all_stimuli.R')\n\n# Session 3\nsource('stimulus_preparation/Session 3/Session3_compile_all_stimuli.R')\n\n# Session 4\nsource('stimulus_preparation/Session 4/Session4_compile_all_stimuli.R')\n\n# Session 6\nsource('stimulus_preparation/Session 6/Session6_compile_all_stimuli.R')\nTidiness and parsimony in project directories\nA directory tree is useful to display all the folders in a project. The tree can be produced in the RStudio ‘Terminal’ console using the following one-line command.\nfind . -type d | sed -e \"s/[^-][^\\/]*\\//  |/g\" -e \"s/|\\([^ ]\\)/| - \\1/\"\nThe output will look like the following (excerpt from\nhttps://osf.io/gt5uf/wiki\n).\n.\n  | - bayesian_priors\n  |  | - plots\n  | - semanticpriming\n  |  | - analysis_with_visualsimilarity\n  |  |  | - model_diagnostics\n  |  |  |  | - results\n  |  |  |  | - plots\n  |  |  | - results\n  |  |  | - plots\n  |  |  | - correlations\n  |  |  |  | - plots\n  |  | - frequentist_bayesian_plots\n  |  |  | - plots\n  |  | - frequentist_analysis\n  |  |  | - model_diagnostics\n  |  |  |  | - results\n  |  |  |  | - plots\n  |  |  | - lexical_covariates_selection\n  |  |  |  | - results\n  |  |  |  | - plots\n  |  |  | - results\n  |  |  | - plots\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nR on Pablo Bernabeu\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
      "meta_description": "Notwithstanding the need for speed in most scientific projects, what should be the minimum acceptable standards in the creation of research materials such as stimuli, custom software for data collection (e.g., experiment in jsPsych, OpenSesame or psychoPy), or scripts for statistical analysis? The answer to this question is contingent upon the field of research, the purpose and the duration of the project, and many other contextual factors. So, to narrow down the scope and come at a general answer, let’s suppose we asked a researcher in the cognitive sciences (e.g., a linguist, a psychologist or a neuroscientist) who values open science. Perhaps, such a researchers would be satisfied with a method for the creation of materials that allows the creators of the materials, as well as their collaborators and any other stakeholders (e.g., any fellow scientists working in the same field), to explore, understand, reproduce, modify, and reuse the materials following their completion and thereafter. Let’s review some of the implements that can help fulfil these standards. FAIRness The FAIR Guiding Principles for scientific data management and stewardship exhaustively describe a protocol for making materials Findable, Accessible, Interoperable and Reusable. These terms cover the five allowances listed above, along with other important aspects. Let’s look at some instantiations of the FAIR principles. Sharing the materials A condition sine qua non is to share the materials publicly online, as far as possible. Repositories on servers such as OSF or GitHub are often sufficient to this end. Unfortunately, most studies in the cognitive sciences still do not share the complete materials. One of the reasons why sharing is so important is to prevent wrong assumptions by the audience that will consider the research. That is, when the materials of a study are not publicly shared online, the readers of the papers are left with two options: to assume that there were no errors or to assume that were some errors of an uncertain degree. The method followed in the creation of the materials should free the readers of this tribulation, by allowing them to consult the materials and their preparation in full, or as completely as possible. Reproducibility It is convenient to allow others, and our future selves, to reproduce the materials throughout their preparation and at any time thereafter. For this purpose, R can be used to register in scripts as many as possible of the steps followed throughout the preparation of the materials. Far from being only a software for data analysis, R allows the preparation of texts, images, audios, etc. Humans err, by definition. That can be counted on. Conveniently, registering the steps followed during weeks or months of preparation allows us to offload part of the documentation efforts. It’s a way of video-recording, as it were, all the additions, subtractions, replacements, transformations and calculations performed with the raw materials. Generous documentation Under the curse of knowledge, the creators of research materials may believe that their materials are self-explanatory. Often they are more obscure than they think. To allow any other stakeholders, including their future selves, to exercise the five allowances listed above—i.e., explore, understand, reproduce, modify, and reuse the materials—, the preparation process and the end materials should be documented with enough detail. This can be done using README.txt files throughout the project. Using the .txt format/extension is recommended because other formats, such as Microsoft Word, may not be (fully) available in some computers. To exemplify the format and the content of readme files, below is an excerpt from a longitudinal study on which I’ve been working. -- Post-training test -- In Sessions 2, 3, 4 and 6, if the test is failed in the first attempt, the training and the test are repeated (following González Alonso et al., 2020). In such cases, the result is shown at the end of the second attempt. The session advances if the accuracy achieved in the second attempt exceeds 80%, whereas the session stops if the accuracy is lower. In the latter situation, an 'End of session' message is presented, flanked by two orange circles, and followed by an acknowledgement for the participant. Once the participant has read this screen, the experimenter quits the session by pressing 'ESC' and then 'Q'. == Stimuli == The stimulus lists are described in the R functions that were used to create the stimuli, as well as in the 'list' column in the stimulus files. == Participant-specific parameters for lab-based sessions == Each participant was assigned certain parameters in advance, including the mini-language, the order of the resting-state parts, and the stimulus lists. The code that was used to create this assignment is available in the 'stimulus_preparation' folder. Due to the pre-assignment of the parameters, there is a fixed set of participant IDs that can be used in OpenSesame. These identification numbers range between 1 and 144. If an ID outside of this range is used, the OpenSesame session does not run. == General procedure for lab-based sessions == At the beginning of Sessions 2, 3, 4 and 6, the experimenter starts OpenSesame by opening the program directly (not by opening the session-specific file), and then opens the appropriate session within OpenSesame. This procedure helps prevent the opening of a standalone Python window, the closing of which would result in the closing of OpenSesame. Next, the experimenter opens BrainVision Recorder. Next, the experimenter fits the participant with the EEG cap, which they will wear throughout the session. To prevent them from being pulled down, please attach the splitter box neatly to the towel on the participant's back. Next, the experimenter returns to OpenSesame and runs the session in full screen by clicking on the full green triangle at the top left. Next, the experimenter selects a folder to store the logfile. It is important to select the folder corresponding to each session to avoid overwriting existing logfiles. Any prompts to overwrite a logfile must always be refused. In the first screen, the experimenter can disable some of the tasks. This option can be used if a session has ended abruptly, in which case the session can be resumed from a near checkpoint. In such a case, the experimenter must first note this incident in their logbook, and rename the log file that was produced on the first run, by appending '_first_run' to the name. This prevents overwriting the file on the second run. Next, they must open a new session, enter the same participant ID, and select the appropriate part from which to begin. This part must be the part immediately following the last part that was completed in full. For instance, if a session ended abruptly during the experiment, the beginning selected on the second run would be the experiment. Once the session has finished completely, the first log file and the second log file must be safely merged into a single file, keeping only the fully completed tasks. In the first instructional screen, participants are asked to refrain from asking any questions unless it is necessary, so that all participants can receive the same instructions. At the beginning of the Resting-state part (present in Sessions 2 and 4) and at the beginning of the Experiment part, instructions are presented on the screen that ask participants to stay as still as possible during the following task. The screen contains an orange-coloured square with the letters 'i.s.r', that remind the experimenter to check the impedance and the signal, and finally to begin recording the EEG signal. If the impedance of any electrodes is poor, the experimenter may enter the booth to lower the impedance of the electrodes affected. Otherwise, after validating the signal and the impedance, the experimenter can begin the recording in BrainVision, and press the letter 'C' twice in the stimulus computer. At that point, a green circle will appear, along with instructions for the participant. Similarly, at the end of the Resting-state part and at the end of the Experiment part, a screen with a crossed-out R appears to remind the experimenter to stop recording the EEG. Notice that, at some important stages during the sessions, the letter 'C' must be pressed twice by the experimenter to let the session continue. This protocol provides the experimenter with control when necessary. These moments are signalled by a 'wait a moment' notice for the participant, and by two orange-coloured stripes on the screen. The experimenter should be aware of the use of the letter 'C' at these points, as the requirement is not signalled on the screen to prevent participants from pressing the letter themselves. During the experiment, it is important to monitor the EEG signal. If it ever becomes very noisy, the experiment must be paused by pressing the ESC key, and the problem must be resolved. If the noise is due to movement by the participant, they should be asked again to please stay as still possible. If the noise is due to an increase in the impedance of some electrodes, the impedance of those electrodes should be revised. The Experiment part in each session contains a break every 40 trials. During these breaks, the number of the current trial appears in grey on the bottom right corner of the screen. == Definition of items in OpenSesame (only for programming purposes, not for in-session use) == -- Each major part of the session is contained in a sequence item that is named in capital letters (e.g., 'PRETRAINING', 'TRAINING', 'TEST', 'EXPERIMENT'). -- 'continue_space': allows proceeding to the following screen after pressing the space bar, which should be done by the participant. In most cases, two presses are required, as detailed on the screen. -- 'continue_c': allows proceeding to the following screen after pressing the letter 'C', which should be done by the experimenter. In most cases, two presses are required, as detailed on the screen. == Variables in the OpenSesame log files == In the log files produced by OpenSesame, each part of the session (e.g., Test, Experiment) is identified in the variable 'session_part'. The names of the response variables are 'response', 'response_time' and 'correct'. Item-specific response variables follow the formats of 'response_[item_name]', 'response_time_[item_name]' and 'correct_[item_name]' (see https://osdoc.cogsci.nl/3.3/manual/variables/#response-variables). The output is verbose and requires preprocessing of the data. For instance, the last response in each loop may appear twice in the output, due to the processing of the response. These duplicates can--and must--be cleaned up by discarding the rows that have the same trial number as the preceding row. == EEG triggers == Triggers are sent to the EEG recorder throughout the experiment. The system for sending triggers is set up in OpenSesame script within the inline script 'EEG_trigger_setup'. The key to the triggers is provided below. 0: reset trigger port in BrainVision Recorder. This trigger is integrated in the trigger-sending function. -- Resting-state EEG part -- 10: beginning of eyes-open resting-state EEG 11: end of eyes-open resting-state EEG 12: beginning of eyes-closed resting-state EEG 13: end of eyes-closed resting-state EEG -- Experiment part -- 5: fixation mark -- ID of each target sentence (only applicable to target trials) -- 110--253: triggers ranging between 110 and 253, time-locked to the onset of the word of interest in each trial. Comments in code scripts It is helpful for our future selves, for our collaborators, and for any other stakeholders associated with a project—which includes any fellow researchers worldwide—to include comments in code scripts. These comments should introduce the purpose of the script at the top, and the purpose of various components of the code. Some excerpts are shown below as examples. Open-source software Where possible, open-source software should be used. Open-source software is free, and hence more accessible. Open-source software can be classified in various dimensions, such as the size of the user base. The more users, the greater the support, because the core developers have more resources, and the users will often help each other in public forums such as Stack Exchange. For instance, a programming language such as R boasts millions of users worldwide who count on support in public forums and in R-specific forums such as the Posit Community. Other software are not as large. For instance, open-source software for psychological research (e.g., OpenSesame, psychoPy) are far smaller than R in terms of community. Yet, these software too can count on substantial support. For the more basic uses, most of the way has already been paved, and the existing documentation suffices. For more advanced uses, the smaller size of the community can become more obvious, as one needs to spend more time researching on solutions for their needs. Regardless of the size of the community, all else being equal, open-source software is the right choice to ensure access to one’s work for all (potential) stakeholders in the future. The other option, proprietory software, entails dependence on the services of a private company. Tidiness and parsimony in computer code Code scripts should be as tidy and parsimonious as possible. For instance, to prevent overly long scripts that would impair the comprehension of the materials, it is useful to break down large projects into nested scripts, and source (i.e., run) the smaller scripts in the larger scripts. # Compose all stimuli for Sessions 2, 3, 4 and 6 # Create participant-specific parameters source('stimulus_preparation/participant_parameters.R') # Frame base images source('stimulus_preparation/base_images.R') # Session 2 source('stimulus_preparation/Session 2/Session2_compile_all_stimuli.R') # Session 3 source('stimulus_preparation/Session 3/Session3_compile_all_stimuli.R') # Session 4 source('stimulus_preparation/Session 4/Session4_compile_all_stimuli.R') # Session 6 source('stimulus_preparation/Session 6/Session6_compile_all_stimuli.R') Tidiness and parsimony in project directories A directory tree is useful to display all the folders in a project. The tree can be produced in the RStudio ‘Terminal’ console using the following one-line command. find . -type d | sed -e \"s/[^-][^\\/]*\\// |/g\" -e \"s/|\\([^ ]\\)/| - /\" The output will look like the following (excerpt from https://osf.io/gt5uf/wiki). . | - bayesian_priors | | - plots | - semanticpriming | | - analysis_with_visualsimilarity | | | - model_diagnostics | | | | - results | | | | - plots | | | - results | | | - plots | | | - correlations | | | | - plots | | - frequentist_bayesian_plots | | | - plots | | - frequentist_analysis | | | - model_diagnostics | | | | - results | | | | - plots | | | - lexical_covariates_selection | | | | - results | | | | - plots | | | - results | | | - plots",
      "meta_keywords": null,
      "og_description": "Notwithstanding the need for speed in most scientific projects, what should be the minimum acceptable standards in the creation of research materials such as stimuli, custom software for data collection (e.g., experiment in jsPsych, OpenSesame or psychoPy), or scripts for statistical analysis? The answer to this question is contingent upon the field of research, the purpose and the duration of the project, and many other contextual factors. So, to narrow down the scope and come at a general answer, let’s suppose we asked a researcher in the cognitive sciences (e.g., a linguist, a psychologist or a neuroscientist) who values open science. Perhaps, such a researchers would be satisfied with a method for the creation of materials that allows the creators of the materials, as well as their collaborators and any other stakeholders (e.g., any fellow scientists working in the same field), to explore, understand, reproduce, modify, and reuse the materials following their completion and thereafter. Let’s review some of the implements that can help fulfil these standards. FAIRness The FAIR Guiding Principles for scientific data management and stewardship exhaustively describe a protocol for making materials Findable, Accessible, Interoperable and Reusable. These terms cover the five allowances listed above, along with other important aspects. Let’s look at some instantiations of the FAIR principles. Sharing the materials A condition sine qua non is to share the materials publicly online, as far as possible. Repositories on servers such as OSF or GitHub are often sufficient to this end. Unfortunately, most studies in the cognitive sciences still do not share the complete materials. One of the reasons why sharing is so important is to prevent wrong assumptions by the audience that will consider the research. That is, when the materials of a study are not publicly shared online, the readers of the papers are left with two options: to assume that there were no errors or to assume that were some errors of an uncertain degree. The method followed in the creation of the materials should free the readers of this tribulation, by allowing them to consult the materials and their preparation in full, or as completely as possible. Reproducibility It is convenient to allow others, and our future selves, to reproduce the materials throughout their preparation and at any time thereafter. For this purpose, R can be used to register in scripts as many as possible of the steps followed throughout the preparation of the materials. Far from being only a software for data analysis, R allows the preparation of texts, images, audios, etc. Humans err, by definition. That can be counted on. Conveniently, registering the steps followed during weeks or months of preparation allows us to offload part of the documentation efforts. It’s a way of video-recording, as it were, all the additions, subtractions, replacements, transformations and calculations performed with the raw materials. Generous documentation Under the curse of knowledge, the creators of research materials may believe that their materials are self-explanatory. Often they are more obscure than they think. To allow any other stakeholders, including their future selves, to exercise the five allowances listed above—i.e., explore, understand, reproduce, modify, and reuse the materials—, the preparation process and the end materials should be documented with enough detail. This can be done using README.txt files throughout the project. Using the .txt format/extension is recommended because other formats, such as Microsoft Word, may not be (fully) available in some computers. To exemplify the format and the content of readme files, below is an excerpt from a longitudinal study on which I’ve been working. -- Post-training test -- In Sessions 2, 3, 4 and 6, if the test is failed in the first attempt, the training and the test are repeated (following González Alonso et al., 2020). In such cases, the result is shown at the end of the second attempt. The session advances if the accuracy achieved in the second attempt exceeds 80%, whereas the session stops if the accuracy is lower. In the latter situation, an 'End of session' message is presented, flanked by two orange circles, and followed by an acknowledgement for the participant. Once the participant has read this screen, the experimenter quits the session by pressing 'ESC' and then 'Q'. == Stimuli == The stimulus lists are described in the R functions that were used to create the stimuli, as well as in the 'list' column in the stimulus files. == Participant-specific parameters for lab-based sessions == Each participant was assigned certain parameters in advance, including the mini-language, the order of the resting-state parts, and the stimulus lists. The code that was used to create this assignment is available in the 'stimulus_preparation' folder. Due to the pre-assignment of the parameters, there is a fixed set of participant IDs that can be used in OpenSesame. These identification numbers range between 1 and 144. If an ID outside of this range is used, the OpenSesame session does not run. == General procedure for lab-based sessions == At the beginning of Sessions 2, 3, 4 and 6, the experimenter starts OpenSesame by opening the program directly (not by opening the session-specific file), and then opens the appropriate session within OpenSesame. This procedure helps prevent the opening of a standalone Python window, the closing of which would result in the closing of OpenSesame. Next, the experimenter opens BrainVision Recorder. Next, the experimenter fits the participant with the EEG cap, which they will wear throughout the session. To prevent them from being pulled down, please attach the splitter box neatly to the towel on the participant's back. Next, the experimenter returns to OpenSesame and runs the session in full screen by clicking on the full green triangle at the top left. Next, the experimenter selects a folder to store the logfile. It is important to select the folder corresponding to each session to avoid overwriting existing logfiles. Any prompts to overwrite a logfile must always be refused. In the first screen, the experimenter can disable some of the tasks. This option can be used if a session has ended abruptly, in which case the session can be resumed from a near checkpoint. In such a case, the experimenter must first note this incident in their logbook, and rename the log file that was produced on the first run, by appending '_first_run' to the name. This prevents overwriting the file on the second run. Next, they must open a new session, enter the same participant ID, and select the appropriate part from which to begin. This part must be the part immediately following the last part that was completed in full. For instance, if a session ended abruptly during the experiment, the beginning selected on the second run would be the experiment. Once the session has finished completely, the first log file and the second log file must be safely merged into a single file, keeping only the fully completed tasks. In the first instructional screen, participants are asked to refrain from asking any questions unless it is necessary, so that all participants can receive the same instructions. At the beginning of the Resting-state part (present in Sessions 2 and 4) and at the beginning of the Experiment part, instructions are presented on the screen that ask participants to stay as still as possible during the following task. The screen contains an orange-coloured square with the letters 'i.s.r', that remind the experimenter to check the impedance and the signal, and finally to begin recording the EEG signal. If the impedance of any electrodes is poor, the experimenter may enter the booth to lower the impedance of the electrodes affected. Otherwise, after validating the signal and the impedance, the experimenter can begin the recording in BrainVision, and press the letter 'C' twice in the stimulus computer. At that point, a green circle will appear, along with instructions for the participant. Similarly, at the end of the Resting-state part and at the end of the Experiment part, a screen with a crossed-out R appears to remind the experimenter to stop recording the EEG. Notice that, at some important stages during the sessions, the letter 'C' must be pressed twice by the experimenter to let the session continue. This protocol provides the experimenter with control when necessary. These moments are signalled by a 'wait a moment' notice for the participant, and by two orange-coloured stripes on the screen. The experimenter should be aware of the use of the letter 'C' at these points, as the requirement is not signalled on the screen to prevent participants from pressing the letter themselves. During the experiment, it is important to monitor the EEG signal. If it ever becomes very noisy, the experiment must be paused by pressing the ESC key, and the problem must be resolved. If the noise is due to movement by the participant, they should be asked again to please stay as still possible. If the noise is due to an increase in the impedance of some electrodes, the impedance of those electrodes should be revised. The Experiment part in each session contains a break every 40 trials. During these breaks, the number of the current trial appears in grey on the bottom right corner of the screen. == Definition of items in OpenSesame (only for programming purposes, not for in-session use) == -- Each major part of the session is contained in a sequence item that is named in capital letters (e.g., 'PRETRAINING', 'TRAINING', 'TEST', 'EXPERIMENT'). -- 'continue_space': allows proceeding to the following screen after pressing the space bar, which should be done by the participant. In most cases, two presses are required, as detailed on the screen. -- 'continue_c': allows proceeding to the following screen after pressing the letter 'C', which should be done by the experimenter. In most cases, two presses are required, as detailed on the screen. == Variables in the OpenSesame log files == In the log files produced by OpenSesame, each part of the session (e.g., Test, Experiment) is identified in the variable 'session_part'. The names of the response variables are 'response', 'response_time' and 'correct'. Item-specific response variables follow the formats of 'response_[item_name]', 'response_time_[item_name]' and 'correct_[item_name]' (see https://osdoc.cogsci.nl/3.3/manual/variables/#response-variables). The output is verbose and requires preprocessing of the data. For instance, the last response in each loop may appear twice in the output, due to the processing of the response. These duplicates can--and must--be cleaned up by discarding the rows that have the same trial number as the preceding row. == EEG triggers == Triggers are sent to the EEG recorder throughout the experiment. The system for sending triggers is set up in OpenSesame script within the inline script 'EEG_trigger_setup'. The key to the triggers is provided below. 0: reset trigger port in BrainVision Recorder. This trigger is integrated in the trigger-sending function. -- Resting-state EEG part -- 10: beginning of eyes-open resting-state EEG 11: end of eyes-open resting-state EEG 12: beginning of eyes-closed resting-state EEG 13: end of eyes-closed resting-state EEG -- Experiment part -- 5: fixation mark -- ID of each target sentence (only applicable to target trials) -- 110--253: triggers ranging between 110 and 253, time-locked to the onset of the word of interest in each trial. Comments in code scripts It is helpful for our future selves, for our collaborators, and for any other stakeholders associated with a project—which includes any fellow researchers worldwide—to include comments in code scripts. These comments should introduce the purpose of the script at the top, and the purpose of various components of the code. Some excerpts are shown below as examples. Open-source software Where possible, open-source software should be used. Open-source software is free, and hence more accessible. Open-source software can be classified in various dimensions, such as the size of the user base. The more users, the greater the support, because the core developers have more resources, and the users will often help each other in public forums such as Stack Exchange. For instance, a programming language such as R boasts millions of users worldwide who count on support in public forums and in R-specific forums such as the Posit Community. Other software are not as large. For instance, open-source software for psychological research (e.g., OpenSesame, psychoPy) are far smaller than R in terms of community. Yet, these software too can count on substantial support. For the more basic uses, most of the way has already been paved, and the existing documentation suffices. For more advanced uses, the smaller size of the community can become more obvious, as one needs to spend more time researching on solutions for their needs. Regardless of the size of the community, all else being equal, open-source software is the right choice to ensure access to one’s work for all (potential) stakeholders in the future. The other option, proprietory software, entails dependence on the services of a private company. Tidiness and parsimony in computer code Code scripts should be as tidy and parsimonious as possible. For instance, to prevent overly long scripts that would impair the comprehension of the materials, it is useful to break down large projects into nested scripts, and source (i.e., run) the smaller scripts in the larger scripts. # Compose all stimuli for Sessions 2, 3, 4 and 6 # Create participant-specific parameters source('stimulus_preparation/participant_parameters.R') # Frame base images source('stimulus_preparation/base_images.R') # Session 2 source('stimulus_preparation/Session 2/Session2_compile_all_stimuli.R') # Session 3 source('stimulus_preparation/Session 3/Session3_compile_all_stimuli.R') # Session 4 source('stimulus_preparation/Session 4/Session4_compile_all_stimuli.R') # Session 6 source('stimulus_preparation/Session 6/Session6_compile_all_stimuli.R') Tidiness and parsimony in project directories A directory tree is useful to display all the folders in a project. The tree can be produced in the RStudio ‘Terminal’ console using the following one-line command. find . -type d | sed -e \"s/[^-][^\\/]*\\// |/g\" -e \"s/|\\([^ ]\\)/| - /\" The output will look like the following (excerpt from https://osf.io/gt5uf/wiki). . | - bayesian_priors | | - plots | - semanticpriming | | - analysis_with_visualsimilarity | | | - model_diagnostics | | | | - results | | | | - plots | | | - results | | | - plots | | | - correlations | | | | - plots | | - frequentist_bayesian_plots | | | - plots | | - frequentist_analysis | | | - model_diagnostics | | | | - results | | | | - plots | | | - lexical_covariates_selection | | | | - results | | | | - plots | | | - results | | | - plots",
      "og_image": "https://www.r-bloggers.com/wp-content/uploads/2016/04/R_02_2016-05-01.png",
      "og_title": "FAIR standards for the creation of research materials, with examples | R-bloggers",
      "raw_jsonld_article": null,
      "reading_time_min": 12.6,
      "sitemap_lastmod": "2023-11-02T00:00:00+00:00",
      "twitter_description": "Notwithstanding the need for speed in most scientific projects, what should be the minimum acceptable standards in the creation of research materials such as stimuli, custom software for data collection (e.g., experiment in jsPsych, OpenSesame or psychoPy), or scripts for statistical analysis? The answer to this question is contingent upon the field of research, the purpose and the duration of the project, and many other contextual factors. So, to narrow down the scope and come at a general answer, let’s suppose we asked a researcher in the cognitive sciences (e.g., a linguist, a psychologist or a neuroscientist) who values open science. Perhaps, such a researchers would be satisfied with a method for the creation of materials that allows the creators of the materials, as well as their collaborators and any other stakeholders (e.g., any fellow scientists working in the same field), to explore, understand, reproduce, modify, and reuse the materials following their completion and thereafter. Let’s review some of the implements that can help fulfil these standards. FAIRness The FAIR Guiding Principles for scientific data management and stewardship exhaustively describe a protocol for making materials Findable, Accessible, Interoperable and Reusable. These terms cover the five allowances listed above, along with other important aspects. Let’s look at some instantiations of the FAIR principles. Sharing the materials A condition sine qua non is to share the materials publicly online, as far as possible. Repositories on servers such as OSF or GitHub are often sufficient to this end. Unfortunately, most studies in the cognitive sciences still do not share the complete materials. One of the reasons why sharing is so important is to prevent wrong assumptions by the audience that will consider the research. That is, when the materials of a study are not publicly shared online, the readers of the papers are left with two options: to assume that there were no errors or to assume that were some errors of an uncertain degree. The method followed in the creation of the materials should free the readers of this tribulation, by allowing them to consult the materials and their preparation in full, or as completely as possible. Reproducibility It is convenient to allow others, and our future selves, to reproduce the materials throughout their preparation and at any time thereafter. For this purpose, R can be used to register in scripts as many as possible of the steps followed throughout the preparation of the materials. Far from being only a software for data analysis, R allows the preparation of texts, images, audios, etc. Humans err, by definition. That can be counted on. Conveniently, registering the steps followed during weeks or months of preparation allows us to offload part of the documentation efforts. It’s a way of video-recording, as it were, all the additions, subtractions, replacements, transformations and calculations performed with the raw materials. Generous documentation Under the curse of knowledge, the creators of research materials may believe that their materials are self-explanatory. Often they are more obscure than they think. To allow any other stakeholders, including their future selves, to exercise the five allowances listed above—i.e., explore, understand, reproduce, modify, and reuse the materials—, the preparation process and the end materials should be documented with enough detail. This can be done using README.txt files throughout the project. Using the .txt format/extension is recommended because other formats, such as Microsoft Word, may not be (fully) available in some computers. To exemplify the format and the content of readme files, below is an excerpt from a longitudinal study on which I’ve been working. -- Post-training test -- In Sessions 2, 3, 4 and 6, if the test is failed in the first attempt, the training and the test are repeated (following González Alonso et al., 2020). In such cases, the result is shown at the end of the second attempt. The session advances if the accuracy achieved in the second attempt exceeds 80%, whereas the session stops if the accuracy is lower. In the latter situation, an 'End of session' message is presented, flanked by two orange circles, and followed by an acknowledgement for the participant. Once the participant has read this screen, the experimenter quits the session by pressing 'ESC' and then 'Q'. == Stimuli == The stimulus lists are described in the R functions that were used to create the stimuli, as well as in the 'list' column in the stimulus files. == Participant-specific parameters for lab-based sessions == Each participant was assigned certain parameters in advance, including the mini-language, the order of the resting-state parts, and the stimulus lists. The code that was used to create this assignment is available in the 'stimulus_preparation' folder. Due to the pre-assignment of the parameters, there is a fixed set of participant IDs that can be used in OpenSesame. These identification numbers range between 1 and 144. If an ID outside of this range is used, the OpenSesame session does not run. == General procedure for lab-based sessions == At the beginning of Sessions 2, 3, 4 and 6, the experimenter starts OpenSesame by opening the program directly (not by opening the session-specific file), and then opens the appropriate session within OpenSesame. This procedure helps prevent the opening of a standalone Python window, the closing of which would result in the closing of OpenSesame. Next, the experimenter opens BrainVision Recorder. Next, the experimenter fits the participant with the EEG cap, which they will wear throughout the session. To prevent them from being pulled down, please attach the splitter box neatly to the towel on the participant's back. Next, the experimenter returns to OpenSesame and runs the session in full screen by clicking on the full green triangle at the top left. Next, the experimenter selects a folder to store the logfile. It is important to select the folder corresponding to each session to avoid overwriting existing logfiles. Any prompts to overwrite a logfile must always be refused. In the first screen, the experimenter can disable some of the tasks. This option can be used if a session has ended abruptly, in which case the session can be resumed from a near checkpoint. In such a case, the experimenter must first note this incident in their logbook, and rename the log file that was produced on the first run, by appending '_first_run' to the name. This prevents overwriting the file on the second run. Next, they must open a new session, enter the same participant ID, and select the appropriate part from which to begin. This part must be the part immediately following the last part that was completed in full. For instance, if a session ended abruptly during the experiment, the beginning selected on the second run would be the experiment. Once the session has finished completely, the first log file and the second log file must be safely merged into a single file, keeping only the fully completed tasks. In the first instructional screen, participants are asked to refrain from asking any questions unless it is necessary, so that all participants can receive the same instructions. At the beginning of the Resting-state part (present in Sessions 2 and 4) and at the beginning of the Experiment part, instructions are presented on the screen that ask participants to stay as still as possible during the following task. The screen contains an orange-coloured square with the letters 'i.s.r', that remind the experimenter to check the impedance and the signal, and finally to begin recording the EEG signal. If the impedance of any electrodes is poor, the experimenter may enter the booth to lower the impedance of the electrodes affected. Otherwise, after validating the signal and the impedance, the experimenter can begin the recording in BrainVision, and press the letter 'C' twice in the stimulus computer. At that point, a green circle will appear, along with instructions for the participant. Similarly, at the end of the Resting-state part and at the end of the Experiment part, a screen with a crossed-out R appears to remind the experimenter to stop recording the EEG. Notice that, at some important stages during the sessions, the letter 'C' must be pressed twice by the experimenter to let the session continue. This protocol provides the experimenter with control when necessary. These moments are signalled by a 'wait a moment' notice for the participant, and by two orange-coloured stripes on the screen. The experimenter should be aware of the use of the letter 'C' at these points, as the requirement is not signalled on the screen to prevent participants from pressing the letter themselves. During the experiment, it is important to monitor the EEG signal. If it ever becomes very noisy, the experiment must be paused by pressing the ESC key, and the problem must be resolved. If the noise is due to movement by the participant, they should be asked again to please stay as still possible. If the noise is due to an increase in the impedance of some electrodes, the impedance of those electrodes should be revised. The Experiment part in each session contains a break every 40 trials. During these breaks, the number of the current trial appears in grey on the bottom right corner of the screen. == Definition of items in OpenSesame (only for programming purposes, not for in-session use) == -- Each major part of the session is contained in a sequence item that is named in capital letters (e.g., 'PRETRAINING', 'TRAINING', 'TEST', 'EXPERIMENT'). -- 'continue_space': allows proceeding to the following screen after pressing the space bar, which should be done by the participant. In most cases, two presses are required, as detailed on the screen. -- 'continue_c': allows proceeding to the following screen after pressing the letter 'C', which should be done by the experimenter. In most cases, two presses are required, as detailed on the screen. == Variables in the OpenSesame log files == In the log files produced by OpenSesame, each part of the session (e.g., Test, Experiment) is identified in the variable 'session_part'. The names of the response variables are 'response', 'response_time' and 'correct'. Item-specific response variables follow the formats of 'response_[item_name]', 'response_time_[item_name]' and 'correct_[item_name]' (see https://osdoc.cogsci.nl/3.3/manual/variables/#response-variables). The output is verbose and requires preprocessing of the data. For instance, the last response in each loop may appear twice in the output, due to the processing of the response. These duplicates can--and must--be cleaned up by discarding the rows that have the same trial number as the preceding row. == EEG triggers == Triggers are sent to the EEG recorder throughout the experiment. The system for sending triggers is set up in OpenSesame script within the inline script 'EEG_trigger_setup'. The key to the triggers is provided below. 0: reset trigger port in BrainVision Recorder. This trigger is integrated in the trigger-sending function. -- Resting-state EEG part -- 10: beginning of eyes-open resting-state EEG 11: end of eyes-open resting-state EEG 12: beginning of eyes-closed resting-state EEG 13: end of eyes-closed resting-state EEG -- Experiment part -- 5: fixation mark -- ID of each target sentence (only applicable to target trials) -- 110--253: triggers ranging between 110 and 253, time-locked to the onset of the word of interest in each trial. Comments in code scripts It is helpful for our future selves, for our collaborators, and for any other stakeholders associated with a project—which includes any fellow researchers worldwide—to include comments in code scripts. These comments should introduce the purpose of the script at the top, and the purpose of various components of the code. Some excerpts are shown below as examples. Open-source software Where possible, open-source software should be used. Open-source software is free, and hence more accessible. Open-source software can be classified in various dimensions, such as the size of the user base. The more users, the greater the support, because the core developers have more resources, and the users will often help each other in public forums such as Stack Exchange. For instance, a programming language such as R boasts millions of users worldwide who count on support in public forums and in R-specific forums such as the Posit Community. Other software are not as large. For instance, open-source software for psychological research (e.g., OpenSesame, psychoPy) are far smaller than R in terms of community. Yet, these software too can count on substantial support. For the more basic uses, most of the way has already been paved, and the existing documentation suffices. For more advanced uses, the smaller size of the community can become more obvious, as one needs to spend more time researching on solutions for their needs. Regardless of the size of the community, all else being equal, open-source software is the right choice to ensure access to one’s work for all (potential) stakeholders in the future. The other option, proprietory software, entails dependence on the services of a private company. Tidiness and parsimony in computer code Code scripts should be as tidy and parsimonious as possible. For instance, to prevent overly long scripts that would impair the comprehension of the materials, it is useful to break down large projects into nested scripts, and source (i.e., run) the smaller scripts in the larger scripts. # Compose all stimuli for Sessions 2, 3, 4 and 6 # Create participant-specific parameters source('stimulus_preparation/participant_parameters.R') # Frame base images source('stimulus_preparation/base_images.R') # Session 2 source('stimulus_preparation/Session 2/Session2_compile_all_stimuli.R') # Session 3 source('stimulus_preparation/Session 3/Session3_compile_all_stimuli.R') # Session 4 source('stimulus_preparation/Session 4/Session4_compile_all_stimuli.R') # Session 6 source('stimulus_preparation/Session 6/Session6_compile_all_stimuli.R') Tidiness and parsimony in project directories A directory tree is useful to display all the folders in a project. The tree can be produced in the RStudio ‘Terminal’ console using the following one-line command. find . -type d | sed -e \"s/[^-][^\\/]*\\// |/g\" -e \"s/|\\([^ ]\\)/| - /\" The output will look like the following (excerpt from https://osf.io/gt5uf/wiki). . | - bayesian_priors | | - plots | - semanticpriming | | - analysis_with_visualsimilarity | | | - model_diagnostics | | | | - results | | | | - plots | | | - results | | | - plots | | | - correlations | | | | - plots | | - frequentist_bayesian_plots | | | - plots | | - frequentist_analysis | | | - model_diagnostics | | | | - results | | | | - plots | | | - lexical_covariates_selection | | | | - results | | | | - plots | | | - results | | | - plots",
      "twitter_title": "FAIR standards for the creation of research materials, with examples | R-bloggers",
      "url": "https://www.r-bloggers.com/2023/11/fair-standards-for-the-creation-of-research-materials-with-examples/",
      "word_count": 2525
    }
  }
}