{
  "id": "ce2a93a72b45c28bb3b9f21a61bc94bc951d8acb",
  "url": "https://www.r-bloggers.com/2025/03/template-to-handle-code-of-conduct-incidents-reports/",
  "created_at_utc": "2025-11-22T19:59:02Z",
  "data": null,
  "raw_original": {
    "uuid": "d2f13a73-3c14-4588-85d0-449e6963e07b",
    "created_at": "2025-11-22 19:59:02",
    "raw_json": {
      "article_author": null,
      "article_headline": null,
      "article_modified": null,
      "article_published": null,
      "article_section": null,
      "article_tags": null,
      "canonical_url": "https://www.r-bloggers.com/2025/03/template-to-handle-code-of-conduct-incidents-reports/",
      "crawled_at": "2025-11-22T10:52:17.352042",
      "external_links": [
        {
          "href": "https://ropensci.org/blog/2025/03/20/coc-incident-template/",
          "text": "rOpenSci - open tools for open science"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        },
        {
          "href": "https://rconf.gitlab.io/userknowledgebase/main/code-of-conduct-response-team-documents.html",
          "text": "useR! 2021 CoC Team"
        },
        {
          "href": "https://ropensci.org/code-of-conduct/",
          "text": "rOpenSci’s CoC"
        },
        {
          "href": "https://docs.google.com/document/d/1_CIFwszBLbfKcewf11Fl76UP6IcSpHBC98XhK8V4LvM/",
          "text": "This template serves as a guide for the CoC Team in handling incident reports and you can access it also on this google document format"
        },
        {
          "href": "https://ropensci.org/blog/2025/03/20/coc-incident-template/",
          "text": "rOpenSci - open tools for open science"
        },
        {
          "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
          "text": "daily e-mail updates"
        },
        {
          "href": "https://www.r-project.org/",
          "text": "R"
        },
        {
          "href": "https://www.r-users.com/",
          "text": "Click here if you're looking to post or find an R/data-science job"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        }
      ],
      "h1_title": "R-bloggers",
      "html_title": "Template To Handle Code of Conduct Incidents Reports | R-bloggers",
      "images": [],
      "internal_links": [
        {
          "href": "https://www.r-bloggers.com/author/ropensci-open-tools-for-open-science/",
          "text": "rOpenSci - open tools for open science"
        },
        {
          "href": "https://www.r-bloggers.com/category/r-bloggers/",
          "text": "R bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/contact-us/",
          "text": "here"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        },
        {
          "href": "https://www.r-bloggers.com/cdn-cgi/l/email-protection#5a3935343e2f392e1a28352a3f342939337435283d",
          "text": "[email protected]"
        },
        {
          "href": "https://www.r-bloggers.com/cdn-cgi/l/email-protection#95f6fafbf1e0f6e1d5e7fae5f0fbe6f6fcbbfae7f2",
          "text": "[email protected]"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers.com"
        },
        {
          "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
          "text": "learning R"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        }
      ],
      "lang": "en-US",
      "main_html": "<article class=\"post-391344 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">Template To Handle Code of Conduct Incidents Reports</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">March 19, 2025</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/ropensci-open-tools-for-open-science/\">rOpenSci - open tools for open science</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \n<div style=\"min-height: 30px;\">\n[social4i size=\"small\" align=\"align-left\"]\n</div>\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\n[This article was first published on  <strong><a href=\"https://ropensci.org/blog/2025/03/20/coc-incident-template/\"> rOpenSci - open tools for open science</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<p>Handling reported incidents related to a Code of Conduct (CoC) is a complex and delicate task. Managing reports timely and with care is crucial for maintaining a healthy and inclusive community.</p>\n<p>To assist with this process we’ve developed a template, based on the work of the <a href=\"https://rconf.gitlab.io/userknowledgebase/main/code-of-conduct-response-team-documents.html\" rel=\"nofollow\" target=\"_blank\">useR! 2021 CoC Team</a>, designed specifically for analyzing <a href=\"https://ropensci.org/code-of-conduct/\" rel=\"nofollow\" target=\"_blank\">rOpenSci’s CoC</a> incident reports. This template aims to provide a structured approach for assessing and addressing reports, ensuring that each report is reviewed with consistency.</p>\n<p>In this post, we walk through the key components of the template and how it can support teams in managing CoC incidents effectively.\nIt must be noted that using this template to review a report is a private, confidential, and internal action of the CoC team. The information is not shared with other rOpenSci members nor is it published. Annual transparency reports shared with the community only include <strong>anonymized</strong> descriptions of reported incidents and actions taken.</p>\n<h2>\nThe Template\n</h2><ul>\n<li>\n<p><strong>Report ID</strong>: A code to identify each report uniquely.</p>\n</li>\n<li>\n<p><strong>Date and time of the report</strong>: When the report was submitted. This is used to track our response times to ensure we comply with the process. For example, our policy is to send an acknowledgment email within 24 hours of receiving a report.</p>\n</li>\n<li>\n<p><strong>Medium used to report</strong>: How the report was submitted. For example, form, direct message, email, phone, personal conversation.</p>\n</li>\n<li>\n<p><strong>First deadline</strong>: When the a public acknowledgment needs to be made by.</p>\n</li>\n<li>\n<p><strong>Second deadline clock</strong>: When a decision needs to be made by.</p>\n</li>\n<li>\n<p><strong>Reporter(s)’s contact information</strong>: How to best contact the reporter. This ensures quick communication during the process.</p>\n</li>\n<li>\n<p><strong>Incident report checklist</strong>: The checklist of steps the CoC Team has to take to resolve the incident. For example:</p>\n<ul>\n<li>\n<p>Step 1: Email <a href=\"/cdn-cgi/l/email-protection#5a3935343e2f392e1a28352a3f342939337435283d\" rel=\"nofollow\" target=\"_blank\"><span class=\"__cf_email__\" data-cfemail=\"35565a5b5140564175475a45505b46565c1b5a4752\">[email protected]</span></a> to mark dates and timeline for planned response.</p>\n</li>\n<li>\n<p>Step 2: Open new document with Committee-only permissions and link to reported information.</p>\n</li>\n<li>\n<p>Step 3: Email person reporting to acknowledge receipt and cc <a href=\"/cdn-cgi/l/email-protection#95f6fafbf1e0f6e1d5e7fae5f0fbe6f6fcbbfae7f2\" rel=\"nofollow\" target=\"_blank\"><span class=\"__cf_email__\" data-cfemail=\"e685898882938592a6948996838895858fc8899481\">[email protected]</span></a>.</p>\n</li>\n<li>\n<p>Step n: …</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Reported person(s)</strong>: Who is being reported for inappropriate behavior.</p>\n</li>\n<li>\n<p><strong>Target(s)</strong>: Who was the target of the inappropriate behavior.</p>\n</li>\n<li>\n<p><strong>Witnesses</strong>: Any witnesses of the inappropriate behaviour.</p>\n</li>\n<li>\n<p><strong>CoC first responder</strong>: CoC team member who received the report and triggered the process to handle it.</p>\n</li>\n<li>\n<p><strong>Conflicts of interest</strong>: Any conflicts of interest on the CoC team. In the case of any conflicts of interest, the recused member will be excluded from the process. The remaining CoC members may ask for the assistance of an another independent person (preferring people with experience in CoC teams of other communities).</p>\n</li>\n<li>\n<p><strong>CoC sub-team</strong>: The sub-team that is handling the report, which may be smaller than the CoC team.</p>\n</li>\n<li>\n<p><strong>Incident – brief description</strong>: A description of the reported incident.</p>\n</li>\n<li>\n<p><strong>Incident – evidence</strong>: Evidence of inappropriate behaviour. For example, emails or screenshots of direct or public messages on different platforms like GitHub, Slack, Discourse.</p>\n</li>\n<li>\n<p><strong>Type of unacceptable behavior:</strong> Selected from a (non-exhaustive) checklist of inappropriate behaviors identified in the CoC. <em>When selecting, remember that we prioritize marginalized people’s safety over privileged people’s comfort. We will not act on complaints regarding: ‘reverse’ -isms, including ‘reverse racism,’ ‘reverse sexism,’ and ‘cisphobia’; reasonable communication of boundaries, such as “leave me alone,” “go away,” or “I’m not discussing this with you”; communicating in a ’tone’ you don’t find congenial; criticizing racist, sexist, cissexist, or otherwise oppressive behavior or assumptions</em></p>\n<ul>\n<li>\n<p>offensive comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), nationality, native language, or technology choices.</p>\n</li>\n<li>\n<p>unwelcome comments regarding a person’s lifestyle choices and practices, including those related to food, health, parenting, drugs, or employment.</p>\n</li>\n<li>\n<p>sustained or willful disruption of discussions, talks, or other events, including online discussion.</p>\n</li>\n<li>\n<p>deliberate intimidation.</p>\n</li>\n<li>\n<p>continued one-on-one communication after requests to cease.</p>\n</li>\n<li>\n<p>unwanted photography or recording, including logging online activity for harassment purposes.</p>\n</li>\n<li>\n<p>pattern of inappropriate social contact, such as requesting/assuming inappropriate levels of intimacy with others.</p>\n</li>\n<li>\n<p>inappropriate physical contact without consent or after a request to stop. In virtual settings, inappropriate simulated physical contact used without consent, such as textual descriptions like “hug” or “backrub” or emojis representing such contacts.</p>\n</li>\n<li>\n<p>stalking or following, including in virtual settings behavior such as persistent unwanted direct messages, sending unwanted pictures or malware links, or logging online activity for harassment purposes.</p>\n</li>\n<li>\n<p>threats of violence or incitement of violence towards any individual, including encouraging a person to commit suicide or to engage in self-harm.</p>\n</li>\n<li>\n<p>use of sexual or discriminatory imagery, comments, or jokes.</p>\n</li>\n<li>\n<p>unwelcome sexual attention, which can include inappropriate questions of a sexual nature, asking for sexual favors, or repeatedly asking for dates or contact information.</p>\n</li>\n<li>\n<p>deliberate ‘outing’ of any aspect of a person’s identity without their consent except as necessary to protect vulnerable people from intentional abuse</p>\n</li>\n<li>\n<p>deliberate misgendering or use of ‘dead’ or rejected names</p>\n</li>\n<li>\n<p>non-consensual publication of non-harassing private communication, including screenshots of private discussion channels or direct messages.</p>\n</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>\n<p><strong>Response:</strong> A description of the incident, the decision made by the CoC committee, and the rational for that decision.</p>\n</li>\n<li>\n<p><strong>Actions</strong>: Description/checklist of the actions to be taken by the CoC team and other community teams to implement the response.</p>\n</li>\n<li>\n<p><strong>Inform the reporter</strong>: The date, time and text for the communication of the response to the reporter.</p>\n</li>\n<li>\n<p><strong>Inform the reported person</strong>: The date, time and text for the communication of the response to the reported person (if necessary). Note that the decision may involve taking no action, so communication with the reported person is not mandatory.</p>\n</li>\n<li>\n<p><strong>Public Statement:</strong> An anonymized description of the reported incident for the annual CoC transparency report.</p>\n</li>\n<li>\n<p><strong>Future actions to avoid this type of incident</strong>: Description/checklist of actions which can be taken to help avoid future incidents.\nThis is part of the reflection process that helps to improve our CoC and our community. For example, we may clarify our CoC, or update text in our online resources.</p>\n</li>\n</ul>\n<p><a href=\"https://docs.google.com/document/d/1_CIFwszBLbfKcewf11Fl76UP6IcSpHBC98XhK8V4LvM/\" rel=\"nofollow\" target=\"_blank\">This template serves as a guide for the CoC Team in handling incident reports and you can access it also on this google document format</a>. Through testing in both simulated scenarios and real cases, we have found that it aids decision-making and helps reduce bias in our responses—especially in complex situations. Additionally, this template:</p>\n<ul>\n<li>standardizes the creation of anonymized descriptions for our annual rOpenSci CoC transparency report;</li>\n<li>is open to revision after each use, allowing for continuous improvement by the team;</li>\n<li>and its use facilitates knowledge transfer to future CoC Team members.</li>\n</ul>\n<p>We share this template not only for transparency but also in the hope that it may benefit other organizations. We welcome any suggestions based on your experience with CoC committees!</p>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://ropensci.org/blog/2025/03/20/coc-incident-template/\"> rOpenSci - open tools for open science</a></strong>.</div>\n<hr/>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\n\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div> </div>\n</article>",
      "main_text": "Template To Handle Code of Conduct Incidents Reports\nPosted on\nMarch 19, 2025\nby\nrOpenSci - open tools for open science\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nrOpenSci - open tools for open science\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nHandling reported incidents related to a Code of Conduct (CoC) is a complex and delicate task. Managing reports timely and with care is crucial for maintaining a healthy and inclusive community.\nTo assist with this process we’ve developed a template, based on the work of the\nuseR! 2021 CoC Team\n, designed specifically for analyzing\nrOpenSci’s CoC\nincident reports. This template aims to provide a structured approach for assessing and addressing reports, ensuring that each report is reviewed with consistency.\nIn this post, we walk through the key components of the template and how it can support teams in managing CoC incidents effectively.\nIt must be noted that using this template to review a report is a private, confidential, and internal action of the CoC team. The information is not shared with other rOpenSci members nor is it published. Annual transparency reports shared with the community only include\nanonymized\ndescriptions of reported incidents and actions taken.\nThe Template\nReport ID\n: A code to identify each report uniquely.\nDate and time of the report\n: When the report was submitted. This is used to track our response times to ensure we comply with the process. For example, our policy is to send an acknowledgment email within 24 hours of receiving a report.\nMedium used to report\n: How the report was submitted. For example, form, direct message, email, phone, personal conversation.\nFirst deadline\n: When the a public acknowledgment needs to be made by.\nSecond deadline clock\n: When a decision needs to be made by.\nReporter(s)’s contact information\n: How to best contact the reporter. This ensures quick communication during the process.\nIncident report checklist\n: The checklist of steps the CoC Team has to take to resolve the incident. For example:\nStep 1: Email\n[email protected]\nto mark dates and timeline for planned response.\nStep 2: Open new document with Committee-only permissions and link to reported information.\nStep 3: Email person reporting to acknowledge receipt and cc\n[email protected]\n.\nStep n: …\nReported person(s)\n: Who is being reported for inappropriate behavior.\nTarget(s)\n: Who was the target of the inappropriate behavior.\nWitnesses\n: Any witnesses of the inappropriate behaviour.\nCoC first responder\n: CoC team member who received the report and triggered the process to handle it.\nConflicts of interest\n: Any conflicts of interest on the CoC team. In the case of any conflicts of interest, the recused member will be excluded from the process. The remaining CoC members may ask for the assistance of an another independent person (preferring people with experience in CoC teams of other communities).\nCoC sub-team\n: The sub-team that is handling the report, which may be smaller than the CoC team.\nIncident – brief description\n: A description of the reported incident.\nIncident – evidence\n: Evidence of inappropriate behaviour. For example, emails or screenshots of direct or public messages on different platforms like GitHub, Slack, Discourse.\nType of unacceptable behavior:\nSelected from a (non-exhaustive) checklist of inappropriate behaviors identified in the CoC.\nWhen selecting, remember that we prioritize marginalized people’s safety over privileged people’s comfort. We will not act on complaints regarding: ‘reverse’ -isms, including ‘reverse racism,’ ‘reverse sexism,’ and ‘cisphobia’; reasonable communication of boundaries, such as “leave me alone,” “go away,” or “I’m not discussing this with you”; communicating in a ’tone’ you don’t find congenial; criticizing racist, sexist, cissexist, or otherwise oppressive behavior or assumptions\noffensive comments related to gender, gender identity and expression, age, sexual orientation, disability, physical appearance, body size, race, ethnicity, religion (or lack thereof), nationality, native language, or technology choices.\nunwelcome comments regarding a person’s lifestyle choices and practices, including those related to food, health, parenting, drugs, or employment.\nsustained or willful disruption of discussions, talks, or other events, including online discussion.\ndeliberate intimidation.\ncontinued one-on-one communication after requests to cease.\nunwanted photography or recording, including logging online activity for harassment purposes.\npattern of inappropriate social contact, such as requesting/assuming inappropriate levels of intimacy with others.\ninappropriate physical contact without consent or after a request to stop. In virtual settings, inappropriate simulated physical contact used without consent, such as textual descriptions like “hug” or “backrub” or emojis representing such contacts.\nstalking or following, including in virtual settings behavior such as persistent unwanted direct messages, sending unwanted pictures or malware links, or logging online activity for harassment purposes.\nthreats of violence or incitement of violence towards any individual, including encouraging a person to commit suicide or to engage in self-harm.\nuse of sexual or discriminatory imagery, comments, or jokes.\nunwelcome sexual attention, which can include inappropriate questions of a sexual nature, asking for sexual favors, or repeatedly asking for dates or contact information.\ndeliberate ‘outing’ of any aspect of a person’s identity without their consent except as necessary to protect vulnerable people from intentional abuse\ndeliberate misgendering or use of ‘dead’ or rejected names\nnon-consensual publication of non-harassing private communication, including screenshots of private discussion channels or direct messages.\nResponse:\nA description of the incident, the decision made by the CoC committee, and the rational for that decision.\nActions\n: Description/checklist of the actions to be taken by the CoC team and other community teams to implement the response.\nInform the reporter\n: The date, time and text for the communication of the response to the reporter.\nInform the reported person\n: The date, time and text for the communication of the response to the reported person (if necessary). Note that the decision may involve taking no action, so communication with the reported person is not mandatory.\nPublic Statement:\nAn anonymized description of the reported incident for the annual CoC transparency report.\nFuture actions to avoid this type of incident\n: Description/checklist of actions which can be taken to help avoid future incidents.\nThis is part of the reflection process that helps to improve our CoC and our community. For example, we may clarify our CoC, or update text in our online resources.\nThis template serves as a guide for the CoC Team in handling incident reports and you can access it also on this google document format\n. Through testing in both simulated scenarios and real cases, we have found that it aids decision-making and helps reduce bias in our responses—especially in complex situations. Additionally, this template:\nstandardizes the creation of anonymized descriptions for our annual rOpenSci CoC transparency report;\nis open to revision after each use, allowing for continuous improvement by the team;\nand its use facilitates knowledge transfer to future CoC Team members.\nWe share this template not only for transparency but also in the hope that it may benefit other organizations. We welcome any suggestions based on your experience with CoC committees!\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nrOpenSci - open tools for open science\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
      "meta_description": "Handling reported incidents related to a Code of Conduct (CoC) is a complex and delicate task. Managing reports timely and with care is crucial for maintaining a healthy and inclusive community. To assist with this process we’ve developed a template, ...",
      "meta_keywords": null,
      "og_description": "Handling reported incidents related to a Code of Conduct (CoC) is a complex and delicate task. Managing reports timely and with care is crucial for maintaining a healthy and inclusive community. To assist with this process we’ve developed a template, ...",
      "og_image": "https://www.r-bloggers.com/wp-content/uploads/2016/04/R_02_2016-05-01.png",
      "og_title": "Template To Handle Code of Conduct Incidents Reports | R-bloggers",
      "raw_jsonld_article": null,
      "reading_time_min": 6.3,
      "sitemap_lastmod": null,
      "twitter_description": "Handling reported incidents related to a Code of Conduct (CoC) is a complex and delicate task. Managing reports timely and with care is crucial for maintaining a healthy and inclusive community. To assist with this process we’ve developed a template, ...",
      "twitter_title": "Template To Handle Code of Conduct Incidents Reports | R-bloggers",
      "url": "https://www.r-bloggers.com/2025/03/template-to-handle-code-of-conduct-incidents-reports/",
      "word_count": 1268
    }
  }
}