{
  "id": "8e773630c977d1c7674455b81b75343c91dadab2",
  "url": "https://www.r-bloggers.com/2025/12/true-stories-from-the-data-battlefield-part-1-communicating-about-data/",
  "created_at_utc": "2025-12-09T21:36:30Z",
  "data": null,
  "raw_original": {
    "uuid": "a540c6c1-cd7c-447d-bb76-0d43bf66774a",
    "created_at": "2025-12-09 21:36:30",
    "raw_json": {
      "article_author": null,
      "article_headline": null,
      "article_modified": null,
      "article_published": null,
      "article_section": null,
      "article_tags": null,
      "canonical_url": "https://www.r-bloggers.com/2025/12/true-stories-from-the-data-battlefield-part-1-communicating-about-data/",
      "crawled_at": "2025-12-09T12:36:04.184409",
      "external_links": [
        {
          "href": "https://methodmatters.github.io/true-stories-part-1/",
          "text": "Method Matters Blog"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        },
        {
          "href": "https://www.linkedin.com/in/cesarlegendre",
          "text": "Cesar Legendre"
        },
        {
          "href": "https://www.linkedin.com/pulse/one-day-symposium-june-20th-2024-brussels-dierk-op-t-eynde-a3cdc/",
          "text": "2024 meeting"
        },
        {
          "href": "https://www.rdocumentation.org/packages/datasets/versions/3.6.2/topics/mtcars",
          "text": "mtcarsdataset"
        },
        {
          "href": "https://methodmatters.github.io/data-jobs-europe-2025-part-1/",
          "text": "enough work right now for data profiles"
        },
        {
          "href": "https://methodmatters.github.io/true-stories-part-1/",
          "text": "Method Matters Blog"
        },
        {
          "href": "https://feedburner.google.com/fb/a/mailverify?uri=RBloggers",
          "text": "daily e-mail updates"
        },
        {
          "href": "https://www.r-project.org/",
          "text": "R"
        },
        {
          "href": "https://www.r-users.com/",
          "text": "Click here if you're looking to post or find an R/data-science job"
        },
        {
          "href": "http://r-posts.com/",
          "text": "here"
        }
      ],
      "h1_title": "R-bloggers",
      "html_title": "True Stories from the (Data) Battlefield – Part 1: Communicating About Data | R-bloggers",
      "images": [
        {
          "alt": "graph too complicated",
          "base64": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
          "src": "https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif"
        },
        {
          "alt": "graph too complicated",
          "base64": null,
          "src": "https://i2.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toocomplicated_mypng.png?w=578&ssl=1"
        },
        {
          "alt": "graph too simple",
          "base64": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
          "src": "https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif"
        },
        {
          "alt": "graph too simple",
          "base64": null,
          "src": "https://i1.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toosimple_mypng.png?w=578&ssl=1"
        },
        {
          "alt": "graph leads to tunnel vision",
          "base64": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
          "src": "https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif"
        },
        {
          "alt": "graph leads to tunnel vision",
          "base64": null,
          "src": "https://i1.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/corr_mtcars_plot_mypng.png?w=578&ssl=1"
        },
        {
          "alt": "uncomfortable truth",
          "base64": "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
          "src": "https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif"
        },
        {
          "alt": "uncomfortable truth",
          "base64": null,
          "src": "https://i2.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/uncomfortable_truth.png?w=578&ssl=1"
        }
      ],
      "internal_links": [
        {
          "href": "https://www.r-bloggers.com/author/method-matters/",
          "text": "Method Matters"
        },
        {
          "href": "https://www.r-bloggers.com/category/r-bloggers/",
          "text": "R bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers"
        },
        {
          "href": "https://www.r-bloggers.com/contact-us/",
          "text": "here"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        },
        {
          "href": "https://www.r-bloggers.com/",
          "text": "R-bloggers.com"
        },
        {
          "href": "https://www.r-bloggers.com/how-to-learn-r-2/",
          "text": "learning R"
        },
        {
          "href": "https://www.r-bloggers.com/add-your-blog/",
          "text": "click here"
        }
      ],
      "lang": "en-US",
      "main_html": "<article class=\"post-397498 post type-post status-publish format-standard hentry category-r-bloggers\">\n<header class=\"post-header\">\n<h1 class=\"entry-title\">True Stories from the (Data) Battlefield – Part 1: Communicating About Data</h1>\n<p class=\"meta post-meta\">Posted on <span class=\"updated\">December 8, 2025</span>  by <span class=\"vcard author\"><a class=\"fn\" href=\"https://www.r-bloggers.com/author/method-matters/\">Method Matters</a></span>  in <a href=\"https://www.r-bloggers.com/category/r-bloggers/\" rel=\"category tag\">R bloggers</a> | 0 Comments</p>\n</header>\n<div class=\"entry clearfix\">\n<!-- \n<div style=\"min-height: 30px;\">\n[social4i size=\"small\" align=\"align-left\"]\n</div>\n-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 12px;\">\n[This article was first published on  <strong><a href=\"https://methodmatters.github.io/true-stories-part-1/\"> Method Matters Blog</a></strong>, and kindly contributed to <a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers</a>].  (You can report issue about the content on this page <a href=\"https://www.r-bloggers.com/contact-us/\">here</a>)\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div>\n\n<!-- Share buttons by mashshare.net - Version: 4.0.47--><p>The data professions (data science, analysis, engineering, etc.) are highly technical fields, and much online discussion (in particular, on this blog!), conference presentations and classes focus on technical aspects of data work or on the results of data analyses. These discussions are necessary for teaching important aspects of the data trade, but they often ignore the fact that data and analytics work takes place in an interpersonal and organizational context.</p>\n<p>In this blog post, the first of a series, we’ll present a selection of non-technical but common issues that data professionals face in organizations. We will offer a diagnosis of “why” such problems arise and present some potential solutions.</p>\n<p>We aim to contribute to the online data discourse by broadening the discussion to non-technical but important challenges to getting data work done, and to normalize the idea that, despite the decade-long hype around data, the day-to-day work is filled with common interpersonal and organizational challenges.</p>\n<p>This blog post is based on a talk given by myself and <a href=\"https://www.linkedin.com/in/cesarlegendre\" rel=\"nofollow\" target=\"_blank\">Cesar Legendre</a> at the <a href=\"https://www.linkedin.com/pulse/one-day-symposium-june-20th-2024-brussels-dierk-op-t-eynde-a3cdc/\" rel=\"nofollow\" target=\"_blank\">2024 meeting</a> of the Royal Statistical Society of Belgium in Brussels.</p>\n<h1 id=\"communicating-about-data\">Communicating About Data</h1>\n<p>In this first blog post, we will focus on problems that can occur when communicating to organizational stakeholders (colleagues, bosses, top management) about data topics.</p>\n<p>Below, we present a series of short case studies illustrating a problem or challenge we have seen first-hand. We describe what happened, the reaction from organizational stakeholders or clients, a diagnosis of the underlying issue, and offer potential solutions for solving the problem or avoiding it in the first place.</p>\n<h2 id=\"case-1-the-graph-was-too-complicated\">Case 1: The Graph Was Too Complicated</h2>\n<h3 id=\"what-happened\"><em>What Happened</em></h3>\n<ul>\n<li>In a meeting among the data science team and top management, a data scientist showed a graph that was too complicated. We have all seen this type of graph – there are too many data points represented, the axes are unlabeled or have unclear labels, there is no takeaway message.</li>\n</ul>\n<p><img alt=\"graph too complicated\" data-lazy-src=\"https://i2.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toocomplicated_mypng.png?w=578&amp;ssl=1\" data-recalc-dims=\"1\" src=\"https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif\"/><noscript><img alt=\"graph too complicated\" data-recalc-dims=\"1\" src=\"https://i2.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toocomplicated_mypng.png?w=578&amp;ssl=1\"/></noscript></p>\n<h3 id=\"the-reaction\"><em>The Reaction</em></h3>\n<ul>\n<li>This did not go over well. You could feel the energy leaving the room, the executives start to lose interest and disconnect. Non-data stakeholders started checking their phones… If the goal was to communicate the takeaways from a data analysis to decision makers, it failed spectacularly.</li>\n</ul>\n<h3 id=\"the-diagnosis\"><em>The Diagnosis</em></h3>\n<ul>\n<li>There was no match between the goals of the stakeholders (e.g. the management members in the room, who were the invitees to the discussion) and the data scientists presenting to them. The role of the executive in these types of discussions is to take in the essence of the situation at a high level, and make a decision, provide guidance or direction to the project. An inscrutable graph with no clear conclusion does not allow the executive to accomplish any of these tasks, and so they might rightly think that their time is being wasted in such a discussion.</li>\n</ul>\n<h3 id=\"the-solution\"><em>The Solution</em></h3>\n<ul>\n<li>\n<p>The solution here can be very simple: make simple, easy-to-understand graphs with clear takeaways (bonus points for including the conclusion in writing on the slide itself). This is harder than it sounds for many data professionals, because we are trained to see beauty in the whole story, and we often want to present the nuances that exist, particularly if they posed challenges to us in the analysis or cleaning of the data.</p>\n</li>\n<li>\n<p>However, especially in interaction with management stakeholders, you don’t need to show everything! We have found that a good strategy is to focus on the message or conclusion you want to communicate, and to show the data that supports it. This isn’t peer-review – you have explicitly been hired by the organization to analyze and synthesize, and present the conclusions that you feel are justified. In a healthy organization (more on that below), you are empowered as an expert to make these choices.</p>\n</li>\n</ul>\n<h2 id=\"case-2-the-graph-was-too-simple\">Case 2: The Graph Was Too Simple</h2>\n<p>If complicated graphs can be the source of communication issues, then simple graphs should be the solution, right? Unfortunately, this is not always the case.</p>\n<h3 id=\"what-happened-1\"><em>What Happened</em></h3>\n<ul>\n<li>In a meeting among the data science team and top management, a data scientist presented a graph that showed a simple comparison with a clear managerial / decision implication.</li>\n</ul>\n<p><img alt=\"graph too simple\" data-lazy-src=\"https://i1.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toosimple_mypng.png?w=578&amp;ssl=1\" data-recalc-dims=\"1\" src=\"https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif\"/><noscript><img alt=\"graph too simple\" data-recalc-dims=\"1\" src=\"https://i1.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toosimple_mypng.png?w=578&amp;ssl=1\"/></noscript></p>\n<h3 id=\"the-reaction-1\"><em>The Reaction</em></h3>\n<ul>\n<li>\n<p>Rather than being rewarded for showing a clear and compelling data visualization that had decision implications, the executives’ response was: “This isn’t good enough.” One executive in particular insisted that they needed drill downs, for example per region, per store within region, product category within store, etc.</p>\n</li>\n<li>\n<p>The marching orders from this meeting were to produce the additional visualizations and send them to management. However, there was no plan for following up on this additional work or any commitment for any resulting actions. The data team left the meeting with the feeling that this was just the beginning of a long and complicated cycle in which an endless series of graphs would be made, but that nothing would ever be done with them.</p>\n</li>\n</ul>\n<h3 id=\"the-diagnosis-1\"><em>The Diagnosis</em></h3>\n<p>Why does this happen? There are at least 2 diagnoses in our opinion.</p>\n<ul>\n<li>\n<p>The first explanation assumes good intentions on the part of the management stakeholder. The simple truth is that not everyone is equally comfortable with data or with making data-driven decisions. Among some stakeholders there is a feeling that, if they had all of the information, they would be able to completely understand the situation and decide with confidence. A related belief is that more information is better (this is why organizations build an often overwhelming number of dashboards, showing splits of the data according to a never-ending series of categories). Furthermore, some decision makers want to make many local decisions – e.g. to manage each country, region, store, or individual product in its own way, though this can quickly become unmanageable.</p>\n</li>\n<li>\n<p>The second explanation does not assume good intentions on the part of the organizational stakeholder. To executives who are used to simply going with their intuition or gut feeling, being challenged to integrate data into the decision-making process can be a somewhat threatening proposition. One strategy to simply ignore data completely is to leave the analysis unfinished by sending the data team down a never-ending series of rabbit holes while continuing to make decisions as usual.</p>\n</li>\n</ul>\n<h3 id=\"the-solution-1\"><em>The Solution</em></h3>\n<p>The solution here depends on the diagnosis of the problem.</p>\n<ul>\n<li>\n<p>If one assumes that the issue is a desire for mastery and a discomfort with numbers, a helpful strategy is to re-center the discussion on the high-level topic at hand. In the context of the graph shown above, one approach would be to say something along the lines of: “What are we trying to do here? We conducted an experiment to see whether using different types of promotions would impact our overall sales. We saw that customers who received Promotion A were 1.5 times more likely to buy the product than customers who received Promotion B. Our testing sample was representative of our customer base, and so the analysis suggests that we expand the use of Promotion A to all of our customers.”</p>\n</li>\n<li>\n<p>If one assumes that the issue is a desire to ignore data completely and continue on with business as usual, there’s not much that you as a data professional can do to change the managerial culture and address the underlying issue. A single occurrence of such behavior could just be a fluke, but if you keep finding yourself in this position, we would encourage you to reflect on whether you are in the right place in your organization, or in the right organization at all. If all you do is chase rabbits, you will wind up exhausted, never finish anything, and your work will have no impact.</p>\n</li>\n</ul>\n<h2 id=\"case-3-when-a-graph-leads-to-stakeholder-tunnel-vision\">Case 3: When A Graph Leads to Stakeholder Tunnel Vision</h2>\n<h3 id=\"what-happened-2\"><em>What Happened</em></h3>\n<ul>\n<li>In a meeting among the data science team and management, a data scientist presented a simple graph showing some patterns in the data. (The graph here is a correlation matrix of the <a href=\"https://www.rdocumentation.org/packages/datasets/versions/3.6.2/topics/mtcars\" rel=\"nofollow\" target=\"_blank\"><em>mtcars</em> dataset</a>, included for illustrative purposes).</li>\n</ul>\n<p><img alt=\"graph leads to tunnel vision\" data-lazy-src=\"https://i1.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/corr_mtcars_plot_mypng.png?w=578&amp;ssl=1\" data-recalc-dims=\"1\" src=\"https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif\"/><noscript><img alt=\"graph leads to tunnel vision\" data-recalc-dims=\"1\" src=\"https://i1.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/corr_mtcars_plot_mypng.png?w=578&amp;ssl=1\"/></noscript></p>\n<h3 id=\"the-reaction-2\"><em>The Reaction</em></h3>\n<ul>\n<li>\n<p>For reasons that were unclear to the data team, a manager exhibited an odd focus on a single data point and asked a great many questions about it, derailing the meeting and the higher-level discussion in the process.</p>\n</li>\n<li>\n<p>An example of what this looked like, applied to the correlational graph above:</p>\n<ul>\n<li>“Ah so the bubble with Weight and Weight is a big blue circle. Well, this Weight score is very important because this is one of our key metrics. So why is the dot so blue? And why is it so big? And what does it mean that the Weight and Weight has one of the biggest and bluest bubbles, compared to the other ones?” (<em>Note to the readers: the big blue circle indicates the correlation of the Weight variable with itself; the correlation is by definition 1, and explains why the bubble is big (it’s the largest possible correlation) and blue (the correlation is positive). There is nothing substantively interesting about this result.)</em></li>\n</ul>\n</li>\n</ul>\n<h3 id=\"the-diagnosis-2\"><em>The Diagnosis</em></h3>\n<ul>\n<li>\n<p>As in the case of the simple graph above, the problem might stem from discomfort on the part of a stakeholder who is not at ease with understanding data and graphs. Although this feels unnatural to many data professionals, the simple truth is that data makes many people uncomfortable. It is possible that this extreme focus on a single detail in a larger analysis reflects a desire for mastery over a topic that feels scary and uncontrollable.</p>\n</li>\n<li>\n<p>Another potential explanation concerns the performative function of meetings in the modern workplace. In an organizational setting, meetings are not simply a neutral environment where information is given and received. Especially in larger companies, and in meetings with large numbers of participants, simply making a point or digging into a detail is a strategy some people use to draw attention to themselves or show that they are making a contribution to the discussion. (Even if the contribution is negligible or counter-productive!)</p>\n</li>\n</ul>\n<h3 id=\"the-solution-2\"><em>The Solution</em></h3>\n<ul>\n<li>As described above, the recommended solution here is to take a step back and recenter the discussion. In the context of our correlation analysis above, we might step up and say – “What are we trying to do here? We are showing a correlation matrix of the most important variables, and we see that the correlations in this plot show that larger and more powerful cars get fewer miles per gallon (are less fuel-efficient). In our next slide, we show the results of a regression analysis that identifies the key drivers of our outcome metric.” And then move on to the next slide in order to continue with the story you are giving in your presentation.</li>\n</ul>\n<h2 id=\"case-4-when-the-data-reveal-an-uncomfortable-truth\">Case 4: When the Data Reveal an Uncomfortable Truth</h2>\n<h3 id=\"what-happened-3\"><em>What Happened</em></h3>\n<ul>\n<li>In a meeting with top management, a data scientist showed a simple chart of a metric by location, and made a simple observation about the pattern shown by the data – “ah, our metric is lower in Paris and Berlin vs. London.” This was a relatively simple observation, very clear from the graph, and the data scientist thought that this was some basic information that management should be aware of.</li>\n</ul>\n<p><img alt=\"uncomfortable truth\" data-lazy-src=\"https://i2.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/uncomfortable_truth.png?w=578&amp;ssl=1\" data-recalc-dims=\"1\" src=\"https://www.r-bloggers.com/wp-content/plugins/jetpack/modules/lazy-images/images/1x1.trans.gif\"/><noscript><img alt=\"uncomfortable truth\" data-recalc-dims=\"1\" src=\"https://i2.wp.com/methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/uncomfortable_truth.png?w=578&amp;ssl=1\"/></noscript></p>\n<h3 id=\"the-reaction-3\"><em>The Reaction</em></h3>\n<ul>\n<li>The reaction on the part of the senior stakeholder, however, was explosive. There was a fair amount of yelling and shouting, not particularly related to the topic at hand. It was as if a toddler in a suit was having a meltdown. The meeting ended quickly, and the executive made it clear he did not want the project to continue or to see the data scientists again.</li>\n</ul>\n<h3 id=\"the-diagnosis-3\"><em>The Diagnosis</em></h3>\n<ul>\n<li>The executive was aware of the situation that the data visualization revealed. However, the facts that the data made clear were problematic for the executive’s scope of responsibility. Truly addressing the issue would have been difficult if not impossible given the organizational structure and geographic footprint. Rather than acknowledge the problem and work to solve it, the most expedient solution was to “shoot the messenger.”</li>\n</ul>\n<h3 id=\"the-solution-3\"><em>The Solution</em></h3>\n<ul>\n<li>There’s not a lot that a data scientist, or even a data scientist leader, can do in these situations. Nevertheless, shouting in meetings is completely unacceptable. Our recommendation is to simply look for another job. There is <a href=\"https://methodmatters.github.io/data-jobs-europe-2025-part-1/\" rel=\"nofollow\" target=\"_blank\">enough work right now for data profiles</a>, and you owe it to yourself to seek out a more professional organization.</li>\n</ul>\n<h1 id=\"summary-and-conclusion\">Summary and Conclusion</h1>\n<p>The goal of this blog post was to describe some common non-technical problems that are encountered by data professionals while working in organizational settings. We focused here on communicating about data, and some of the many things that can go wrong when we talk about data or present the results of a data project to colleagues.</p>\n<p>Communication in any organization can be difficult, and communication about data particularly so. Data topics can be complex, and such discussions can make people uncomfortable, or reveal facts that some stakeholders would prefer remain hidden. In many organizations, employees do not have much training or experience in data, and this often understandably leads to confusion as data projects start to be rolled out.</p>\n<p>Our goal here was not simply to make a list of potential difficult situations, but to give you some things to think about and some solutions to try when you run into similar problems. In our view, it’s worth talking about what can and does go wrong in data projects, because we believe this work is important. It is our hope that, the more we as a field talk about problems like these, the better awareness is (among data practitioners and their stakeholders!) and hopefully the better the whole field works. There is a tremendous opportunity to do better, so let’s take it!</p>\n<h3 id=\"coming-up-next\"><em>Coming Up Next</em></h3>\n<p>Our next blog post will focus on interpersonal issues that can pose problems in data projects. Stay tuned!</p>\n<h4 id=\"post-script-r-code-used-to-produce-the-graphs-shown-above\">Post-Script: R Code Used to Produce the Graphs Shown Above</h4>\n<details>\n<summary>Click here to view the R code used to make the graphs shown above.</summary>\n<figure class=\"highlight\"><pre>  \n\n# Load necessary libraries\nlibrary(ggplot2)\nlibrary(dplyr)\nlibrary(ggpubr)\nlibrary(corrplot)\n\n\n# Set seed for reproducibility\nset.seed(43)\n\n################################\n# The graph was too complicated\n################################\n\n\n# Generate a random permutation of 8 predefined group means\n# These represent different average values for each group\ngroup_means &lt;- sample(c(10, 15, 20, 20.01, 30, 35, 40, 40.2))\n\n# Display the randomly sampled group means\ngroup_means\n\n# Create a data frame with two columns: Group and Value\n# Group: factor with 8 levels, each repeated 30 times (240 observations in total)\n# Value: for each group mean, generate 30 random values from a normal distribution\n# with the specified mean from the group_means vector and a standard deviation of 5\ndata_too_complicated &lt;- data.frame(\n  Group = factor(rep(1:8, each = 30)),\n  Value = unlist(lapply(group_means, function(mean) rnorm(30, mean, 5)))\n)\n\n\n# Initialize a ggplot object using the dataset 'data_too_complicated'\nggplot(data_too_complicated, aes(x = Group, y = Value, fill = Group)) +\n # Add a boxplot layer to show the distribution of values for each group\n  geom_boxplot()  +\n  # Overlay jittered points to display individual observations\n  # width = 0.2 controls horizontal spread; alpha = 0.5 makes points semi-transparent\n  geom_jitter(width = 0.2, alpha = 0.5)  +\n  # Add statistical comparison between all pairs of groups using t-tests\n  # comparisons = all pairwise combinations of Group levels\n  # label = \"p.signif\" shows significance stars; hide.ns = TRUE hides non-significant results\n  stat_compare_means(comparisons = combn(levels(data_too_complicated$Group), 2, simplify = FALSE),\n                     method = \"t.test\", label = \"p.signif\", hide.ns = TRUE) +\n  # Apply a minimal theme for a clean look\n  theme_minimal() +\n  # Add plot title and axis labels; customize legend title for fill\n  labs(title = \"Estimated Profit Per Client Group\",\n       x = \"Client Group\",\n       y = \"Value\",\n       fill = 'Client Group') +\n  # Format y-axis: scientific notation for labels and 10 evenly spaced breaks\n  scale_y_continuous(labels = scales::scientific,\n                     breaks = scales::pretty_breaks(n = 10)) +\n  # increase y-axis text size and add a black border around the plot\n  theme(axis.text.y = element_text(size = 12),\n        plot.background = element_rect(colour = \"black\", fill = NA, size = 1))\n\n###########################\n# The graph was too simple\n###########################\n\n\n# simulate the promotion data\ndata_too_simple &lt;- data.frame(\n  # Define the 'Promotion' column as a factor with two levels: Promotion A and Promotion B\n  Promotion = factor(c(\"Promotion A\", \"Promotion B\")),\n  # Define the 'Value' column: calculated values for each promotion\n  # Promotion A: 23 * 1.5 * 2.1; Promotion B: 23 * 2.1\n  Value = c(72.5, 48),\n  # Define the 'SE' (Standard Error) column for each promotion\n  # Promotion A: 2.5; Promotion B: 2\n  SE = c(2.5, 2)\n)\n\n\n# plot the simulated data\nggplot(data_too_simple, aes(x = Promotion, y = Value, fill = Promotion)) +\n  # Add bar chart layer with actual values (stat = \"identity\")\n  # Bars are dodged for side-by-side comparison and width set to 0.7\n  geom_bar(stat = \"identity\", position = position_dodge(), width = 0.7) +\n  # Add error bars to represent standard errors\n  # ymin and ymax define lower and upper bounds; width controls bar cap size\n  # Position dodged to align with bars\n  geom_errorbar(aes(ymin = Value - SE, ymax = Value + SE), width = 0.2, position = position_dodge(0.7)) +\n  # Add text labels showing rounded Value with a percentage sign\n  # vjust adjusts vertical position above bars; size sets font size\n  geom_text(aes(label = paste0(round(Value), \"%\")), vjust = -1.5, size = 5) +\n  # Manually set fill colors for each promotion for a visually appealing palette\n  scale_fill_manual(values = c(\"Promotion A\" = \"#FF5733\", \"Promotion B\" = \"#33C3FF\")) +\n  # Apply a minimal theme for a clean and modern look\n  theme_minimal() +\n  # Add plot title, axis labels, and subtitle explaining error bars\n  labs(title = \"Comparison of Promotion A and Promotion B\",\n       x = \"Promotion\",\n       y = \"Customer Purchase (%)\",\n       subtitle = \"Error bars represent standard errors\") +\n  # Configure y-axis: set limits from 0 to 100 and breaks every 10 units\n  scale_y_continuous(limits = c(0, 100), breaks = seq(0, 100, by = 10)) +\n  # Customize theme: axis text and titles size, bold plot title, and black border around plot\n  theme(axis.text = element_text(size = 12),\n        axis.title = element_text(size = 14),\n        plot.title = element_text(size = 16, face = \"bold\"),\n        plot.background = element_rect(colour = \"black\", fill = NA, size = 1))\n\n##########################################\n# Graph leads to stakeholder tunnel vision\n##########################################\n\n\n# Load the mtcars dataset\ndata(mtcars) \n# make a subselection of the columns\nmtcars &lt;- mtcars %&gt;% \n  select(wt, hp, cyl, disp, qsec, mpg, drat)\n\n# Calculate the correlation matrix\ncor_matrix &lt;- cor(mtcars)\n\n# Rename the columns of the correlation matrix to proper English names\ncolnames(cor_matrix) &lt;- c(\"Weight\", \"Horsepower\", \"Cylinders\", \"Displacement\", \n                          \"1/4 Mile Time\", \"Miles per Gallon\", \"Rear Axle Ratio\")\nrownames(cor_matrix) &lt;- colnames(cor_matrix)\n\n# Create a correlation plot using circles to represent correlation strength \ncorrplot(cor_matrix, method = \"circle\", type = \"upper\",\n         # Define color palette: gradient from red (negative) to white (neutral) to blue (positive)\n         # Generate 200 color steps for smooth transitions\n         col = colorRampPalette(c(\"red\", \"white\", \"blue\"))(200),\n         # Set text label size for variable names and color to black\n         tl.cex = 0.8, tl.col = \"black\",\n         # Set color legend size and position on the right\n         cl.cex = 0.8, cl.pos = \"r\",\n         # Add a title to the plot\n         title = 'Correlation of Important Variables',\n         # Adjust plot margins: bottom, left, top, right\n         mar = c(1, 1, 2, 1))\n# put a box around the edge of the plot\nbox(which = \"figure\", col = \"black\", lwd = 3)\n\n\n##########################################\n# When Data Reveal an Uncomfortable Truth\n##########################################\n\n# Simulated data for 7 cities\ndata_uncomfortable_truth &lt;- data.frame(\n  City = c(\"London\", \"Paris\", \"Berlin\", \"Madrid\", \"Rome\", \"Amsterdam\", \"Vienna\"),\n  Business_Metric = c(85, 78, 65, 60, 55, 50, 45)\n)\n\n# Order the cities by Business Metric from largest to smallest\ndata_uncomfortable_truth &lt;- data_uncomfortable_truth %&gt;%\n  arrange(desc(Business_Metric))\n\n\n# Create the bar chart\ndata_uncomfortable_truth %&gt;%\n  # set up plot aesthetics\n  ggplot(aes(x = reorder(City, -Business_Metric), \n             y = Business_Metric, \n             fill = City)) +\n  # specify barplot and width of bars\n  geom_bar(stat = \"identity\", width = 0.7) +\n  # minimal theme\n  theme_minimal() +\n  # make axis labels and title\n  labs(title = \"Business Metric by City\",\n       x = \"City\",\n       y = \"Business Metric\") +\n  # format text and background of the plot\n  theme(axis.text.x = element_text(angle = 45, hjust = 1),\n        plot.title = element_text(size = 16, face = \"bold\"),\n        legend.position = \"none\",\n        plot.background = element_rect(colour = \"black\", fill = NA, size = 1))</pre></figure>\n</details>\n<div class=\"jp-relatedposts\" id=\"jp-relatedposts\">\n<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>\n<!-- Share buttons by mashshare.net - Version: 4.0.47-->\n<div style=\"border: 1px solid; background: none repeat scroll 0 0 #EDEDED; margin: 1px; font-size: 13px;\">\n<div style=\"text-align: center;\">To <strong>leave a comment</strong> for the author, please follow the link and comment on their blog: <strong><a href=\"https://methodmatters.github.io/true-stories-part-1/\"> Method Matters Blog</a></strong>.</div>\n<hr/>\n<a href=\"https://www.r-bloggers.com/\" rel=\"nofollow\">R-bloggers.com</a> offers <strong><a href=\"https://feedburner.google.com/fb/a/mailverify?uri=RBloggers\" rel=\"nofollow\">daily e-mail updates</a></strong> about <a href=\"https://www.r-project.org/\" rel=\"nofollow\" title=\"The R Project for Statistical Computing\">R</a> news and tutorials about <a href=\"https://www.r-bloggers.com/how-to-learn-r-2/\" rel=\"nofollow\" title=\"R tutorials\">learning R</a> and many other topics. <a href=\"https://www.r-users.com/\" rel=\"nofollow\" title=\"Data science jobs\">Click here if you're looking to post or find an R/data-science job</a>.\n\n<hr/>Want to share your content on R-bloggers?<a href=\"https://www.r-bloggers.com/add-your-blog/\" rel=\"nofollow\"> click here</a> if you have a blog, or <a href=\"http://r-posts.com/\" rel=\"nofollow\"> here</a> if you don't.\n</div> </div>\n</article>",
      "main_text": "True Stories from the (Data) Battlefield – Part 1: Communicating About Data\nPosted on\nDecember 8, 2025\nby\nMethod Matters\nin\nR bloggers\n| 0 Comments\n[This article was first published on\nMethod Matters Blog\n, and kindly contributed to\nR-bloggers\n].  (You can report issue about the content on this page\nhere\n)\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.\nThe data professions (data science, analysis, engineering, etc.) are highly technical fields, and much online discussion (in particular, on this blog!), conference presentations and classes focus on technical aspects of data work or on the results of data analyses. These discussions are necessary for teaching important aspects of the data trade, but they often ignore the fact that data and analytics work takes place in an interpersonal and organizational context.\nIn this blog post, the first of a series, we’ll present a selection of non-technical but common issues that data professionals face in organizations. We will offer a diagnosis of “why” such problems arise and present some potential solutions.\nWe aim to contribute to the online data discourse by broadening the discussion to non-technical but important challenges to getting data work done, and to normalize the idea that, despite the decade-long hype around data, the day-to-day work is filled with common interpersonal and organizational challenges.\nThis blog post is based on a talk given by myself and\nCesar Legendre\nat the\n2024 meeting\nof the Royal Statistical Society of Belgium in Brussels.\nCommunicating About Data\nIn this first blog post, we will focus on problems that can occur when communicating to organizational stakeholders (colleagues, bosses, top management) about data topics.\nBelow, we present a series of short case studies illustrating a problem or challenge we have seen first-hand. We describe what happened, the reaction from organizational stakeholders or clients, a diagnosis of the underlying issue, and offer potential solutions for solving the problem or avoiding it in the first place.\nCase 1: The Graph Was Too Complicated\nWhat Happened\nIn a meeting among the data science team and top management, a data scientist showed a graph that was too complicated. We have all seen this type of graph – there are too many data points represented, the axes are unlabeled or have unclear labels, there is no takeaway message.\nThe Reaction\nThis did not go over well. You could feel the energy leaving the room, the executives start to lose interest and disconnect. Non-data stakeholders started checking their phones… If the goal was to communicate the takeaways from a data analysis to decision makers, it failed spectacularly.\nThe Diagnosis\nThere was no match between the goals of the stakeholders (e.g. the management members in the room, who were the invitees to the discussion) and the data scientists presenting to them. The role of the executive in these types of discussions is to take in the essence of the situation at a high level, and make a decision, provide guidance or direction to the project. An inscrutable graph with no clear conclusion does not allow the executive to accomplish any of these tasks, and so they might rightly think that their time is being wasted in such a discussion.\nThe Solution\nThe solution here can be very simple: make simple, easy-to-understand graphs with clear takeaways (bonus points for including the conclusion in writing on the slide itself). This is harder than it sounds for many data professionals, because we are trained to see beauty in the whole story, and we often want to present the nuances that exist, particularly if they posed challenges to us in the analysis or cleaning of the data.\nHowever, especially in interaction with management stakeholders, you don’t need to show everything! We have found that a good strategy is to focus on the message or conclusion you want to communicate, and to show the data that supports it. This isn’t peer-review – you have explicitly been hired by the organization to analyze and synthesize, and present the conclusions that you feel are justified. In a healthy organization (more on that below), you are empowered as an expert to make these choices.\nCase 2: The Graph Was Too Simple\nIf complicated graphs can be the source of communication issues, then simple graphs should be the solution, right? Unfortunately, this is not always the case.\nWhat Happened\nIn a meeting among the data science team and top management, a data scientist presented a graph that showed a simple comparison with a clear managerial / decision implication.\nThe Reaction\nRather than being rewarded for showing a clear and compelling data visualization that had decision implications, the executives’ response was: “This isn’t good enough.” One executive in particular insisted that they needed drill downs, for example per region, per store within region, product category within store, etc.\nThe marching orders from this meeting were to produce the additional visualizations and send them to management. However, there was no plan for following up on this additional work or any commitment for any resulting actions. The data team left the meeting with the feeling that this was just the beginning of a long and complicated cycle in which an endless series of graphs would be made, but that nothing would ever be done with them.\nThe Diagnosis\nWhy does this happen? There are at least 2 diagnoses in our opinion.\nThe first explanation assumes good intentions on the part of the management stakeholder. The simple truth is that not everyone is equally comfortable with data or with making data-driven decisions. Among some stakeholders there is a feeling that, if they had all of the information, they would be able to completely understand the situation and decide with confidence. A related belief is that more information is better (this is why organizations build an often overwhelming number of dashboards, showing splits of the data according to a never-ending series of categories). Furthermore, some decision makers want to make many local decisions – e.g. to manage each country, region, store, or individual product in its own way, though this can quickly become unmanageable.\nThe second explanation does not assume good intentions on the part of the organizational stakeholder. To executives who are used to simply going with their intuition or gut feeling, being challenged to integrate data into the decision-making process can be a somewhat threatening proposition. One strategy to simply ignore data completely is to leave the analysis unfinished by sending the data team down a never-ending series of rabbit holes while continuing to make decisions as usual.\nThe Solution\nThe solution here depends on the diagnosis of the problem.\nIf one assumes that the issue is a desire for mastery and a discomfort with numbers, a helpful strategy is to re-center the discussion on the high-level topic at hand. In the context of the graph shown above, one approach would be to say something along the lines of: “What are we trying to do here? We conducted an experiment to see whether using different types of promotions would impact our overall sales. We saw that customers who received Promotion A were 1.5 times more likely to buy the product than customers who received Promotion B. Our testing sample was representative of our customer base, and so the analysis suggests that we expand the use of Promotion A to all of our customers.”\nIf one assumes that the issue is a desire to ignore data completely and continue on with business as usual, there’s not much that you as a data professional can do to change the managerial culture and address the underlying issue. A single occurrence of such behavior could just be a fluke, but if you keep finding yourself in this position, we would encourage you to reflect on whether you are in the right place in your organization, or in the right organization at all. If all you do is chase rabbits, you will wind up exhausted, never finish anything, and your work will have no impact.\nCase 3: When A Graph Leads to Stakeholder Tunnel Vision\nWhat Happened\nIn a meeting among the data science team and management, a data scientist presented a simple graph showing some patterns in the data. (The graph here is a correlation matrix of the\nmtcars\ndataset\n, included for illustrative purposes).\nThe Reaction\nFor reasons that were unclear to the data team, a manager exhibited an odd focus on a single data point and asked a great many questions about it, derailing the meeting and the higher-level discussion in the process.\nAn example of what this looked like, applied to the correlational graph above:\n“Ah so the bubble with Weight and Weight is a big blue circle. Well, this Weight score is very important because this is one of our key metrics. So why is the dot so blue? And why is it so big? And what does it mean that the Weight and Weight has one of the biggest and bluest bubbles, compared to the other ones?” (\nNote to the readers: the big blue circle indicates the correlation of the Weight variable with itself; the correlation is by definition 1, and explains why the bubble is big (it’s the largest possible correlation) and blue (the correlation is positive). There is nothing substantively interesting about this result.)\nThe Diagnosis\nAs in the case of the simple graph above, the problem might stem from discomfort on the part of a stakeholder who is not at ease with understanding data and graphs. Although this feels unnatural to many data professionals, the simple truth is that data makes many people uncomfortable. It is possible that this extreme focus on a single detail in a larger analysis reflects a desire for mastery over a topic that feels scary and uncontrollable.\nAnother potential explanation concerns the performative function of meetings in the modern workplace. In an organizational setting, meetings are not simply a neutral environment where information is given and received. Especially in larger companies, and in meetings with large numbers of participants, simply making a point or digging into a detail is a strategy some people use to draw attention to themselves or show that they are making a contribution to the discussion. (Even if the contribution is negligible or counter-productive!)\nThe Solution\nAs described above, the recommended solution here is to take a step back and recenter the discussion. In the context of our correlation analysis above, we might step up and say – “What are we trying to do here? We are showing a correlation matrix of the most important variables, and we see that the correlations in this plot show that larger and more powerful cars get fewer miles per gallon (are less fuel-efficient). In our next slide, we show the results of a regression analysis that identifies the key drivers of our outcome metric.” And then move on to the next slide in order to continue with the story you are giving in your presentation.\nCase 4: When the Data Reveal an Uncomfortable Truth\nWhat Happened\nIn a meeting with top management, a data scientist showed a simple chart of a metric by location, and made a simple observation about the pattern shown by the data – “ah, our metric is lower in Paris and Berlin vs. London.” This was a relatively simple observation, very clear from the graph, and the data scientist thought that this was some basic information that management should be aware of.\nThe Reaction\nThe reaction on the part of the senior stakeholder, however, was explosive. There was a fair amount of yelling and shouting, not particularly related to the topic at hand. It was as if a toddler in a suit was having a meltdown. The meeting ended quickly, and the executive made it clear he did not want the project to continue or to see the data scientists again.\nThe Diagnosis\nThe executive was aware of the situation that the data visualization revealed. However, the facts that the data made clear were problematic for the executive’s scope of responsibility. Truly addressing the issue would have been difficult if not impossible given the organizational structure and geographic footprint. Rather than acknowledge the problem and work to solve it, the most expedient solution was to “shoot the messenger.”\nThe Solution\nThere’s not a lot that a data scientist, or even a data scientist leader, can do in these situations. Nevertheless, shouting in meetings is completely unacceptable. Our recommendation is to simply look for another job. There is\nenough work right now for data profiles\n, and you owe it to yourself to seek out a more professional organization.\nSummary and Conclusion\nThe goal of this blog post was to describe some common non-technical problems that are encountered by data professionals while working in organizational settings. We focused here on communicating about data, and some of the many things that can go wrong when we talk about data or present the results of a data project to colleagues.\nCommunication in any organization can be difficult, and communication about data particularly so. Data topics can be complex, and such discussions can make people uncomfortable, or reveal facts that some stakeholders would prefer remain hidden. In many organizations, employees do not have much training or experience in data, and this often understandably leads to confusion as data projects start to be rolled out.\nOur goal here was not simply to make a list of potential difficult situations, but to give you some things to think about and some solutions to try when you run into similar problems. In our view, it’s worth talking about what can and does go wrong in data projects, because we believe this work is important. It is our hope that, the more we as a field talk about problems like these, the better awareness is (among data practitioners and their stakeholders!) and hopefully the better the whole field works. There is a tremendous opportunity to do better, so let’s take it!\nComing Up Next\nOur next blog post will focus on interpersonal issues that can pose problems in data projects. Stay tuned!\nPost-Script: R Code Used to Produce the Graphs Shown Above\nClick here to view the R code used to make the graphs shown above.\n# Load necessary libraries\nlibrary(ggplot2)\nlibrary(dplyr)\nlibrary(ggpubr)\nlibrary(corrplot)\n\n# Set seed for reproducibility\nset.seed(43)\n\n################################\n# The graph was too complicated\n################################\n\n# Generate a random permutation of 8 predefined group means\n# These represent different average values for each group\ngroup_means <- sample(c(10, 15, 20, 20.01, 30, 35, 40, 40.2))\n\n# Display the randomly sampled group means\ngroup_means\n\n# Create a data frame with two columns: Group and Value\n# Group: factor with 8 levels, each repeated 30 times (240 observations in total)\n# Value: for each group mean, generate 30 random values from a normal distribution\n# with the specified mean from the group_means vector and a standard deviation of 5\ndata_too_complicated <- data.frame(\n  Group = factor(rep(1:8, each = 30)),\n  Value = unlist(lapply(group_means, function(mean) rnorm(30, mean, 5)))\n)\n\n# Initialize a ggplot object using the dataset 'data_too_complicated'\nggplot(data_too_complicated, aes(x = Group, y = Value, fill = Group)) +\n # Add a boxplot layer to show the distribution of values for each group\n  geom_boxplot()  +\n  # Overlay jittered points to display individual observations\n  # width = 0.2 controls horizontal spread; alpha = 0.5 makes points semi-transparent\n  geom_jitter(width = 0.2, alpha = 0.5)  +\n  # Add statistical comparison between all pairs of groups using t-tests\n  # comparisons = all pairwise combinations of Group levels\n  # label = \"p.signif\" shows significance stars; hide.ns = TRUE hides non-significant results\n  stat_compare_means(comparisons = combn(levels(data_too_complicated$Group), 2, simplify = FALSE),\n                     method = \"t.test\", label = \"p.signif\", hide.ns = TRUE) +\n  # Apply a minimal theme for a clean look\n  theme_minimal() +\n  # Add plot title and axis labels; customize legend title for fill\n  labs(title = \"Estimated Profit Per Client Group\",\n       x = \"Client Group\",\n       y = \"Value\",\n       fill = 'Client Group') +\n  # Format y-axis: scientific notation for labels and 10 evenly spaced breaks\n  scale_y_continuous(labels = scales::scientific,\n                     breaks = scales::pretty_breaks(n = 10)) +\n  # increase y-axis text size and add a black border around the plot\n  theme(axis.text.y = element_text(size = 12),\n        plot.background = element_rect(colour = \"black\", fill = NA, size = 1))\n\n###########################\n# The graph was too simple\n###########################\n\n# simulate the promotion data\ndata_too_simple <- data.frame(\n  # Define the 'Promotion' column as a factor with two levels: Promotion A and Promotion B\n  Promotion = factor(c(\"Promotion A\", \"Promotion B\")),\n  # Define the 'Value' column: calculated values for each promotion\n  # Promotion A: 23 * 1.5 * 2.1; Promotion B: 23 * 2.1\n  Value = c(72.5, 48),\n  # Define the 'SE' (Standard Error) column for each promotion\n  # Promotion A: 2.5; Promotion B: 2\n  SE = c(2.5, 2)\n)\n\n# plot the simulated data\nggplot(data_too_simple, aes(x = Promotion, y = Value, fill = Promotion)) +\n  # Add bar chart layer with actual values (stat = \"identity\")\n  # Bars are dodged for side-by-side comparison and width set to 0.7\n  geom_bar(stat = \"identity\", position = position_dodge(), width = 0.7) +\n  # Add error bars to represent standard errors\n  # ymin and ymax define lower and upper bounds; width controls bar cap size\n  # Position dodged to align with bars\n  geom_errorbar(aes(ymin = Value - SE, ymax = Value + SE), width = 0.2, position = position_dodge(0.7)) +\n  # Add text labels showing rounded Value with a percentage sign\n  # vjust adjusts vertical position above bars; size sets font size\n  geom_text(aes(label = paste0(round(Value), \"%\")), vjust = -1.5, size = 5) +\n  # Manually set fill colors for each promotion for a visually appealing palette\n  scale_fill_manual(values = c(\"Promotion A\" = \"#FF5733\", \"Promotion B\" = \"#33C3FF\")) +\n  # Apply a minimal theme for a clean and modern look\n  theme_minimal() +\n  # Add plot title, axis labels, and subtitle explaining error bars\n  labs(title = \"Comparison of Promotion A and Promotion B\",\n       x = \"Promotion\",\n       y = \"Customer Purchase (%)\",\n       subtitle = \"Error bars represent standard errors\") +\n  # Configure y-axis: set limits from 0 to 100 and breaks every 10 units\n  scale_y_continuous(limits = c(0, 100), breaks = seq(0, 100, by = 10)) +\n  # Customize theme: axis text and titles size, bold plot title, and black border around plot\n  theme(axis.text = element_text(size = 12),\n        axis.title = element_text(size = 14),\n        plot.title = element_text(size = 16, face = \"bold\"),\n        plot.background = element_rect(colour = \"black\", fill = NA, size = 1))\n\n##########################################\n# Graph leads to stakeholder tunnel vision\n##########################################\n\n# Load the mtcars dataset\ndata(mtcars) \n# make a subselection of the columns\nmtcars <- mtcars %>% \n  select(wt, hp, cyl, disp, qsec, mpg, drat)\n\n# Calculate the correlation matrix\ncor_matrix <- cor(mtcars)\n\n# Rename the columns of the correlation matrix to proper English names\ncolnames(cor_matrix) <- c(\"Weight\", \"Horsepower\", \"Cylinders\", \"Displacement\", \n                          \"1/4 Mile Time\", \"Miles per Gallon\", \"Rear Axle Ratio\")\nrownames(cor_matrix) <- colnames(cor_matrix)\n\n# Create a correlation plot using circles to represent correlation strength \ncorrplot(cor_matrix, method = \"circle\", type = \"upper\",\n         # Define color palette: gradient from red (negative) to white (neutral) to blue (positive)\n         # Generate 200 color steps for smooth transitions\n         col = colorRampPalette(c(\"red\", \"white\", \"blue\"))(200),\n         # Set text label size for variable names and color to black\n         tl.cex = 0.8, tl.col = \"black\",\n         # Set color legend size and position on the right\n         cl.cex = 0.8, cl.pos = \"r\",\n         # Add a title to the plot\n         title = 'Correlation of Important Variables',\n         # Adjust plot margins: bottom, left, top, right\n         mar = c(1, 1, 2, 1))\n# put a box around the edge of the plot\nbox(which = \"figure\", col = \"black\", lwd = 3)\n\n##########################################\n# When Data Reveal an Uncomfortable Truth\n##########################################\n\n# Simulated data for 7 cities\ndata_uncomfortable_truth <- data.frame(\n  City = c(\"London\", \"Paris\", \"Berlin\", \"Madrid\", \"Rome\", \"Amsterdam\", \"Vienna\"),\n  Business_Metric = c(85, 78, 65, 60, 55, 50, 45)\n)\n\n# Order the cities by Business Metric from largest to smallest\ndata_uncomfortable_truth <- data_uncomfortable_truth %>%\n  arrange(desc(Business_Metric))\n\n# Create the bar chart\ndata_uncomfortable_truth %>%\n  # set up plot aesthetics\n  ggplot(aes(x = reorder(City, -Business_Metric), \n             y = Business_Metric, \n             fill = City)) +\n  # specify barplot and width of bars\n  geom_bar(stat = \"identity\", width = 0.7) +\n  # minimal theme\n  theme_minimal() +\n  # make axis labels and title\n  labs(title = \"Business Metric by City\",\n       x = \"City\",\n       y = \"Business Metric\") +\n  # format text and background of the plot\n  theme(axis.text.x = element_text(angle = 45, hjust = 1),\n        plot.title = element_text(size = 16, face = \"bold\"),\n        legend.position = \"none\",\n        plot.background = element_rect(colour = \"black\", fill = NA, size = 1))\nRelated\nTo\nleave a comment\nfor the author, please follow the link and comment on their blog:\nMethod Matters Blog\n.\nR-bloggers.com\noffers\ndaily e-mail updates\nabout\nR\nnews and tutorials about\nlearning R\nand many other topics.\nClick here if you're looking to post or find an R/data-science job\n.\nWant to share your content on R-bloggers?\nclick here\nif you have a blog, or\nhere\nif you don't.",
      "meta_description": "The data professions (data science, analysis, engineering, etc.) are highly technical fields, and much online discussion (in particular, on this blog!), conference presentations and classes focus on technical aspects of data work or on the results of d...",
      "meta_keywords": null,
      "og_description": "The data professions (data science, analysis, engineering, etc.) are highly technical fields, and much online discussion (in particular, on this blog!), conference presentations and classes focus on technical aspects of data work or on the results of d...",
      "og_image": "https://methodmatters.github.io/assets/img/2025-12-08-true-stories-part-1/toocomplicated_mypng.png",
      "og_title": "True Stories from the (Data) Battlefield – Part 1: Communicating About Data | R-bloggers",
      "raw_jsonld_article": null,
      "reading_time_min": 17.2,
      "sitemap_lastmod": null,
      "twitter_description": "The data professions (data science, analysis, engineering, etc.) are highly technical fields, and much online discussion (in particular, on this blog!), conference presentations and classes focus on technical aspects of data work or on the results of d...",
      "twitter_title": "True Stories from the (Data) Battlefield – Part 1: Communicating About Data | R-bloggers",
      "url": "https://www.r-bloggers.com/2025/12/true-stories-from-the-data-battlefield-part-1-communicating-about-data/",
      "word_count": 3446
    }
  }
}